const pirithData = {
    "karaniya": {
        "labels": [
            [
                3.113279,
                7.514149,
                1
            ],
            [
                7.533367,
                13.740708,
                2
            ],
            [
                14.221152,
                19.486822,
                3
            ],
            [
                19.50604,
                25.040758,
                4
            ],
            [
                25.694163,
                29.499282,
                5
            ],
            [
                29.499282,
                36.340809,
                6
            ],
            [
                36.93656,
                41.452737,
                7
            ],
            [
                41.529608,
                48.255828,
                8
            ],
            [
                48.890015,
                53.252449,
                9
            ],
            [
                53.252449,
                60.074759,
                10
            ],
            [
                60.612857,
                66.262882,
                11
            ],
            [
                66.262882,
                72.508658,
                12
            ],
            [
                73.162063,
                78.504603,
                13
            ],
            [
                78.504603,
                85.326913,
                14
            ],
            [
                85.865011,
                91.361294,
                15
            ],
            [
                91.361294,
                96.953666,
                16
            ],
            [
                97.510981,
                103.180224,
                17
            ],
            [
                103.180224,
                108.868685,
                18
            ],
            [
                109.406783,
                115.172115,
                19
            ],
            [
                115.172115,
                121.398673,
                20
            ],
            [
                121.955989,
                127.087134,
                21
            ],
            [
                127.087134,
                133.313693,
                22
            ],
            [
                133.736484,
                139.251985,
                23
            ],
            [
                139.251985,
                145.190276,
                24
            ],
            [
                145.786027,
                151.128568,
                25
            ],
            [
                151.128568,
                157.182167,
                26
            ],
            [
                157.681829,
                163.082023,
                27
            ],
            [
                163.082023,
                168.80892,
                28
            ],
            [
                169.270146,
                174.420509,
                29
            ],
            [
                174.420509,
                180.070535,
                30
            ],
            [
                180.570197,
                186.06648,
                31
            ],
            [
                186.06648,
                191.697288,
                32
            ],
            [
                192.754265,
                197.904628,
                33
            ],
            [
                197.904628,
                204.861462,
                34
            ],
            [
                205.39956,
                210.626794,
                35
            ],
            [
                210.626794,
                216.565086,
                36
            ],
            [
                217.122401,
                222.945387,
                37
            ],
            [
                222.945387,
                226.981119,
                38
            ],
            [
                227.519217,
                232.611927,
                39
            ],
            [
                232.611927,
                240.625738,
                40
            ]
        ],
        "pali": [
            "කරණීයමත්‍ථකුසලෙන",
            "යන්‌තං  සන්‌තං පදං අභිසමෙච්‌ච",
            "සක්‌කො උජූ ච සූජූ ච",
            "සුවචො චස්‌ස මුදු අනතිමානී.",
            "සන්‌තුස්‌සකො ච සුභරො ච",
            "අප්‌පකිච්‌චො ච සල්‌ලහුකවුත්‌ති,",
            "සන්‌තින්‍ද්‍රියො ච නිපකො ච",
            "අප්‌පගබ්‌භො කුලෙසු අනනුගිද්‌ධො.",
            "න ච ඛුද්‌දං සමාචරෙ",
            "කිඤ්‌චි යෙන විඤ්‌ඤූ පරෙ උපවදෙය්‍යුං",
            "සුඛිනො වා  ඛෙමිනො හොන්‌තු",
            "සබ්‌බෙ සත්‌තා  භවන්‌තු සුඛිතත්‌තා.",
            "යෙ කෙචි පාණභූතත්‍ථි",
            "තසා වා ථාවරා වා අනවසෙසා,",
            "දීඝා වා යෙ මහන්‌තා වා",
            "මජ්‌ඣිමා රස්‌සකා’ණුකථූලා.",
            "දිට්‌ඨා වා යෙව අද්දිට්‌ඨා",
            "යෙ ච දූරෙ වසන්‌ති අවිදූරෙ",
            "භූතා වා සම්‌භවෙසී වා",
            "සබ්‌බෙ සත්‌තා  භවන්‌තු සුඛිතත්‌තා.",
            "න පරො පරං නිකුබ්‌බෙථ",
            "නාතිමඤ්‌ඤෙථ කත්‍ථචි නං කඤ්‌චි",
            "බ්‍යාරොසනා පටිඝසඤ්‌ඤා",
            "නාඤ්‌ඤමඤ්‌ඤස්‌ස දුක්‌ඛමිච්‌ඡෙය්‍ය",
            "මාතා යථා නියං පුත්‌තං",
            "ආයුසා  එකපුත්‌තමනුරක්‌ඛෙ",
            "එවම්‌පි සබ්‌බභූතෙසු",
            "මානසං භාවයෙ අපරිමාණං.",
            "මෙත්‌තඤ්‌ච සබ්‌බලොකස්‌මිං",
            "මානසං භාවයෙ අපරිමාණං",
            "උද්‌ධං අධො ච තිරියං ච",
            "අසම්‌බාධං අවෙරං අසපත්‌තං",
            "තිට්‌ඨං චරං නිසින්‌නො වා",
            "සයානො වා යාවතස්‌ස විගතමිද්‌ධො",
            "එතං සතිං අධිට්‌ඨෙය්‍ය",
            "බ්‍රහ්‌මමෙතං විහාරං ඉධමාහු",
            "දිට්‌ඨිං ච අනුප‌ගම්‌ම සීලවා",
            "දස්‌සනෙන සම්‌පන්‌නො,",
            "කාමෙසු විනෙය්‍ය ගෙධං",
            "න හි ජාතු ගබ්‌භසෙය්‍යං පුනරෙතීති."
        ],
        "trans": {
            "0": "යම් ඒ ශාන්තිපද සඞ්ඛ්‍යාත නිර්‍වාණයෙක් වේ ද, එයට පැමිණ නොහොත් එය අවබොධ කොට වසනු කැමති අභිවෘද්ධිය සලසා ගැණීමෙහි දක්‍ෂයා විසින් එයට සුදුසු දෙය කළ යුතු ය. නිවණට පැමිණ වසනු කැමැත්තේ සත්‍යප්‍රතිවෙධය පිණිස පිළිපදින්නට නොහොත් කිසුණු පිරියම් කිරීම් වත් සමාදන් වීම් ආදී සියලු කාර්‍ය්‍යයන් කරන්නට දක්‍ෂයෙක් වන්නේ ය. (දක්‍ෂයකු විය යුතු ය.)",
            "2": "ඍජු වන්නේ ය. එක් වරක් ඍජු වීමෙන් නො නැවතී දිවි ඇති තාක් මනා කොට ඍජු වන්නේ ය. අන්‍යයන් ගේ අවවාද මනාකොට පිළිගැණීම් වශයෙන් සුවච වන්නේ ය. මෘදු වන්නේ ය. අතිමාන ඇත්තේ නො වන්නේ ය.",
            "4": "ලද දෙයින් සතුටු වන්නෙක් ද පහසුවෙන් පෝෂණය කළ හැක්කෙක් ද, (ස්වකීය ශ්‍රමණධර්‍මය කිරීමට පමණක් සිමා වූ ) ස්වල්ප කටයුතු ඇත්තෙක් ද, සැහැල්ලු පැවතුම් ඇත්තෙක් ද,",
            "6": "සන්හුන් ඉඳුරන් ඇත්තෙක් ද ප්‍රඥා ඇත්තෙක් ද, හැඩි දැඩි අසංවර ගති නැත්තෙක් ද, කුලයන් කෙරෙහි (සිවු පසයෙහි ඇලීම් ආදී වශයෙන්) නො ඇලුනෙක් ද වන්නේ ය.",
            "8": "නුවණැති අන්‍යයන් නින්‍දා කරණ සුළු වරදක් වත් නො කරන්නේ ය.",
            "10": "“සියලු සත්ත්‍වයෝ සැප ඇත්තෝ වෙත්වා, භය නැත්තෝ වෙත් වා, සුඛිත සිත් ඇත්තෝ වෙත් වා”යි ද,",
            "12": "තෘෂ්ණාභය සහිත හෙයින් තැති ගන්නා සුලු වූ ද තෘෂ්ණා භය ප්‍රහීණ කළ හෙයින් ස්ථාවර වූ ද යම් කිසි සත්ත්‍වයෝ ඇත්තාහු නම්, ඒ සියලුදෙනා ද,",
            "14": "(නාගාදි) දික් ශරීර ඇත්තෝ ද, (මත්ස්‍ය හස්ති අසුරා දී) මහත් ශරීර ඇත්තෝ ද, (අශ්වගවමහිෂාදී) මධ්‍යම ප්‍රමාණ ශරීර ඇත්තෝ ද, (වාමනාදී) මිටි සිරුරු ඇත්තෝ ද, (පියෙවි ඇසට නොපෙණෙන) ඉතා සියුම් ශරීර ඇත්තෝ ද, (මස් කැසුබු ආදී) ස්ථුල ශරීර ඇත්තෝ ද,",
            "16": "ඇස් හමුවට පැමිණීම් වශයෙන් දුටු සත්තු ද, ඈත සිටි හෙයින් නුදුටු සත්තු ද, යම් සත්ත්‍ව කෙනෙක් දුරත් ලඟත් වසත් නම් ඔහු ද,",
            "18": "ඉපදීම අවසන් කළ සත්ත්‍වයෝ ද (ක්‍ෂිණාශ්‍රවයෝ ද), මතු ඉපදීම සොයන (ශෛක්‍ෂ පෘථග්ජන) සත්ත්‍වයෝ ද යන මේ සියලු සත්ත්‍වයෝ සුඛිත සිත් ඇත්තෝ වෙත්’වා යි ද මෙත් වඩන්නේ ය.",
            "20": "එකෙක් අනෙකකු නො රවටන්නේ ය. (නො රවටාවා) අනෙකකුට අවමන් නො කරන්නේ ය. (නො කෙරේ වා)",
            "22": "බ්‍යාරොසනා නම් වූ කය හා වචනය පිළිබඳ විකෘතියෙන් ද ප්‍රතිඝසංඥා සඞ්ඛ්‍යාත මනෝවිකාරයෙන් ද එකෙක් අනෙකකුට දුකක් නො කැමති වන්නේ ය. (නො කැමති වේවා).",
            "24": "මව යම්සේ තමා ගෙන් ඇති වූ එක ම ඖරස පුත්‍රයා ජීවිතපරිත්‍යාගයෙන් වූවත් රක්නේ ද,",
            "26": "එ පරිද්දෙන් ම සියලු සත්ත්‍වයන් කෙරෙහි අප්‍රමාණ වූ මෛත්‍රීසහගත සිත වඩන්නේ ය.",
            "28": "සියලු ලෝකසත්ත්‍වයා කෙරෙහි අප්‍රමාණ වූ මෛත්‍රීසහගත සිත වඩන්නේ ය.",
            "30": "උඩ ද යට ද සරස ද (සතුරන් ය යි කියන ලද) සීමාවකුදු නැති ව අතරතුර වත් වෛර චේතනා පහළ වීමක් නැති ව, සතුරන් රහිත ව",
            "32": "සිටින්නේ හෝ ඇවිදින්නේ හෝ උන්නේ හෝ නිදන්නේ හෝ යම් තාක් මෛත්‍රීසහගත සිහිය ඉටනු කැමැත්තේ ද, ඒ තාක් පහ වූ මිද්ධය (අලස බව) ඇති ව ඉටන්නේ ය.",
            "34": "මේ මෛත්‍රීවිහරණය මේ බුද්ධශාසනයෙහි ශ්‍රේෂ්ඨ විහරණයැ යි ප්‍රකාශ කළහ.",
            "36": "(සත්ත්‍වයෙක් පුද්ගලයෙක් ඇත්තේ ය යන) මිථ්‍යදෘෂ්ටිය නො පැමිණ (ලොකොත්තරශීලයෙන්) සිල්වත් වූයේ (සෝතාපත්තිමග්ගසම්මාදිට්ඨි ය යි කියන ලද) දර්‍ශනයෙන් යුක්ත වූයේ",
            "38": "(සකෘදාගාමි අනාගාමී මාර්‍ග දෙකින්) වස්තුකාමයන්හි ගිජුබව දුරු කොට, ඒකාන්තයෙන් ම නැවත ගර්‍භයෙක් හි විසීමට නො පැමිණෙන්නේ ය. (ශුද්ධාවාසයයෙක ඉපිද එහි දි ම රහත්බවට පැමිණ පිරිනිවන් පාන්නේ ය.)"
        }
    }
}