const pirithData = {
    "02-saranagamanam": {
        "labels": [
            [
                0.306631,
                8.202377
            ],
            [
                8.611218,
                16.788042
            ],
            [
                17.222436,
                26.319153
            ],
            [
                27.647887,
                34.138242
            ],
            [
                34.700398,
                41.369621
            ],
            [
                41.752909,
                48.601
            ],
            [
                48.984288,
                57.161113
            ],
            [
                57.544401,
                65.440147
            ],
            [
                65.848989,
                74.230234
            ],
            [
                74.639075,
                82.764794
            ],
            [
                83.199188,
                91.197144
            ],
            [
                91.605985,
                100.038335
            ]
        ],
        "pali": [
            "නමො තස්‌ස භගවතො අරහතො සම්‌මාසම්‌බුද්‌ධස්‌ස.",
            "නමො තස්‌ස භගවතො අරහතො සම්‌මාසම්‌බුද්‌ධස්‌ස.",
            "නමො තස්‌ස භගවතො අරහතො සම්‌මාසම්‌බුද්‌ධස්‌ස.",
            "බුද්‌ධං සරණං ගච්‌ඡාමි.",
            "ධම්‌මං සරණං ගච්‌ඡාමි.",
            "සඞ්‌ඝං සරණං ගච්‌ඡාමි.",
            "දුතියම්‌පි බුද්‌ධං සරණං ගච්‌ඡාමි.",
            "දුතියම්‌පි ධම්‌මං සරණං ගච්‌ඡාමි.",
            "දුතියම්‌පි සඞ්‌ඝං සරණං ගච්‌ඡාමි.",
            "තතියම්‌පි බුද්‌ධං සරණං ගච්‌ඡාමි.",
            "තතියම්‌පි ධම්‌මං සරණං ගච්‌ඡාමි.",
            "තතියම්‌පි සඞ්‌ඝං සරණං ගච්‌ඡාමි."
        ],
        "trans": [
            "ඒ භාග්‍යවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේට නමස්කාර වේවා.",
            "ඒ භාග්‍යවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේට නමස්කාර වේවා.",
            "ඒ භාග්‍යවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේට නමස්කාර වේවා.",
            "බුදුරජුන් සරණයෙමි (පිහිට යැ යි දැන ගණිමි.)",
            "දහම් සරණ යෙමි (පිහිට යැ යි දැන ගණිමි.)",
            "සඟ සරණ යෙමි (පිහිට යැ යි දැන ගණිමි.)",
            "දෙවනු ද බුදුරජුන් සරණ යෙමි.",
            "දෙවනු ද දහම් සරණ යෙමි.",
            "දෙවනු ද සඟ සරණ යෙමි.",
            "තෙවනු ද බුදුරජුන් සරණ යෙමි.",
            "තෙවනු ද දහම් සරණ යෙමි.",
            "තෙවනු ද සඟ සරණ යෙමි."
        ]
    },
    "03-dasasikkhapadani": {
        "labels": [
            [
                0.464348,
                9.095761
            ],
            [
                9.560109,
                17.699859
            ],
            [
                18.191522,
                26.877563
            ],
            [
                27.369226,
                35.345088
            ],
            [
                35.809436,
                47.554713
            ],
            [
                48.019061,
                56.404642
            ],
            [
                56.868991,
                68.614267
            ],
            [
                69.297132,
                84.32016
            ],
            [
                85.38543,
                95.19137
            ],
            [
                95.683033,
                106.882017
            ]
        ],
        "pali": [
            "පාණාතිපාතා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "අදින්‌නාදානා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "අබ්‍රහ්‌මචරියා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "මුසාවාදා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "සුරාමෙරයමජ්‌ජපමාදට්‌ඨානා වෙරමණීසික්‌ඛාපදං {සමාදියාමි} .",
            "විකාලභොජනා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "නච්‌චගීතවාදිතවිසූකදස්‌සනා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "මාලාගන්‍ධවිලෙපනධාරණමණ්‌ඩනවිභූසනට්‌ඨානා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "උච්‌චාසයනමහාසයනා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}.",
            "ජාතරූපරජතපටිග්‌ගහණා වෙරමණීසික්‌ඛාපදං {සමාදියාමි}."
        ],
        "trans": [
            "පණිවායෙන් (සතුන් මැරීමෙන්) වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "අයිනා දනින් (නුදුන් දේ ගැනීමෙන්) වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "මෙවුන්දමින් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "මුස වායෙන් (බොරු කීමෙන්) වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "මදයටත් ප්‍රමාදයටත් හේතු වූ රහමෙර පීමෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "විකල් (නියම කාලය නොවන අවස්ථාවෙහි) බොජුනෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "නටනු ගයනු වයනු විසුළුදස්නෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "අඩු තැන් පිරවීමටත් සැරසීමටත් කරුණු වූ මල් ගඳ විලෙවුන් දැරීමෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "උසසුන්මහස්නෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි.",
            "රන් රිදී මසු කහවණු පිළිගැන්මෙන් වැළැක්ම වූ සිකපදය මනා කොට ගණිමි."
        ]
    },
    "04-samanera-panha": {
        "labels": [
            [
                0.511942,
                12.684794
            ],
            [
                13.253619,
                22.354816
            ],
            [
                22.8952,
                31.512896
            ],
            [
                32.024839,
                43.145364
            ],
            [
                43.571983,
                53.441094
            ],
            [
                53.924595,
                64.931356
            ],
            [
                65.301092,
                74.203201
            ],
            [
                74.629819,
                85.494374
            ],
            [
                85.892551,
                94.652454
            ],
            [
                95.079072,
                111.205257
            ]
        ],
        "pali": [
            "එකං නාම  කිං? සබ්‌බෙ සත්‌තා ආහාරට්‌ඨිතිකා.",
            "ද්‌වෙ නාම කිං? නාමඤ්‌ච රූපඤ්‌ච.",
            "තීණි නාම කිං? තිස්‌සො වෙදනා.",
            "චත්‌තාරි නාම කිං? චත්‌තාරි අරියසච්‌චානි.",
            "පඤ්‌ච නාම කිං? පඤ්‌චුපාදානක්‌ඛන්‍ධා.",
            "ඡ නාම කිං? ඡ අජ්‌ඣත්‌තිකානි ආයතනානි.",
            "සත්‌ත නාම කිං? සත්‌ත බොජ්‌ඣඞ්‌ගා.",
            "අට්‌ඨ නාම කිං? අරියො අට්‌ඨඞ්‌ගිකො මග්‌ගො.",
            "නව නාම කිං? නව සත්‌තාවාසා.",
            "දස නාම කිං? දසහඞ්‌ගෙහි සමන්‌නාගතො අරහා’ති වුච්‌චතීති."
        ],
        "trans": [
            "එක නම් කිම? සියලු සත්හු අහරින් සිටින්නෝ ය.",
            "දෙක නම් කිම? නාම රූප දෙක ය.",
            "තුන නම් කිම? (සුඛ දූඃඛ උපෙක්ෂා යන) තුන් වෙදනාවෝ ය.",
            "සතර නම් කිම? (දූඃඛ සමුදය නිරොධ මාර්ග යන) සතර ආර්ය සත්‍යයෝ ය.",
            "පස නම් කිම? (රූප වෙදනා සංඥා සංස්කාර විඥාන යන) උපාදානස්කන්ධ පස ය.",
            "සය නම් කිම? (චක්ඛු සොත ඝාන ජිව්හා කාය මන යන) තමා කෙරෙහි වූ ආයතන සය ය.",
            "සත නම් කිම? (සති ධම්මවිචය පීති විරිය පස්සද්ධි සමාධි උපෙක්ඛා යන) බොධ්‍යඬ්ග සත ය.",
            "අට නම් කිම? (සම්මාදිට්ඨි සම්මාසඬ්කප්ප සම්මාවාචා සම්මාකම්මන්ත සම්මාආජීව සම්මාවායාම සම්මාසති සම්මාසාමාධි යන) ආර්ය අෂ්ටාඬ්ගික මාර්ගය ය.",
            "නවය නම් කිම? (නානත්තකාය නානත්තසඤ්ඤි ය, නානත්තකාය එකත්තසඤ්ඤි ය, එකත්තකාය නානත්තසඤ්ඤි ය, එකත්තකාය එකත්තසඤ්ඤි ය, අසඤ්ඤි ය, අකාසානඤ්චායතනූපග ය, විඤ්ඤාණඤ්චායතනූපග ය, ආකිඤ්චඤ්ඤායතනූපග ය, නෙවසඤ්ඤානාසඤ්ඤායතනූපග ය යන) සත්ත්වාවාස නවය ය.",
            "දශය නම් කිම? (අසෙඛ සම්මාදිට්ඨි ය, අසෙඛ සම්මාසඬ්කප්ප ය, අසෙඛ සම්මාවාචා, අසෙඛ සම්මාකම්මන්ත ය, අසෙඛ සම්මාආජීව ය, අසෙඛ සම්මාවායාම ය, අසෙඛ සම්මාසති ය, අසෙඛ සම්මාසාමාධි ය, අසෙඛ සම්මාඤාණ ය, අසෙඛ සම්මාවිමුත්තිය යන) අඬ්ග දශයෙන් යුත් වූයේ රහත් තෙමේ ය යි කියනු ලැබේ."
        ]
    },
    "05-dvattimsakaraya": {
        "labels": [
            [
                0.69428,
                13.759374
            ],
            [
                14.138072,
                24.646952
            ],
            [
                24.930976,
                35.313623
            ],
            [
                35.818554,
                44.591733
            ],
            [
                44.970431,
                55.289961
            ],
            [
                55.66866,
                67.692333
            ]
        ],
        "pali": [
            "අත්‍ථි ඉමස්‌මිං කායෙ කෙසා ලොමා නඛා දන්‌තා තචො",
            "මංසං නහාරූ අට්‌ඨි අට්‌ඨිමිඤ්‌ජං  වක්‌කං",
            "හදයං යකනං කිලොමකං පිහකං පප්‌ඵාසං",
            "අන්‌තං අන්‌තගුණං උදරියං කරීසං",
            "පිත්‌තං සෙම්‌හං පුබ්‌බො ලොහිතං සෙදො මෙදො",
            "අස්‌සු වසා ඛෙලො සිඞ්‌ඝානිකා ලසිකා මුත්‌තං {මත්‍ථකෙ මත්‍ථලුඞ්‌ග} න්‌ති."
        ],
        "trans": [
            "මේ සිරුරෙහි කෙස් ය, ලොම් ය, නිය ය, දත් ය, සම ය,",
            "මස් ය, නහර ය, ඇට ය, ඇටමිඳුලු ය, වකුගඬු ය,",
            "හදවත ය, අක්මාව ය, දලබුව ය, බඩදිව ය, පපුමස ය,",
            "අතුනුවැටිය ය, අතුනුබහන් ය, උදරිය (උදරයෙහි වූ නො පැසුණු අහර පැන් ආදිය) ය, වසුරු ය,",
            "පිත ය, සෙම ය, පූයා ය, ලේ ය, ඩහදිය ය, හැසුනු (මිදි ගිය) තෙල් ය,",
            "කඳුළු ය, වුරුණු (දිය ව ගිය) තෙල් ය, කෙල ය, මුකුණු (සොටු) ය, සඳමිඳුලු ය, මුත්‍ර ය, {හිස් කබල් තුළ පිහිටි මිඳුලු රැස ය} යන දෙතිස් කුණුප කොටස් කෙනෙක් ඇත්තාහ."
        ]
    },
    "07-dasadhamma": {
        "labels": [
            [
                0.921807,
                2.654805
            ],
            [
                2.654805,
                23.966991
            ],
            [
                24.280405,
                47.731184
            ],
            [
                48.081471,
                62.830388
            ],
            [
                63.346601,
                79.164815
            ],
            [
                79.533537,
                94.577433
            ],
            [
                94.983028,
                111.169965
            ],
            [
                111.538688,
                129.790474
            ],
            [
                130.232941,
                154.16306
            ],
            [
                154.458038,
                175.622735
            ],
            [
                176.286436,
                218.652701
            ],
            [
                219.021424,
                237.789422
            ],
            [
                238.231889,
                255.561867
            ],
            [
                255.967463,
                293.245352
            ],
            [
                294.277776,
                307.920524
            ],
            [
                308.215503,
                322.337591
            ]
        ],
        "pali": [
            "දසධර්‍ම සුත්ත",
            "එවං මෙ සුත: එකං සමයං භගවා සාවත්‍ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්‌ස ආරාමෙ.",
            "තත්‍ර ඛො භගවා භික්ඛූ ආමන්තෙසි - ‘‘භික්ඛවො’’ති. ‘‘භදන්තෙ’’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච -",
            "‘‘දසයිමෙ, භික්ඛවෙ, ධම්මා පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බා . කතමෙ දස?",
            "‘වෙවණ්ණියම්හි අජ්ඣුපගතො’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘පරපටිබද්ධා මෙ ජීවිකා’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘අඤ්ඤො මෙ ආකප්පො කරණීයො’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘කච්චි නු ඛො මෙ අත්තා සීලතො න උපවදතී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘කච්චි නු ඛො මං අනුවිච්ච විඤ්ඤූ සබ්‍රහ්මචාරී සීලතො න උපවදන්තී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘සබ්බෙහි මෙ පියෙහි මනාපෙහි නානාභාවො විනාභාවො’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘කම්මස්සකොම්හි කම්මදායාදො කම්මයොනි කම්මබන්ධු කම්මපටිසරණො, යං කම්මං කරිස්සාමි කල්‍යාණං වා පාපකං වා තස්ස දායාදො භවිස්සාමී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘කථංභූතස්ස මෙ රත්තින්දිවා වීතිවත්තන්තී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘කච්චි නු ඛො අහං සුඤ්ඤාගාරෙ අභිරමාමී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං;",
            "‘අත්ථි නු ඛො මෙ උත්තරි මනුස්සධම්මො අලමරියඤාණදස්සනවිසෙසො අධිගතො, සොහං (සපච්ඡිමෙ කාලෙ සබ්‍රහ්මචාරීහි පුට්ඨො න මඞ්කු භවිස්සාමී’ති පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බං.",
            "ඉමෙ ඛො, භික්ඛවෙ, දස ධම්මා පබ්බජිතෙන අභිණ්හං පච්චවෙක්ඛිතබ්බා’’ති.",
            "..."
        ],
        "trans": [
            "දසධර්‍ම සූත්‍රය",
            "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු මහ සිටුහුගේ අරම්හි වැඩ වසන සේක.",
            "එහිදී වනාහි භාග්‍යවතුන් වහන්සේ, ‘‘මහණෙනි,’’ යි කියා භික්‍ෂූන් ආමන්ත්‍රණය කළ සේක. ඒ භික්‍ෂූහු, ‘‘පින්වතුන් වහන්සැ’’ යි භාග්‍යවතුන් වහන්සේට උත්තර දුන්හ. භාග්‍යවතුන් වහන්සේ,",
            "‘‘මහණෙනි, මේ ධර්‍ම දසයක් පැවිද්දා විසින් නිතර නුවණින් සිහි කළ යුත්තාහ. කවර දසයක්ද යත්.",
            "‘වෙනස් වර්‍ණයකට පැමිණෙන ලද්දෙමි’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කටයුතුයි.",
            "‘මාගේ ජීවිකාව අනුන් පිළිබඳය’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘මා විසින් අන්‍ය (ගිහියන්ගෙන් වෙනස්වූ) හැසිරීමක් කටයුතුය’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘කිමෙක්ද, මාගේ සිත සීලයෙන් මට උපවාද නොකෙරේදැ’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘කිමෙක්ද, මා විචාරා ඤාණවන්ත සබ්‍රහ්මචාරීහු සීලයෙන් පරිභව නොකෙරෙත්දැ’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘මාගේ සියලු ප්‍රිය මනාප දෙයින් වෙනස්වීම, වෙන්වීම වේය’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘මම කර්‍මය ස්වකීය කොට ඇත්තේ වෙමි. කර්‍මය අයිති කොට ඇත්තේ වෙමි. කර්‍මය උත්පත්ති ස්ථානය කොට ඇත්තේ වෙමි. කර්‍මය නෑයන් කොට ඇත්තේ වෙමි. කර්‍මය පිළිසරණ කොට ඇත්තේ වෙමි. යහපත් හෝ, අයහපත් යම් කර්මයක් කරන්නෙම්ද, ඊට හිමි වන්නෙමි’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘කෙසේවූ මටරෑ දාවල් ඉක්මෙත්දැ’ යි පැවිද්දා විසින් නිතර නුවණින් සිහි කළයුතුයි.",
            "‘කිමෙක්ද මම ජනයාගෙන් හිස්වූ ප්‍රදේශයෙහි ඇලෙන්නෙම්දැ’ යි පැවිද්දා විසින් නිතර මෙනෙහි කළයුතුයි.",
            "‘මා කෙරෙහි මනුෂ්‍ය ධර්මයට මත්තෙහි ආර්‍ය්‍ය භාවය සිද්‍ධ කිරීමට සුදුසු ඤාණයක් ලබන ලද්දේද, ඒ මම පසු කාලයක සබ්‍රම්සරුන් විසින් විචාරණ ලද්දේ නිශ්ශබ්ද නොවන්නෙම්දැ’ යි පැවිද්දා විසින් නිතර ප්‍රත්‍යවෙක්‍ෂා කළයුතුයි.",
            "මහණෙනි, මේ දස ධර්‍මයෝ පැවිද්දා විසින් නිතර ප්‍රත්‍යවෙක්‍ෂා කට යුත්තාය’’ යි වදාළ සේක.",
            "..."
        ]
    },
    "08-mahamangala": {
        "labels": [
            [
                0,
                2,
                0
            ],
            [
                3.277322,
                11.346696,
                1
            ],
            [
                11.814885,
                23.712392,
                2
            ],
            [
                24.235662,
                34.315494,
                3
            ],
            [
                34.701061,
                46.598568,
                4
            ],
            [
                47.121838,
                52.712564,
                5
            ],
            [
                52.850267,
                67.474286,
                6
            ],
            [
                67.970015,
                81.795359,
                7
            ],
            [
                83.199925,
                93.555163,
                8
            ],
            [
                93.94073,
                104.709075,
                9
            ],
            [
                105.342507,
                115.532501,
                10
            ],
            [
                116.028231,
                126.796576,
                11
            ],
            [
                127.264765,
                137.922948,
                12
            ],
            [
                138.308515,
                148.746374,
                13
            ],
            [
                149.242104,
                159.266855,
                14
            ],
            [
                159.679963,
                170.255524,
                15
            ],
            [
                170.833875,
                181.409437,
                16
            ],
            [
                181.877626,
                191.984998,
                17
            ],
            [
                192.508268,
                202.973668,
                18
            ],
            [
                203.386776,
                213.301364,
                19
            ],
            [
                214.320364,
                224.124791,
                20
            ],
            [
                224.537899,
                235.141001,
                21
            ],
            [
                235.664271,
                245.936886,
                22
            ],
            [
                246.377535,
                256.237043,
                23
            ],
            [
                256.898015,
                266.59228,
                24
            ],
            [
                267.088009,
                277.856355,
                25
            ],
            [
                278.462246,
                288.349294,
                26
            ],
            [
                288.707321,
                299.393045,
                27
            ],
            [
                299.943855,
                309.748282,
                28
            ],
            [
                310.188931,
                320.434006,
                29
            ],
            [
                321.039897,
                331.229892,
                30
            ],
            [
                331.642999,
                344.889992,
                31
            ]
        ],
        "pali": [
            "මහා මඞ්ගල සුත්තං",
            "එවං මෙ සුත: එකං සමයං භගවා",
            "සාවත්‍ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්‌ස ආරාමෙ.",
            "අථ ඛො අඤ්‌ඤතරා දෙවතා අභික්‌කන්‌තාය රත්‌තියා",
            "අභික්‌කන්‌තවණ්‌ණා කෙවලකප්‌පං ජෙතවනං ඔභාසෙත්‍වා",
            "යෙන භගවා තෙනුපසඞ්‌කමි.",
            "උපසඞ්‌කමිත්‍වා භගවන්‌තං අභිවාදෙත්‍වා එකමන්‌තං අට්‌ඨාසි.",
            "එකමන්‌තං ඨිතා ඛො සා දෙවතා භගවන්‌තං ගාථාය අජ්‌ඣභාසි.",
            "බහූ දෙවා මනුස්‌සා ච මඞ්‌ගලානි අචින්‌තයුං,",
            "ආකඞ්‌ඛමානා සොත්‍ථානං බ්‍රූහි මඞ්‌ගලමුත්‌තමං.",
            "අසෙවනා ච බාලානං පණ්‌ඩිතානං ච සෙවනා,",
            "පූජා ච පූජනීයානං එතං මඞ්‌ගලමුත්‌තමං.",
            "පතිරූපදෙසවාසො ච පුබ්‌බෙ ච කතපුඤ්‌ඤතා",
            "අත්‌තසම්‌මාපණිධි ච එතං මඞ්‌ගලමුත්‌තමං.",
            "බාහුසච්‌චඤ්‌ච සිප්‌පඤ්‌ච විනයො ච සුසික්‌ඛිතො",
            "සුභාසිතා ච යා වාචා එතං මඞ්‌ගලමුත්‌තමං.",
            "මාතාපිතුඋපට්‌ඨානං පුත්‌තදාරස්‌ස සඞ්‌ගහො",
            "අනාකුලා ච කම්‌මන්‌තා එතං මඞ්‌ගලමුත්‌තමං.",
            "දානං ච ධම්‌මචරියා ච ඤාතකානඤ්‌ච සඞ්‌ගහො",
            "අනවජ්‌ජානි කම්‌මානි එතං මඞ්‌ගලමුත්‌තමං.",
            "ආරති විරති පාපා මජ්‌ජපානා ච සඤ්ඤමො",
            "අප්‌පමාදො ච ධම්‌මෙසු එතං මඞ්‌ගලමුත්‌තමං.",
            "ගාරවො ච නිවාතො ච සන්‌තුට්‌ඨි ච කතඤ්‌ඤුතා",
            "කාලෙන ධම්‌ම‌සවණං එතං මඞ්‌ගලමුත්‌තමං.",
            "ඛන්‌තී ච සොවචස්‌සතා සමණානඤ්‌ච දස්‌සනං",
            "කාලෙන ධම්‌මසාකච්‌ඡා එතං මඞ්‌ගලමුත්‌තමං.",
            "තපො ච බ්‍රහ්‌මචරියඤ්‌ච අරියසච්‌චානදස්‌සනං",
            "නිබ්‌බානසච්‌ඡිකිරියා ච එතං මඞ්‌ගලමුත්‌තමං.",
            "පුට්‌ඨස්‌ස ලොකධම්‌මෙහි චිත්‌තං යස්‌ස න කම්‌පති",
            "අසොකං විරජං ඛෙමං එතං මඞ්‌ගලමුත්‌තමං.",
            "එතාදිසානි කත්‍වාන සබ්‌බත්‍ථ මපරාජිතා",
            "සබ්‌බත්‍ථ සොත්‍ථිං ගච්‌ඡන්‌ති තං තෙසං මඞ්‌ගලමුත්‌තමන්‌ති."
        ],
        "trans": [
            "මහා මඞ්ගල සූත්‍රය",
            "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක භාග්‍යවතුන් වහන්සේ",
            "සැවැත්නුවර නිසා ජේතවන නම් වූ අනේපිඬු මහ සිටුහුගේ අරම්හි වැඩ වසන සේක.",
            "එකල්හි එක්තරා දෙවියෙක් රෑ (පෙර යම්) ඉක්ම ගිය කල්හි",
            "විශිෂ්ට ශරීරශොභා ඇත්තේ සියලු ජෙතවනය (ස්වකීය) ශරීරශොභායෙන් බබුලුවා",
            "භාග්‍යවතුන් වහන්සේ යම් තැනෙක ද එ තැනට එළැඹියේ ය.",
            "එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත් පසෙක සිටියේ ය.",
            "එකත්පසෙක සිටි ඒ දෙවි තෙම භාග්‍යවතුන්වහන්සේට ගාථායෙන් (මෙසේ) කීයේ ය:",
            "ස්වස්ථභාවය කැමැති බොහෝ දෙවියෝ ද මිනිස්සු ද (දෙලෝ වැඩ සලසන) මඬ්ගල කාරණයන් සිතූහ.",
            "වැඩ සලසන උතුම් මඟුල් (මඬ්ගල කාරණ) වදාළ මැනැවි.",
            "බාලයන් ඇසුරු නොකිරීම ද මඟුලෙකි. පණ්ඩිතයන් ඇසුරු කිරීම ද මඟුලෙකි.",
            "පිදිය යුත්තන් පිදීම ද මඟුලෙකි. මේ (එක එකෙක්) උතුම් මඟුල් ය (මඬ්ගල කාරණය).",
            "සුදුසු පෙදෙසෙහි විසීම ද, පෙරකළ පින් ඇති බව ද,",
            "සිය අත්බව (ශීලාදි) මනා දහම්හි පිහිටුවීම ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "බොහෝ ඇසූ පිරූ තැන් ඇති බව ද, (ගිහි පැවිදි) සිප්හි අත් හුරු බව ද, මොනොවට හික්මුනු කා විසි මුනි තුන් දොර ඇති බව ද,",
            "මොනොවට කියන ලද වචනය ද (මුසාවා ආදියෙන් වැළකි වචනය ද) යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "මවුට උවටන ද, පියාට උවටන ද, අඹුදරුවනට සඬ්ග්‍රහ ද,",
            "(ගොවිතැන් ආදි) නිරවුල් කර්මාන්තය ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "දානය ද, දස කුසල්දහම්හි හැසිරීම ද, නෑයන්ට සංග්‍රහ ද,",
            "පෙහෙවස් විසීම් ආදි නිවැරැදි කර්ම ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "මානසික අකුශලයෙන් වැළැක්ම ද, කායික වාචසික අකුශලයෙන් වැළැක්ම ද, මත්පැනෙන් වැළැක්ම ද,",
            "කුසලදහම් වැඩීමෙහි නොපමා බව ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "ගරු කටයුත්තනට ගරු කිරීම ද, මන් නැති බව ද (නිහතමාන බව) ද, ලද දැයින් සතුටු වන බව ද, කෙළෙහි ගුණ දන්නා බව ද,",
            "සුදුසු කල්හි බණ ඇසීම ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "ඉවැසීම ද, සුවච බව ද, ශ්‍රමණයන් දැක්ම ද,",
            "සුදුසු කල්හි ධර්ම සාකච්ඡාව ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "තපස ද (ඉන්ද්‍රියසංවර හා වීර්යය ද,) බඹසර ද (මෙවුන්දමින් වැළැක්ම, මහණදම, සසුන් බඹසර යන තුන් බඹසර ද), චතුරාර්‍යසත්‍යයන් දැකීමද (මාර්ගදර්ශනය ද),",
            "නිවන්පසක් කිරීම ද යන මේ (එක එකෙක්) උතුම් මඟුල් ය.",
            "අට ලෝදහමින් පහස්නා ලද (ස්පර්ශකරන ලද, මඬනා ලද) යමක්හුගේ සිත නො සැලේ ද,",
            "ශෝක රහිත ද, රාගාදි රජස් රහිත ද, කාමයෝගාදීන්ගෙන් නිරුපද්‍රත ද, එ බඳු වූ රහත්හුගේ සිතෙහි වූ ඒ නොසැලෙන බව ආදි එක එකෙක් උතුම් මඟුල් ය.",
            "යම් කෙනෙක් මෙබඳු වූ බාලයන් ඇසුරු නොකිරීම් ආදි මඬ්ගල කාරණයන් කිරීමෙන් හැම තන්හි (දෙලෙව්හි ම) නොපැරැදුනෝ ව",
            "සියලු ඉරියව්වෙහි ස්වස්ථ ව වෙසෙත් ද, එය (ඒ බාලයන් ඇසුරු නොකිරීම් ආදිය) ඔවුන්ට උතුම් මඟුල් ය."
        ]
    },
    "09-rathana": {
        "labels": [
            [
                0.233795,
                1.870362
            ],
            [
                3.390031,
                16.950157
            ],
            [
                17.339815,
                30.783043
            ],
            [
                31.211668,
                45.08352
            ],
            [
                45.590076,
                58.604679
            ],
            [
                59.111236,
                72.3986
            ],
            [
                72.86619,
                85.452169
            ],
            [
                85.919759,
                93.128447
            ],
            [
                93.557071,
                106.961333
            ],
            [
                107.428924,
                120.365595
            ],
            [
                120.755254,
                127.963941
            ],
            [
                128.743258,
                141.952691
            ],
            [
                142.264418,
                155.123157
            ],
            [
                155.512816,
                162.682537
            ],
            [
                163.03323,
                176.281629
            ],
            [
                176.710253,
                190.426242
            ],
            [
                190.971764,
                204.298094
            ],
            [
                204.921548,
                218.715469
            ],
            [
                219.144094,
                232.743185
            ],
            [
                233.210775,
                246.615037
            ],
            [
                247.472286,
                261.42207
            ],
            [
                261.811729,
                275.371854
            ],
            [
                275.761513,
                289.165775
            ],
            [
                289.789229,
                302.92073
            ],
            [
                303.349354,
                316.363957
            ],
            [
                316.792582,
                329.885117
            ],
            [
                330.547536,
                343.055583
            ],
            [
                343.484208,
                355.953288
            ],
            [
                356.381913,
                369.396516
            ],
            [
                369.786175,
                382.87871
            ],
            [
                383.813891,
                397.958504
            ],
            [
                398.192299,
                411.090005
            ],
            [
                411.557595,
                424.611164
            ],
            [
                425.273584,
                438.677846
            ],
            [
                439.028539,
                451.731415
            ],
            [
                452.237971,
                465.447403
            ],
            [
                465.95396,
                478.890631
            ],
            [
                479.397187,
                492.60662
            ],
            [
                493.152142,
                507.296756
            ],
            [
                507.72538,
                521.519301
            ],
            [
                522.025857,
                535.118392
            ],
            [
                536.248402,
                549.574732
            ],
            [
                550.003357,
                563.602448
            ],
            [
                564.186936,
                577.513266
            ],
            [
                577.941891,
                591.190289
            ],
            [
                591.813743,
                604.98421
            ],
            [
                605.490766,
                619.089857
            ]
        ],
        "pali": [
            "රතන සුත්‌තං",
            "යානීධ භූතානි සමාගතානි භුම්‌මානි වා යානි ව අන්‌තළික්‌ඛෙ",
            "සබ්‌බෙව භූතා සුමනා භවන්‌තු අථො‘පි සක්‌කච්‌ච සුණන්‌තු භාසිතං.",
            "තස්‌මා හි භූතා නිසාමෙථ සබ්‌බෙ, මෙත්‌තං කරොථ මානුසියා පජාය.",
            "දිවා ච රත්‌තො ච හරන්‌ති යෙ බලිං තස්‌මා හි නෙ රක්‌ඛථ අප්‌පමත්‌තා.",
            "යං කිඤ්‌චි විත්‌තං ඉධ වා හුරං වා - සග්‌ගෙසු වා යං රතනං පණීතං",
            "න නො සමං අත්‍ථි තථාගතෙන - ඉදම්‌පි බුද්‌ධෙ රතනං පණීතං",
            "එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "ඛයං විරාගං අමතං පණීතං - යදජ්‌ඣගා සක්‍යමුනී සමාහිතො",
            "න තෙන ධම්‌මෙන සමත්‍ථි කිඤ්‌චි - ඉදම්‌පි ධම්‌මෙ රතනං පණීතං",
            "එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "යම්බුද්‌ධසෙට්‌ඨො පරිවණ්‌ණයී සුචිං - සමාධිමානන්‌තරිකඤ්‌ඤමාහු",
            "සමාධිනා තෙන සමො න විජ්‌ජති - ඉදම්‌පි ධම්‌මෙ රතනං පණීතං",
            "එතෙන සච්‌චෙන සුවත්‍ථි හොතු",
            "යෙ පුග්‌ගලා අට්‌ඨසතම්පසත්‍ථා - චත්‌තාරි එතානි යුගානි හොන්‌ති",
            "තෙ දක්‌ඛිණෙය්‍යා සුගතස්‌ස සාවකා - එතෙසු දින්‌නානි මහප්‌ඵලානි",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "යෙ සුප්‌පයුත්‌තා මනසා දළ්‌හෙන - නික්‌කාමිනො ගොතමසාසනම්‌හි",
            "තෙ පත්‌තිපත්‌තා අමතං විගය්‌හ - ලද්‌ධා මුධා නිබ්‌බුතිං භුඤ්‌ජමානා.",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "යථින්‍දඛීලො පඨවිං‌සිතො සියා - චතුබ්‌භි වාතෙභි අසම්‌පකම්‌පියො",
            "තථූපමං සප්‌පුරිසං වදාමි - යො අරියසච්‌චානි අවෙච්‌ච පස්‌සති.",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "යෙ අරියසච්‌චානි විභාවයන්‌ති - ගම්‌භීරපඤ්‌ඤෙන සුදෙසිතානි",
            "කිඤ්‌චාපි තෙ හොන්‌ති භූසප්පමත්‌තා - න තෙ භවං අට්‌ඨමං ආදියන්‌ති",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "සහාවස්‌ස දස්‌සනසම්‌පදාය - තයස්‌සු ධම්‌මා ජහිතා භවන්‌ති",
            "සක්‌කායදිට්‌ඨී විචිකිච්‌ඡිතඤ්‌ච - සීලබ්‌බතං වාපි යදත්‍ථි කිඤ්‌චී",
            "චතූහපායෙහි ච විප්‌පමුත්‌තො - ඡ චාභිඨානානි අභබ්‌බො කාතුං",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "කිඤ්‌චාපි සො කම්‌මං කරොති පාපකං - කායෙන වාචා උද චෙතසා වා",
            "අභබ්‌බො සො තස්‌ස පටිච්ඡාදාය - අභබ්‌බතා දිට්‌ඨපදස්‌ස වුත්‌තා.",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "වනප්‌පගුම්‌බෙ යථා ඵුස්‌සිතග්‌ගෙ - ගිම්‌හාණමාසෙ පඨමස්‌මිං ගිම්‌හෙ",
            "තථූපමං ධම්‌මවරං අදෙසයී - නිබ්‌බාණගාමිං පරමං හිතාය.",
            "ඉදම්‌පි බුද්‌ධෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "වරො වරඤ්‌ඤූ වරදො වරාහරො - අනුත්‌තරො ධම්‌මවරං අදෙසයී.",
            "ඉදම්‌පි බුද්‌ධෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "ඛීණං පුරාණං නවං නත්‍ථි සම්‌භවං - විරත්‌තචිත්‌තා ආයතිකෙ භවස්‌මිං.",
            "තෙ ඛීණබීජා අවිරූළ්‌හිච්ඡන්‍දා - නිබ්‌බන්‌ති ධීරා යථායම්පදීපො.",
            "ඉදම්‌පි සඞ්‌ඝෙ රතනං පණීතං - එතෙන සච්‌චෙන සුවත්‍ථි හොතු.",
            "යානීධ භූතානි සමාගතානි - භුම්‌මානි වා යානි ව අන්‌තළික්‌ඛෙ",
            "තථාගතං දෙවමනුස්‌සපූජිතං - බුද්‌ධං නමස්‌සාම සුවත්‍ථි හොතු.",
            "යානීධ භූතානි සමාගතානි - භුම්‌මානි වා යානි ව අන්‌තළික්‌ඛෙ.",
            "තථාගතං දෙවමනුස්‌සපූජිතං - ධම්‌මං නමස්‌සාම සුවත්‍ථි හොතු.",
            "යානීධ භූතානි සමාගතානි - භුම්‌මානි වා යානි ව අන්‌තළික්‌ඛෙ",
            "තථාගතං දෙවමනුස්‌සපූජිතං - සඞ්‌ඝං නමස්‌සාම සුවත්‍ථි හොතු."
        ],
        "trans": [
            "රතන සූත්‍රය",
            "1. පොළොවෙහි වූ හෝ අහසෙහි වූ හෝ යම් අමනුෂ්‍ය කෙනෙක් මෙහි රැස් වූහු ද,",
            "ඒ සියලු අමනුෂ්‍යයෝ ම සතුටු සිතැත්තෝ වෙත්වා. තව ද මගේ වචනය සකසා අසත්වා.",
            "2. භූතයෙනි, ඒ බැවින් සියලු තෙපි (මගේ වචනය) අසවු. මනුෂ්‍ය ප්‍රජාවට මෛත්‍රිය කරවු.",
            "යම් කෙනෙක් දහවල් ද රෑ ද පුද පඬුරු එළවත් ද, එහෙයින් නො පමා ව ම ඔවුන් රකිවු.",
            "3. මේ මිනිස්ලොව හෝ නාලෝ ආදි අන් ලොවෙක හෝ යම් ධනයෙක් වේ ද දෙව්ලෝහි හෝ මහඟු රුවනෙක් වේ ද",
            "(ඔවුන් අතුරෙහි) තථාගතයන් හා සදෘශයෙක් නැත් ම ය. මෙ කරුණින් ද බුදුරජුහු උතුම් රුවනෙකි (නොහොත් මෙය බුදුරජුන් ගේ රත්නභාවය යි.)",
            "මේ සත්‍ය බලයෙන් සෙත් වේවා.",
            "4. ශාක්‍යමුනි තෙම (ආර්යමාර්ග සමාධියෙන්) එකඟ වූ සිත් ඇත්තේ, කෙලෙස් නැසීමට නිමිති වූ, රාගයෙන් වෙන් වීමට නිමිති වූ, මරණයක් නැති, උතුම් වූ (මහත් වූ) යම් නිවනක් පසක් කළේ ද,",
            "ඒ දහම හා සම වූ කිසිවෙක් නැත්තේ ය. මෙ කරුණින් ද නිවන්දහම උතුම් රුවනෙකි.",
            "මේ සත්‍යවචනානුභාවයෙන් සෙත් වේවා.",
            "5. බුද්ධශ්‍රේෂ්ඨ තෙම අත්‍යන්තපරිශුද්ධ වූ යම් මාර්ගසමාධියක් වර්ණනා කළේ ද, බුද්ධාදීහු ආනන්තරික (අනතුරුව ම පල දෙන) සමාධිය යැ යී යමකට කියත් ද,",
            "ඒ සමාධිය හා සදෘශ (අන් සමාධි) යෙක් නැත. මේ කරුණින් ද ආර්යමාර්ගධර්මය උතුම් රුවනෙකි.",
            "මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "6. සත්පුරුෂයන් විසින් පසස්නා ලද යම් ආර්ය පුද්ගලයෝ අට දෙනෙක් වෙත් ද නොහොත් ප්‍රශස්ත වූ යම් අටෝරාසියක් අරී පුගුලෝ වෙත් ද, මොහු හැම දෙන සතර යුග කෙනෙක් වෙති.",
            "සුගත බුදුරජුන්ගේ සවු වූ ඔහු තුමූ දක්ෂිණාවට (කර්මය ද කර්මවිපාකය ද අදහා දෙන දානය පිළිගැන්මට) සුදුස්සෝ වෙති. මේ බුදුසව්වන් කෙරෙහි දෙන ලද දානයෝ මහත් පල ඇත්තෝ වෙත්.",
            "මේ කරුණින් ද බුද්ධශ්‍රාවක සඞ්ඝ තෙමේ උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.",
            "7. ගොයුම්බුදුරජුන් ගේ සස්නෙහි වූ, සුවිශුද්ධ කායවාක්කර්ම සංඛාත ශීලස්කන්ධයෙන් යුක්ත වූ, ස්ථිර සිතින් (හෙවත් සමාධිගත සිතින්) යුක්ත වූ, ප්‍රඥාව කරණ කොට ගෙණ සියලු කෙලෙසුන්ගෙන් නික්මුනා වූ යම් පුද්ගල කෙනෙක් වෙත ද,",
            "ඔහු තුමූ (අරමුණු කිරීම් වශයෙන්) නිවනට බැස ගෙණ නො මිලේ ම රහත්පල සමවත ලැබ ගෙණ එය විඳින්නාහු වෙති.",
            "මේ කරුණින් ද ආර්යසඞ්ඝයා උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.",
            "8. යම්සේ පොළොව තුළ වැද ගෙණ සිටි ඉන්ද්‍රියකීලය තෙමෙ සිවු දිගින් හමන සුළඟින් සෙලවිය හැකි නො වේ ද,",
            "ආර්යසත්‍යයන් ප්‍රඥායෙන් බැස ගෙණ දක්නා සත්පුරුෂයා (හෙවත් සෝවාන් පුඟුලා) එබන්දකු කොට කියමි.",
            "මේ කරුණින් ද ආර්යසඞ්ඝයා උතුම් රුවනෙකි. මේ සත්‍ය බලයෙන් සෙත් වේවා.",
            "9. යම් සෝවාන් පුඟුල් කෙනෙක් ගැඹුරු නුවණැති බුදුරජුන් දෙසූ ආර්යසත්‍යයයන් තමනට ප්‍රකට කෙරෙත් ද,",
            "ඔහු (දෙව්ස්‍රව සක්විති රජස්‍රව ආදි පමාවට කරුණු වන තැනකට පැමිණ) බෙහෙවින් පමා වූවාහු නමුදු අටවන භවයක් නො ගණිති.",
            "මෙ කරුණින් ද ආර්යසංඝ තෙමේ උතුම් රුවනෙකි. මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "10. මේ සෝවාන්හුගේ දර්ශනසම්පත්තිය (පළමු වන නිවන් දැක්ම) හෙවත් සෝවාන් මඟ නුවණ පහළ වීම සමග ම මේ තුන් සංයෝජනයෝ දුරු කරණ ලද්දෝ වෙත්.",
            "එනම් සත්කායදෘෂ්ටිය ද, (බුද්ධාදි අට තන්හි) සැකය ද, යම් මිථ්‍යාශීලව්‍රත කෙනෙක් වූහූ නම් ඒ සියල්ල ද යන මේවායි.",
            "හෙතෙම සතර අපායයන් කෙරෙන් මිදුනේ ද වේ. (ආනන්තර්ය කර්ම පසත් මිථ්‍යාදෘෂ්ටියත් යන බැරෑරුම් වූ පව් සය කරන්නට ද හේ අභව්‍ය ය (ඔහු විසින් ඒ පව් සය නො කට හැක්ක).",
            "මෙ කරුණින් ද ආර්යසංඝ තෙමේ උතුම් රුවනෙකි. මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "11. ඒ (සෝවාන්) පුද්ගල තෙම (ප්‍රමාදයෙකින්) කයින් හෝ වචනයෙන් හෝ නැත හොත් සිතින් හෝ ප්‍රඥප්තිවද්‍යමාත්‍ර වූ කිසි වරදක් කරන්නේ නුමුදු,",
            "හේ එය සඟොවන්නට නො හැක්කේ ය. දක්නා ලද නිර්වාණපදය ඇති සෝවාන්හුගේ (වරද සැඟෙවීමෙහි) අභව්‍ය බව (හෙවත් වරද සැඟෙවිය නො හැකි බව) (බුදු රජුන් විසින්) වදාරන ලද්දේ ය.",
            "මේ කරුණින් ද ආර්යසඞ්ඝ තෙමේ උතුම් රුවනෙකි. මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "12. වන ලැහැබ තෙමේ ග්‍රීෂ්මර්තුව සම්බන්ධී වූ ප්‍රථම ග්‍රීෂ්ම මාසයෙහි (හෙවත් බක් මස) සුපිපි අක් ඇත්තේ යම්සේ ද,",
            "එසේ වූ නිවන්පුර පමුණුවන පර්යාප්තිධර්මරත්නය පරමහිතාඛ්‍ය වූ නිවන් පිණිස (ඒ බුදුරජ තෙම) දෙසී ය.",
            "මේ කරුණින් ද බුදුරජ තෙමේ උතුම් රුවනෙකි. මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "13. උතුම් වූ නිවන් දන්නා වූ, උතුම් නිවන දෙන්නා වූ, උතුම් නිවන් මඟ ගෙන හැර පාන්නා වූ, නිරුත්තර වූ බුදුරජ තෙම උතුම් දහමක් දෙසී ය.",
            "මේ කරුණින් ද බුදුරජ තෙමේ උතුම් රුවනෙකි. මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "14. යම් කෙනෙකුන්ගේ පුරාතන කර්ම (මෙයින් මත්තෙහි ප්‍රතිසන්ධියක් දිය නො හැක්කේ) රහත්මඟින් ක්ෂීණ වූයේ ද, (කර්මක්ෂය කළ බැවින් මත්තෙහි විපාක දිය හැකි) අළුත් කර්මයන්ගේ පහළ වීමෙකුත් නැද්ද, මතු භවයක් කෙරෙහි නො ඇලුණු සිතැති,",
            "ක්ෂීණ වූ ප්‍රතිසන්ධිවිඥාන සඞ්ඛාත වීජ ඇති, පුනර්භව සඞ්ඛාත සංස්කාර වෘද්ධිය කෙරෙහි කැමැත්තක් නැති, ධෛර්යසම්පන්න වූ ඒ රහත්හු මේ පහන මෙන් අවසන් සිත නිරුද්ධ වීමෙන් පිරිනිවෙත්.",
            "මේ කරුණින් ද සඞ්ඝයා උතුම් රුවනි නොහොත් මේ ද සඞ්ඝයා ගේ උතුම් රුවන් බවෙකි). මේ සත්‍යබලයෙන් සෙත් වේවා.",
            "15. පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස් වූහු ද,",
            "ඔහු ද, මම් ද (අපි) දෙව් මිනිසුන් විසින් පුදන ලද තථාගත බුදුරජාණන් වහන්සේ නමදිමු. (සත්ත්වප්‍රජාවට) සෙත් වේවා.",
            "16. පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස් වූහු ද,",
            "ඔහු ද, මම් ද දෙව්මිනිසුන් විසින් පුදන ලද, (බුද්ධාදීන්) විසින් අවබෝධ කරන ලද බැවින් තථාගත වු ධර්මය නමදිමු. (සත් වගට) සෙත් වේවා.",
            "17. පොළොවෙහි හෝ අහසෙහි වූ යම් අමනුෂ්‍ය කෙනෙක් මෙ තන්හි රැස් වූහු ද,",
            "ඔහු ද, මම් ද දෙව්මිනිසුන් විසින් පුදන ලද (ආත්මහිතයෙහි පිළිපන්නවුන් විසින් යෑ යුතු මඟෙහි යෑම් ආදී අරුතින්) තථාගත වූ සඞ්ඝයා නමදිමු සෙත් වේවා."
        ]
    },
    "10-karaniya": {
        "labels": [
            [
                0,
                2.5,
                0
            ],
            [
                3.113279,
                7.514149,
                1
            ],
            [
                7.533367,
                13.740708,
                2
            ],
            [
                14.221152,
                19.486822,
                3
            ],
            [
                19.50604,
                25.040758,
                4
            ],
            [
                25.694163,
                29.499282,
                5
            ],
            [
                29.499282,
                36.340809,
                6
            ],
            [
                36.93656,
                41.452737,
                7
            ],
            [
                41.529608,
                48.255828,
                8
            ],
            [
                48.890015,
                53.252449,
                9
            ],
            [
                53.252449,
                60.074759,
                10
            ],
            [
                60.612857,
                66.262882,
                11
            ],
            [
                66.262882,
                72.508658,
                12
            ],
            [
                73.162063,
                78.504603,
                13
            ],
            [
                78.504603,
                85.326913,
                14
            ],
            [
                85.865011,
                91.361294,
                15
            ],
            [
                91.361294,
                96.953666,
                16
            ],
            [
                97.510981,
                103.180224,
                17
            ],
            [
                103.180224,
                108.868685,
                18
            ],
            [
                109.406783,
                115.172115,
                19
            ],
            [
                115.172115,
                121.398673,
                20
            ],
            [
                121.955989,
                127.087134,
                21
            ],
            [
                127.087134,
                133.313693,
                22
            ],
            [
                133.736484,
                139.251985,
                23
            ],
            [
                139.251985,
                145.190276,
                24
            ],
            [
                145.786027,
                151.128568,
                25
            ],
            [
                151.128568,
                157.182167,
                26
            ],
            [
                157.681829,
                163.082023,
                27
            ],
            [
                163.082023,
                168.80892,
                28
            ],
            [
                169.270146,
                174.420509,
                29
            ],
            [
                174.420509,
                180.070535,
                30
            ],
            [
                180.570197,
                186.06648,
                31
            ],
            [
                186.06648,
                191.697288,
                32
            ],
            [
                192.754265,
                197.904628,
                33
            ],
            [
                197.904628,
                204.861462,
                34
            ],
            [
                205.39956,
                210.626794,
                35
            ],
            [
                210.626794,
                216.565086,
                36
            ],
            [
                217.122401,
                222.945387,
                37
            ],
            [
                222.945387,
                226.981119,
                38
            ],
            [
                227.519217,
                232.611927,
                39
            ],
            [
                232.611927,
                240.625738,
                40
            ]
        ],
        "pali": [
            "කරණීය මෙත්ත සුත්තං",
            "කරණීයමත්‍ථකුසලෙන",
            "යන්‌තං  සන්‌තං පදං අභිසමෙච්‌ච",
            "සක්‌කො උජූ ච සූජූ ච",
            "සුවචො චස්‌ස මුදු අනතිමානී.",
            "සන්‌තුස්‌සකො ච සුභරො ච",
            "අප්‌පකිච්‌චො ච සල්‌ලහුකවුත්‌ති,",
            "සන්‌තින්‍ද්‍රියො ච නිපකො ච",
            "අප්‌පගබ්‌භො කුලෙසු අනනුගිද්‌ධො.",
            "න ච ඛුද්‌දං සමාචරෙ",
            "කිඤ්‌චි යෙන විඤ්‌ඤූ පරෙ උපවදෙය්‍යුං",
            "සුඛිනො වා ඛෙමිනො හොන්‌තු",
            "සබ්‌බෙ සත්‌තා භවන්‌තු සුඛිතත්‌තා.",
            "යෙ කෙචි පාණභූතත්‍ථි",
            "තසා වා ථාවරා වා අනවසෙසා,",
            "දීඝා වා යෙ මහන්‌තා වා",
            "මජ්‌ඣිමා රස්‌සකා’ණුකථූලා.",
            "දිට්‌ඨා වා යෙව අද්දිට්‌ඨා",
            "යෙ ච දූරෙ වසන්‌ති අවිදූරෙ",
            "භූතා වා සම්‌භවෙසී වා",
            "සබ්‌බෙ සත්‌තා භවන්‌තු සුඛිතත්‌තා.",
            "න පරො පරං නිකුබ්‌බෙථ",
            "නාතිමඤ්‌ඤෙථ කත්‍ථචි නං කඤ්‌චි",
            "බ්‍යාරොසනා පටිඝසඤ්‌ඤා",
            "නාඤ්‌ඤමඤ්‌ඤස්‌ස දුක්‌ඛමිච්‌ඡෙය්‍ය",
            "මාතා යථා නියං පුත්‌තං",
            "ආයුසා එකපුත්‌තමනුරක්‌ඛෙ",
            "එවම්‌පි සබ්‌බභූතෙසු",
            "මානසං භාවයෙ අපරිමාණං.",
            "මෙත්‌තඤ්‌ච සබ්‌බලොකස්‌මිං",
            "මානසං භාවයෙ අපරිමාණං",
            "උද්‌ධං අධො ච තිරියං ච",
            "අසම්‌බාධං අවෙරං අසපත්‌තං",
            "තිට්‌ඨං චරං නිසින්‌නො වා",
            "සයානො වා යාවතස්‌ස විගතමිද්‌ධො",
            "එතං සතිං අධිට්‌ඨෙය්‍ය",
            "බ්‍රහ්‌මමෙතං විහාරං ඉධමාහු",
            "දිට්‌ඨිං ච අනුප‌ගම්‌ම සීලවා",
            "දස්‌සනෙන සම්‌පන්‌නො,",
            "කාමෙසු විනෙය්‍ය ගෙධං",
            "න හි ජාතු ගබ්‌භසෙය්‍යං පුනරෙතීති."
        ],
        "trans": [
            "කරණීය මෙත්ත සූත්‍රය",
            "යම් ඒ ශාන්තිපද සඞ්ඛ්‍යාත නිර්‍වාණයෙක් වේ ද, එයට පැමිණ නොහොත් එය අවබොධ කොට වසනු කැමති අභිවෘද්ධිය සලසා ගැණීමෙහි දක්‍ෂයා විසින් එයට සුදුසු දෙය කළ යුතු ය. නිවණට පැමිණ වසනු කැමැත්තේ සත්‍යප්‍රතිවෙධය පිණිස පිළිපදින්නට නොහොත් කිසුණු පිරියම් කිරීම් වත් සමාදන් වීම් ආදී සියලු කාර්‍ය්‍යයන් කරන්නට දක්‍ෂයෙක් වන්නේ ය. (දක්‍ෂයකු විය යුතු ය.)",
            null,
            "ඍජු වන්නේ ය. එක් වරක් ඍජු වීමෙන් නො නැවතී දිවි ඇති තාක් මනා කොට ඍජු වන්නේ ය. අන්‍යයන් ගේ අවවාද මනාකොට පිළිගැණීම් වශයෙන් සුවච වන්නේ ය. මෘදු වන්නේ ය. අතිමාන ඇත්තේ නො වන්නේ ය.",
            null,
            "ලද දෙයින් සතුටු වන්නෙක් ද පහසුවෙන් පෝෂණය කළ හැක්කෙක් ද, (ස්වකීය ශ්‍රමණධර්‍මය කිරීමට පමණක් සිමා වූ ) ස්වල්ප කටයුතු ඇත්තෙක් ද, සැහැල්ලු පැවතුම් ඇත්තෙක් ද,",
            null,
            "සන්හුන් ඉඳුරන් ඇත්තෙක් ද ප්‍රඥා ඇත්තෙක් ද, හැඩි දැඩි අසංවර ගති නැත්තෙක් ද, කුලයන් කෙරෙහි (සිවු පසයෙහි ඇලීම් ආදී වශයෙන්) නො ඇලුනෙක් ද වන්නේ ය.",
            null,
            "නුවණැති අන්‍යයන් නින්‍දා කරණ සුළු වරදක් වත් නො කරන්නේ ය.",
            null,
            "“සියලු සත්ත්‍වයෝ සැප ඇත්තෝ වෙත්වා, භය නැත්තෝ වෙත් වා, සුඛිත සිත් ඇත්තෝ වෙත් වා”යි ද,",
            null,
            "තෘෂ්ණාභය සහිත හෙයින් තැති ගන්නා සුලු වූ ද තෘෂ්ණා භය ප්‍රහීණ කළ හෙයින් ස්ථාවර වූ ද යම් කිසි සත්ත්‍වයෝ ඇත්තාහු නම්, ඒ සියලුදෙනා ද,",
            null,
            "(නාගාදි) දික් ශරීර ඇත්තෝ ද, (මත්ස්‍ය හස්ති අසුරා දී) මහත් ශරීර ඇත්තෝ ද, (අශ්වගවමහිෂාදී) මධ්‍යම ප්‍රමාණ ශරීර ඇත්තෝ ද, (වාමනාදී) මිටි සිරුරු ඇත්තෝ ද, (පියෙවි ඇසට නොපෙණෙන) ඉතා සියුම් ශරීර ඇත්තෝ ද, (මස් කැසුබු ආදී) ස්ථුල ශරීර ඇත්තෝ ද,",
            null,
            "ඇස් හමුවට පැමිණීම් වශයෙන් දුටු සත්තු ද, ඈත සිටි හෙයින් නුදුටු සත්තු ද, යම් සත්ත්‍ව කෙනෙක් දුරත් ලඟත් වසත් නම් ඔහු ද,",
            null,
            "ඉපදීම අවසන් කළ සත්ත්‍වයෝ ද (ක්‍ෂිණාශ්‍රවයෝ ද), මතු ඉපදීම සොයන (ශෛක්‍ෂ පෘථග්ජන) සත්ත්‍වයෝ ද යන මේ සියලු සත්ත්‍වයෝ සුඛිත සිත් ඇත්තෝ වෙත්’වා යි ද මෙත් වඩන්නේ ය.",
            null,
            "එකෙක් අනෙකකු නො රවටන්නේ ය. (නො රවටාවා) අනෙකකුට අවමන් නො කරන්නේ ය. (නො කෙරේ වා)",
            null,
            "බ්‍යාරොසනා නම් වූ කය හා වචනය පිළිබඳ විකෘතියෙන් ද ප්‍රතිඝසංඥා සඞ්ඛ්‍යාත මනෝවිකාරයෙන් ද එකෙක් අනෙකකුට දුකක් නො කැමති වන්නේ ය. (නො කැමති වේවා).",
            null,
            "මව යම්සේ තමා ගෙන් ඇති වූ එක ම ඖරස පුත්‍රයා ජීවිතපරිත්‍යාගයෙන් වූවත් රක්නේ ද,",
            null,
            "එ පරිද්දෙන් ම සියලු සත්ත්‍වයන් කෙරෙහි අප්‍රමාණ වූ මෛත්‍රීසහගත සිත වඩන්නේ ය.",
            null,
            "සියලු ලෝකසත්ත්‍වයා කෙරෙහි අප්‍රමාණ වූ මෛත්‍රීසහගත සිත වඩන්නේ ය.",
            null,
            "උඩ ද යට ද සරස ද (සතුරන් ය යි කියන ලද) සීමාවකුදු නැති ව අතරතුර වත් වෛර චේතනා පහළ වීමක් නැති ව, සතුරන් රහිත ව",
            null,
            "සිටින්නේ හෝ ඇවිදින්නේ හෝ උන්නේ හෝ නිදන්නේ හෝ යම් තාක් මෛත්‍රීසහගත සිහිය ඉටනු කැමැත්තේ ද, ඒ තාක් පහ වූ මිද්ධය (අලස බව) ඇති ව ඉටන්නේ ය.",
            null,
            "මේ මෛත්‍රීවිහරණය මේ බුද්ධශාසනයෙහි ශ්‍රේෂ්ඨ විහරණයැ යි ප්‍රකාශ කළහ.",
            null,
            "(සත්ත්‍වයෙක් පුද්ගලයෙක් ඇත්තේ ය යන) මිථ්‍යදෘෂ්ටිය නො පැමිණ (ලොකොත්තරශීලයෙන්) සිල්වත් වූයේ (සෝතාපත්තිමග්ගසම්මාදිට්ඨි ය යි කියන ලද) දර්‍ශනයෙන් යුක්ත වූයේ",
            null,
            "(සකෘදාගාමි අනාගාමී මාර්‍ග දෙකින්) වස්තුකාමයන්හි ගිජුබව දුරු කොට, ඒකාන්තයෙන් ම නැවත ගර්‍භයෙක් හි විසීමට නො පැමිණෙන්නේ ය. (ශුද්ධාවාසයයෙක ඉපිද එහි දි ම රහත්බවට පැමිණ පිරිනිවන් පාන්නේ ය.)",
            null
        ]
    }
}