const pirithData = {
    "02-saranagamanam": {
        "labels": [
            [
                0.306631,
                8.202377
            ],
            [
                8.611218,
                16.788042
            ],
            [
                17.222436,
                26.319153
            ],
            [
                27.647887,
                34.138242
            ],
            [
                34.700398,
                41.369621
            ],
            [
                41.752909,
                48.601
            ],
            [
                48.984288,
                57.161113
            ],
            [
                57.544401,
                65.440147
            ],
            [
                65.848989,
                74.230234
            ],
            [
                74.639075,
                82.764794
            ],
            [
                83.199188,
                91.197144
            ],
            [
                91.605985,
                100.038335
            ]
        ],
        "text": [
            [
                [
                    "නමො තස්ස භගවතො අරහතො සම්මා සම්බුද්ධස්ස",
                    "ඒ භාග්‍යවත් අර්හත් සම්මා සම්බුදුරදුන් වහන්සේට නමස්කාර වේවා."
                ]
            ],
            [
                [
                    "නමො තස්ස භගවතො අරහතො සම්මා සම්බුද්ධස්ස",
                    "ඒ භාග්‍යවත් අර්හත් සම්මා සම්බුදුරදුන් වහන්සේට නමස්කාර වේවා."
                ]
            ],
            [
                [
                    "නමො තස්ස භගවතො අරහතො සම්මා සම්බුද්ධස්ස",
                    "ඒ භාග්‍යවත් අර්හත් සම්මා සම්බුදුරදුන් වහන්සේට නමස්කාර වේවා."
                ]
            ],
            [
                [
                    "බුද්ධං සරණං ගච්ඡාමි.",
                    "බුදුන් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "ධම්මං සරණං ගච්ඡාමි.",
                    "දහම් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "සංඝං සරණං ගච්ඡාමි.",
                    "සඟුන් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "දුතියම්පි බුද්ධං සරණං ගච්ඡාමි.",
                    "දෙවනුව ද බුදුන් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "දුතියම්පි ධම්මං සරණං ගච්ඡාමි.",
                    "දෙවනුව ද දහම් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "දුතියම්පි සංඝං සරණං ගච්ඡාමි.",
                    "දෙවනුව ද සඟුන් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "තතියම්පි බුද්ධං සරණං ගච්ඡාමි.",
                    "තෙවනුව ද බුදුන් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "තතියම්පි ධම්මං සරණං ගච්ඡාමි.",
                    "තෙවනුව ද දහම් සරණ කොට යෙමි."
                ]
            ],
            [
                [
                    "තතියම්පි සංඝං සරණං ගච්ඡාමි.",
                    "තෙවනුව ද සඟුන් සරණ කොට යෙමි."
                ]
            ]
        ]
    },
    "03-dasasikkhapadani": {
        "labels": [
            [
                0.464348,
                9.095761
            ],
            [
                9.560109,
                17.699859
            ],
            [
                18.191522,
                26.877563
            ],
            [
                27.369226,
                35.345088
            ],
            [
                35.809436,
                47.554713
            ],
            [
                48.019061,
                56.404642
            ],
            [
                56.868991,
                68.614267
            ],
            [
                69.297132,
                84.32016
            ],
            [
                85.38543,
                95.19137
            ],
            [
                95.683033,
                106.882017
            ]
        ],
        "text": [
            [
                [
                    "පාණාතිපාතා",
                    "ප්‍රාණඝාතයෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "අදින්නාද‍ානා",
                    "නුදුන් දෙය ගැනීමෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "අබ්‍රහ්මචරියා",
                    "අබ්‍රහ්මචරියාවෙන් (මෙවුන්දමෙහි හැසිරීමෙන්)"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "මුසාවාද‍ා",
                    "මුසාවාදයෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "සුරා මෙරය මජ්ජපමාදට්ඨානා",
                    "මදයට හා ප්‍රමාදයට කාරණ වූ රහමෙරින්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "විකාල භොජනා",
                    "විකල් බොජුනෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "නච්ච ගීත වාදිත විසූක දස්සනා",
                    "නැටීම, ගැයීම, වැයීම, විසුලු බැලීම යන මෙයින්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "මාලා ගන්ධ විලේපන ධාරණ මණ්ඩන විභූසනට්ඨානා",
                    "මල්, ගඳ, විලවුන් ද‍ැරීම, සැරසීම, වෙසෙසින් සැරසීම යන කාරණයෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "උච්චාසයන මහාසයනා",
                    "උසසුස් මහ අස්නෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ],
            [
                [
                    "ජාතරූප රජත පටිග්ගහණා",
                    "රන්, රිදී, මසු, කහවණු පිළිගැනීමෙන්"
                ],
                [
                    "වෙරමණී සික්ඛාපදං",
                    "වැළකීමේ ශික්ෂා පද ය"
                ]
            ]
        ]
    },
    "04-samanera-panha": {
        "labels": [
            [
                0.511942,
                12.684794
            ],
            [
                13.253619,
                22.354816
            ],
            [
                22.8952,
                31.512896
            ],
            [
                32.024839,
                43.145364
            ],
            [
                43.571983,
                53.441094
            ],
            [
                53.924595,
                64.931356
            ],
            [
                65.301092,
                74.203201
            ],
            [
                74.629819,
                85.494374
            ],
            [
                85.892551,
                94.652454
            ],
            [
                95.079072,
                111.205257
            ]
        ],
        "text": [
            [
                [
                    "එක නාම කිං?",
                    "(මේ සසුනෙහි) එක නම් කිම?"
                ],
                [
                    "සබ්බේ සත්තා",
                    "හැම සත්හු"
                ],
                [
                    "ආහාරට්ඨිතිකා",
                    "ආහාර හේතුවෙන් සිටිති"
                ]
            ],
            [
                [
                    "ද්වෙ නාම කිං?",
                    "දෙක නම් කිම?"
                ],
                [
                    "නාමඤ්ච රූපඤ්ච",
                    "නාමය හා රූපයයි"
                ]
            ],
            [
                [
                    "තීණි නාම කිම?",
                    "තුන නම් කිම?"
                ],
                [
                    "තිස්සෝ වෙදනා",
                    "(සුඛ දූඃඛ උපෙක්ෂා යන) තුන් වෙදනාවෝ ය."
                ]
            ],
            [
                [
                    "චත්තාරි නාම කිං?",
                    "සතර නම් කිම?"
                ],
                [
                    "චත්තාරි අරිය සච්චානි",
                    "(දූඃඛ සමුදය නිරොධ මාර්ග යන) සතර ආර්ය සත්‍යයෝ ය."
                ]
            ],
            [
                [
                    "පඤ්ච නාම කිං?",
                    "පස නම් කිම?"
                ],
                [
                    "පඤ්චුපාද‍ානක්ඛන්ධා",
                    "(රූප වෙදනා සංඥා සංස්කාර විඥාන යන) පස් උපාද‍ානස්කන්ධයෝ ය."
                ]
            ],
            [
                [
                    "ඡනාම කිං?",
                    "සය නම් කිම?"
                ],
                [
                    "ඡඅඡ්ඣත්තිකානි ආයතනානි",
                    "(චක්ඛු සොත ඝාන ජිව්හා කාය මන යන) ආධ්‍යාත්මික ආයතනයෝ සය ය."
                ]
            ],
            [
                [
                    "සත්ත නාම කිං?",
                    "සත නම්?"
                ],
                [
                    "සත්‌ත බොජ්‌ඣඞ්‌ගා",
                    "(සති ධම්මවිචය පීති විරිය පස්සද්ධි සමාධි උපෙක්ඛා යන) බොජ්ඣඞ්ග සත ය."
                ]
            ],
            [
                [
                    "අට්ඨ නාම කිං?",
                    "අට නම් කිම?"
                ],
                [
                    "අරියො අට්ඞ්ගිකො මග්ගො",
                    "(සම්මාදිට්ඨි සම්මාසඬ්කප්ප සම්මාවාචා සම්මාකම්මන්ත සම්මාආජීව සම්මාවායාම සම්මාසති සම්මාසාමාධි යන) අරි අටඟි මග ය."
                ]
            ],
            [
                [
                    "නව නාම කිං?",
                    "නවය නම් කිම?"
                ],
                [
                    "නව සත්‌තාවාසා",
                    "(නානත්තකාය නානත්තසඤ්ඤි ය, නානත්තකාය එකත්තසඤ්ඤි ය, එකත්තකාය නානත්තසඤ්ඤි ය, එකත්තකාය එකත්තසඤ්ඤි ය, අසඤ්ඤි ය, අකාසානඤ්චායතනූපග ය, විඤ්ඤාණඤ්චායතනූපග ය, ආකිඤ්චඤ්ඤායතනූපග ය, නෙවසඤ්ඤානාසඤ්ඤායතනූපග ය යන) සත්තාවාස නවය ය."
                ]
            ],
            [
                [
                    "දස නාම කිං?",
                    "දස නම් කිම?"
                ],
                [
                    "දසහඞ්ගෙහි",
                    "(අසෙඛ සම්මාදිට්ඨි ය, අසෙඛ සම්මාසඬ්කප්ප ය, අසෙඛ සම්මාවාචා, අසෙඛ සම්මාකම්මන්ත ය, අසෙඛ සම්මාආජීව ය, අසෙඛ සම්මාවායාම ය, අසෙඛ සම්මාසති ය, අසෙඛ සම්මාසාමාධි ය, අසෙඛ සම්මාඤාණ ය, අසෙඛ සම්මාවිමුත්තිය යන) දසඟින්"
                ],
                [
                    "සමන්නාගතො",
                    "යුක්ත වූයේ"
                ],
                [
                    "අරහාති",
                    "අරහත්ය යි"
                ],
                [
                    "වුච්චති ඉති",
                    "කියනු ලැබේ."
                ]
            ]
        ]
    },
    "05-dvattimsakaraya": {
        "labels": [
            [
                0.69428,
                13.759374
            ],
            [
                14.138072,
                24.646952
            ],
            [
                24.930976,
                35.313623
            ],
            [
                35.818554,
                44.591733
            ],
            [
                44.970431,
                55.289961
            ],
            [
                55.66866,
                67.692333
            ]
        ],
        "text": [
            [
                [
                    "අත‍්ථි",
                    "ඇත්තාහ."
                ],
                [
                    "ඉමස්මිවං කායෙ",
                    "මේ සිරුරෙහි"
                ],
                [
                    "කෙසා",
                    "කේසයෝ ය"
                ],
                [
                    "ලොමා",
                    "ලෝම‍යෝ ය"
                ],
                [
                    "නඛා",
                    "නිය ය"
                ],
                [
                    "දන්තා",
                    "දත් ය"
                ],
                [
                    "තචො",
                    "සම ය"
                ]
            ],
            [
                [
                    "මංසං",
                    "මස් ය"
                ],
                [
                    "නහාරු",
                    "නහර ය"
                ],
                [
                    "අට්ඨි",
                    "ඇට ය"
                ],
                [
                    "අට්ඨිමිඤ්ජා",
                    "ඇටමිදුලු ය"
                ],
                [
                    "වක්කං",
                    "වකුගඩුව ය"
                ]
            ],
            [
                [
                    "හදයං",
                    "හෘදය මාංස ය"
                ],
                [
                    "යකනං",
                    "අක්මාව ය"
                ],
                [
                    "කිලොමකං",
                    "දලබුව ය"
                ],
                [
                    "පිහකං",
                    "බඩදිව ය"
                ],
                [
                    "පප්ඵාසං",
                    "පපුව (පපුමස) ය"
                ]
            ],
            [
                [
                    "අන්තං",
                    "බඩවැල ය"
                ],
                [
                    "අන්තගුණං",
                    "අතුණු බහන් ය"
                ],
                [
                    "උදරියං",
                    "(නොපැසුණු අහරය) උදරිය ය"
                ],
                [
                    "කරිසං",
                    "අහර මල ය"
                ]
            ],
            [
                [
                    "පිත්තං",
                    "පිත ය"
                ],
                [
                    "සෙම්හං",
                    "සෙම ය"
                ],
                [
                    "පුබ්බො",
                    "(සැරවය) පූයා ය"
                ],
                [
                    "ලොහිතං",
                    "ලෙහෙ ය"
                ],
                [
                    "සොද‍ො",
                    "සෝදිය ය"
                ],
                [
                    "මෙද‍ො",
                    "මේද ය"
                ]
            ],
            [
                [
                    "අස්සු",
                    "කඳුලු ය"
                ],
                [
                    "වසා",
                    "වුරුණු ය"
                ],
                [
                    "ඛෙලො",
                    "කෙළ ය"
                ],
                [
                    "සිංඝානිකා",
                    "මුකුණු ය (සොටු ය)"
                ],
                [
                    "ලසිකා",
                    "සඳමිදුලු ය"
                ],
                [
                    "මුත්තං",
                    "මූත්‍ර ය"
                ],
                [
                    "මත්ථකෙ",
                    "හිස මුදුනෙහි"
                ],
                [
                    "මත්ථලුඞ්ගන්ති",
                    "හිස් මොලය යි යන මේ දෙතිස් කුණපයෝ"
                ]
            ]
        ]
    },
    "06-paccavekkhana": {
        "labels": [
            [
                0,
                46.414089,
                1
            ],
            [
                46.414089,
                116.626903,
                2
            ],
            [
                116.626903,
                166.459593,
                3
            ],
            [
                166.459593,
                202.486393,
                4
            ]
        ],
        "text": [
            [
                [
                    "පටිසංඛාය",
                    "මෙනෙහි කොට"
                ],
                [
                    "යොනිසො",
                    "නුවණින්"
                ],
                [
                    "චීවරං පටිසේවාමි",
                    "සිවුරු පරිභෝග කරමි."
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "සීතස්ස පටිඝාතාය",
                    "සීත නසනු පිණිස"
                ],
                [
                    "උණ්හසස පටිඝාතාය",
                    "උෂ්ණ නසනු පිණිස"
                ],
                [
                    "ඩංස",
                    "ඩැහ ලේ බොන මැසි ය (ඇටමැසිය)"
                ],
                [
                    "මකස",
                    "මදුරු ය"
                ],
                [
                    "වාත",
                    "වාත ය"
                ],
                [
                    "ආතප",
                    "අවුව ය"
                ],
                [
                    "සිරිංසප",
                    "සිරිංසප ය (සර්පයෝ ය) යන මොවුන් ගේ"
                ],
                [
                    "සම්ඵස්සානං",
                    "ස්පර්ශය"
                ],
                [
                    "පටිඝාතාය",
                    "නසනු පිණිස"
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "හිටිකොපින",
                    "ලජ්ජා කෝපන ස‍්ථානය (ලැජ්ජා නසන තැන)"
                ],
                [
                    "පටිච්ඡාදනත්ථං",
                    "වැසීම පිණිස"
                ]
            ],
            [
                [
                    "පටිසංඛාය",
                    "මෙනෙහි කොට"
                ],
                [
                    "යොනිසො",
                    "නුවණින්"
                ],
                [
                    "පිණ්ඩපාතං",
                    "පිණ්ඩපාතය"
                ],
                [
                    "පටිසේවාමි",
                    "වළඳමි"
                ],
                [
                    "නෙවදවාය",
                    "ක්‍රීඩා පිණිස නොවේ"
                ],
                [
                    "න මද‍ාය",
                    "මදය පිණිස නොවේ (පුරුෂ මද, බලමද ආදිය පිණිස)"
                ],
                [
                    "න මණ්ඩනාය",
                    "අලංකාර පිණිස නොවේ"
                ],
                [
                    "න විභුසනාය",
                    "සැරසීම පිණිස නොවේ"
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "ඉමස්ස කායස්ස",
                    "මේ ශරීරයා ගේ"
                ],
                [
                    "ඨිතියා",
                    "පැවැත්ම පිණිස"
                ],
                [
                    "යාපනාය",
                    "යැපීම පිණිස"
                ],
                [
                    "විහිං සුපරතියා",
                    "විහීංසාහරණ පිණිස (බඩගිනි නැසීමට)"
                ],
                [
                    "බ්‍රහ්මචරියානුග්ගහාය",
                    "බඹසර සපයනු පිණිස (බඹසර රැකීමට අනුග්‍රහ පිණිස) අහර වළඳිමි"
                ],
                [
                    "ඉති",
                    "මෙසේ"
                ],
                [
                    "පුරාණඤ්ච වෙදනං",
                    "පුරාණ දුක් වේදනාව."
                ],
                [
                    "පටිහංඛාමි",
                    "නසන්නෙමි"
                ],
                [
                    "නවං ච වෙදනං",
                    "අලුත් දුක් වේදනාව"
                ],
                [
                    "න උප්පාදෙස්සාමි",
                    "නො උපදවමි"
                ],
                [
                    "යාත්‍රා ච",
                    "ඉරියව් පැවැත්ම ද"
                ],
                [
                    "මෙ",
                    "මට"
                ],
                [
                    "භවිස්සති",
                    "වන්නේය යි (සළකා අහර වළඳමි.)"
                ],
                [
                    "අනවජ්ජතා ච",
                    "නිවරද බව ද"
                ],
                [
                    "ඵසුවිහාරො ච",
                    "පහසු විහරණය ද"
                ]
            ],
            [
                [
                    "පටිසංඛාය",
                    "මෙනෙහි කොට"
                ],
                [
                    "යොනිසො",
                    "නුවණින්"
                ],
                [
                    "සෙනාසනං",
                    "සෙනසුන්"
                ],
                [
                    "පටිසේවාමි",
                    "වැළඳ ගනිමි (පරිභෝග කරමි.)"
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "සීතස්ස පටිඝාතාය",
                    "සීත පීඩා නසනු පිණිස"
                ],
                [
                    "උණ්හස්ස පටිඝාතාය",
                    "උෂ්ණ පීඩා නසනු පිණිස"
                ],
                [
                    "ඩංස",
                    "ඩැහැ ලේ බොන මැසි ය"
                ],
                [
                    "මකස",
                    "විද ලේබොන මදුරු ය"
                ],
                [
                    "වාත",
                    "වාතය"
                ],
                [
                    "ආතප",
                    "අවුව ය"
                ],
                [
                    "සිරිංසප",
                    "සිරිංසප ය (සර්පයෝ ය) යන මොවුන්ගේ"
                ],
                [
                    "සම්ඵස්සානං පටිඝාතාය",
                    "ස්පර්ශ නසනු පිණිස"
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "උතුපරිස්සය",
                    "සෘතු උපද්‍රව"
                ],
                [
                    "විනොදනං",
                    "දුරු කිරීම පිණිස"
                ],
                [
                    "පටිසල්ලානාරාමත්ථං",
                    "සිත එකඟ කිරීමෙහි ඇලෙනු පිණිස"
                ]
            ],
            [
                [
                    "පටිසංඛාය",
                    "මෙනෙහි කොට"
                ],
                [
                    "යොනිසො",
                    "නුවණින්"
                ],
                [
                    "ගිලානපච්චය භෙසජ්ජ පරික්ඛාරං",
                    "ගිලන්පස බෙහෙත් පිරිකර"
                ],
                [
                    "පටිසේවාමි",
                    "වළඳමි."
                ],
                [
                    "යාවදෙව",
                    "යම්තාක්"
                ],
                [
                    "උප්පන්නානං",
                    "උපන්"
                ],
                [
                    "වෙය්‍යාබාධිකානං",
                    "සිරුර පෙළන"
                ],
                [
                    "වෙදනාතං",
                    "වේදනාවන්"
                ],
                [
                    "පටිඝාතාය",
                    "නසනු පිණිස"
                ],
                [
                    "අඛ්‍යාපජ්ඣ",
                    "නිරෝගිබව"
                ],
                [
                    "පරමතාය",
                    "උතුම් බැවින්"
                ]
            ]
        ]
    },
    "07-dasadhamma": {
        "labels": [
            [
                0.921807,
                2.654805
            ],
            [
                2.654805,
                23.966991
            ],
            [
                24.280405,
                47.731184
            ],
            [
                48.081471,
                62.830388
            ],
            [
                63.346601,
                79.164815
            ],
            [
                79.533537,
                94.577433
            ],
            [
                94.983028,
                111.169965
            ],
            [
                111.538688,
                129.790474
            ],
            [
                130.232941,
                154.16306
            ],
            [
                154.458038,
                175.622735
            ],
            [
                176.286436,
                218.652701
            ],
            [
                219.021424,
                237.789422
            ],
            [
                238.231889,
                255.561867
            ],
            [
                255.967463,
                293.245352
            ],
            [
                294.277776,
                307.920524
            ],
            [
                308.215503,
                322.337591
            ]
        ],
        "text": [
            [
                [
                    "දසධම්ම සුතං",
                    "දස ධම්ම සූත්‍රය"
                ]
            ],
            [
                [
                    "එවං මෙ සුතං",
                    "මා විසින් මෙසේ අසන ලදී"
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත් නුවරැ"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු සිටුහු ගේ"
                ],
                [
                    "ආරාමේ",
                    "ආරාමයෙහි"
                ]
            ],
            [
                [
                    "තත්‍ර ඛො",
                    "එකල්හි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "භික්ඛු ආමන්තෙසි",
                    "භික්ෂූන් ඇමතූසේක"
                ],
                [
                    "භික්ඛවො ඉති",
                    "මහණෙනි කියා"
                ],
                [
                    "භදත්තෙ ඉති",
                    "ස්වාමීන් වහන්සැ'යි කියා"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ හික්ෂූහු"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "පච්චස්සොසුං",
                    "පිළිවදන් දුන්හු ය"
                ],
                [
                    "භගවා",
                    "බුදුරජාණන් වහන්සේ"
                ],
                [
                    "එතදවොච",
                    "මෙය වද‍ාළ සේක"
                ]
            ],
            [
                [
                    "දස ඉමෙ",
                    "මේ දස"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "ධම්මා",
                    "ධර්මයෝ"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවෙක්ෂා කටයුත්තාහු ය"
                ],
                [
                    "කතමෙ දස?",
                    "කවර දස ධර්මයෝ ද යත්"
                ]
            ],
            [
                [
                    "වෙවණ්ණියං",
                    "විවණ බවට (වෙනස් වර්‍ණයකට)"
                ],
                [
                    "අජ්ඣුපගතො ඉති",
                    "පැමිණියේ වෙමි'යි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිරතුරුව"
                ],
                [
                    "පච්වෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවෙක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "පරපටිබද්ධා ඉති",
                    "පරා (අනුන්) පිළිබඳය යි"
                ],
                [
                    "මෙ ජීවිකා",
                    "මාගේ දිවි පැවත්ම"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "මෙනෙහි කටයුතු යි."
                ]
            ],
            [
                [
                    "අඤ්ඤ‍ො",
                    "අන්‍ය වූ (ගිහියන්ගෙන් වෙනස්වූ)"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "ආකප්පො",
                    "ආකල්පයෙක් (හැසිරීමක්)"
                ],
                [
                    "කරණීයො",
                    "කටයුතුය යි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවේක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "කච්චිනු ඛො",
                    "කිම හෝ"
                ],
                [
                    "මෙ අත්තා",
                    "මාගේ ආත්මය (සිත)"
                ],
                [
                    "සීලතො",
                    "සීලයෙන්"
                ],
                [
                    "න උපවදතිති",
                    "උපවාද නො කෙරේ හෝයි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "මෙනෙහි කටයුතු ය"
                ]
            ],
            [
                [
                    "කච්චිනු ඛො",
                    "කිම හෝ"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "අනුවිච්ච",
                    "විචාර"
                ],
                [
                    "විඤ්ඤු සබ්‍රහ්මචාරී",
                    "නුවණැති සබ්‍රම්සරහු"
                ],
                [
                    "සීලතො",
                    "සීලයෙන්"
                ],
                [
                    "න උපවදන්ති' ති",
                    "පරිභව නො බෙණෙද්දෝ හෝ යි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවේක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "සබ්බෙහි",
                    "සියලුදෙනා ගෙන්"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "පියෙහි",
                    "ප්‍රිය වූ"
                ],
                [
                    "මනාපෙහි",
                    "මනාප වූ"
                ],
                [
                    "නානාභාවො",
                    "නානාභාවය"
                ],
                [
                    "විනාභාවොති",
                    "විනාශ භාවය වේයයි"
                ],
                [
                    "පබ්බජිතෙත",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවෙක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "කම්මස්සකොම්හි",
                    "කර්මය තමා අයත් කොට ඇත්තේ වෙමි"
                ],
                [
                    "කම්ම ද‍ායාද‍ො‍‍‍",
                    "කර්මය ද‍ායාද කොට ඇත්තෙමි"
                ],
                [
                    "කම්ම යොනි",
                    "කර්මය යෝනි කොට ඇත්තෙමි"
                ],
                [
                    "කම්ම බන්ධු",
                    "කර්මය නෑ කොට ඇත්තෙමි"
                ],
                [
                    "කම්ම පටිසරණො",
                    "කර්මය පිළිසරණ කොට ඇත්තෙමි"
                ],
                [
                    "කල්‍යාණං වා",
                    "යහපත් වූ හෝ"
                ],
                [
                    "පාපකං වා",
                    "පවිටු වූ හෝ"
                ],
                [
                    "යං කම්මං",
                    "යම් කර්මයක්"
                ],
                [
                    "කරිස්සාමි",
                    "කෙරෙම් ද"
                ],
                [
                    "තස්ස ද‍ායාද‍ො භවිස්සාමි ති",
                    "ඒ කර්මය විසින් දෙන ලද්ද අයත් වෙමි යි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවේක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "කථංභූතස්ස මෙ",
                    "කෙසේ වූ මට"
                ],
                [
                    "රත්තිං දිවා",
                    "රෑ දවල්හු"
                ],
                [
                    "විතිපතන්ති'ති",
                    "ඉක්මෙත් දෝහෝ යි"
                ],
                [
                    "පබ්බජිත්තෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවේක්ෂා කටයුතු යි"
                ]
            ],
            [
                [
                    "කච්චනු ඛො අහං",
                    "කිමැ හෝ මම"
                ],
                [
                    "සුඤ්ඤ‍ාගාරෙ",
                    "ශුන්‍යාගාරයෙහි (හිස් පෙදෙසෙහි)"
                ],
                [
                    "අභිරමාමි ඉති",
                    "ඇලෙම්දෝ හෝ යි"
                ],
                [
                    "පබ්බජිතෙත",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "ප්‍රත්‍යවේක්ෂා කටයුතු යි(මෙනෙහි කටයුතු යි)"
                ]
            ],
            [
                [
                    "අත්ථිනු ඛො",
                    "ඇද්දෝ හෝ යි"
                ],
                [
                    "මෙ",
                    "මා වෙත"
                ],
                [
                    "උත්තරිමනුස්ස ධම්මා",
                    "උතුරු මිනිස් දම්"
                ],
                [
                    "අලමරියඤාණදස්සන විසෙසො අධිගතො",
                    "පොහොසත් ආර්යඤාණදර්ශන විශේෂයෙක් ලබන ලද්දේ හෝ"
                ],
                [
                    "සො අහං",
                    "ඒ මම"
                ],
                [
                    "පච්ඡිමෙ කාලෙ",
                    "පශ්චිම කාලයෙහි (මරණ කාලයෙහි)"
                ],
                [
                    "සබ්‍රහ්මචාරිහි",
                    "සබ්‍රම්සරුන් විසින්"
                ],
                [
                    "පුට්ඨො",
                    "විචාරණ ලද්දෙම්"
                ],
                [
                    "න මංකුභවිස්සාමි ඉති",
                    "තේජස් රහිත නො වෙම් දෝ හෝ යි"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බං",
                    "මෙනෙහි කටයුතු යි"
                ]
            ],
            [
                [
                    "ඉමෙ ඛො",
                    "මේ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "දස ධම්මා",
                    "දස ධර්මයෝ"
                ],
                [
                    "පබ්බජිතෙන",
                    "පැවිද්දහු විසින්"
                ],
                [
                    "අභිණ්හං",
                    "නිතොර"
                ],
                [
                    "පච්චවෙක්ඛිතබ්බාති",
                    "මෙනෙහි කළ යුත්තාහු ය'යි"
                ]
            ],
            [
                [
                    "ඉදං අවොච",
                    "මේ දේශනාව වදාළ සේක"
                ],
                [
                    "භගවා",
                    "බුදුරදුන් වහන්සේ"
                ],
                [
                    "අත්තමානා",
                    "සතුටු සිත් ඇති"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ භික්ෂූහු"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවතුන් වහන්සේ ගේ"
                ],
                [
                    "භාසිතං",
                    "දේශනාවට"
                ],
                [
                    "අභිනන්දුං ඉති",
                    "විශේෂයෙන් සතුටු වූවාහු ය."
                ]
            ]
        ]
    },
    "08-mahamangala": {
        "labels": [
            [
                0,
                2,
                0
            ],
            [
                3.277322,
                11.346696,
                1
            ],
            [
                11.814885,
                23.712392,
                2
            ],
            [
                24.235662,
                34.315494,
                3
            ],
            [
                34.701061,
                46.598568,
                4
            ],
            [
                47.121838,
                52.712564,
                5
            ],
            [
                52.850267,
                67.474286,
                6
            ],
            [
                67.970015,
                81.795359,
                7
            ],
            [
                83.199925,
                93.555163,
                8
            ],
            [
                93.94073,
                104.709075,
                9
            ],
            [
                105.342507,
                115.532501,
                10
            ],
            [
                116.028231,
                126.796576,
                11
            ],
            [
                127.264765,
                137.922948,
                12
            ],
            [
                138.308515,
                148.746374,
                13
            ],
            [
                149.242104,
                159.266855,
                14
            ],
            [
                159.679963,
                170.255524,
                15
            ],
            [
                170.833875,
                181.409437,
                16
            ],
            [
                181.877626,
                191.984998,
                17
            ],
            [
                192.508268,
                202.973668,
                18
            ],
            [
                203.386776,
                213.301364,
                19
            ],
            [
                214.320364,
                224.124791,
                20
            ],
            [
                224.537899,
                235.141001,
                21
            ],
            [
                235.664271,
                245.936886,
                22
            ],
            [
                246.377535,
                256.237043,
                23
            ],
            [
                256.898015,
                266.59228,
                24
            ],
            [
                267.088009,
                277.856355,
                25
            ],
            [
                278.462246,
                288.349294,
                26
            ],
            [
                288.707321,
                299.393045,
                27
            ],
            [
                299.943855,
                309.748282,
                28
            ],
            [
                310.188931,
                320.434006,
                29
            ],
            [
                321.039897,
                331.229892,
                30
            ],
            [
                331.642999,
                344.889992,
                31
            ]
        ],
        "text": [
            [
                [
                    "මහා මංගල සුත්තං",
                    "මහා මංගල සූත්‍රය."
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී"
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ]
            ],
            [
                [
                    "සාවත්ථියං",
                    "සැවැත් නුවරැ"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු මහ සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "අරමෙ හි"
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "එකල්හි"
                ],
                [
                    "අඤ්ඤතරා දෙවතා",
                    "එක්තරා දෙවියෙක්"
                ],
                [
                    "අභික්කන්තාය රත්තියා",
                    "රෑ ඉක්ම ගිය කල්හි"
                ]
            ],
            [
                [
                    "අභික්කන්ත වණ්ණා",
                    "විශිෂ්ඨ ශෝභා ඇත්තේ"
                ],
                [
                    "කෙවලකපං ජෙතවනං",
                    "සියලු දෙව්රම් වෙහෙර"
                ],
                [
                    "ඔභාසෙත්වා",
                    "ස්වකීය ශරීර ශොභාවෙන් බබුලුවා"
                ]
            ],
            [
                [
                    "යෙන භගවා",
                    "භාග්‍යවතුන් වහන්සේ යම් තැනෙක ද"
                ],
                [
                    "තෙන උපසංකමි",
                    "එතැනට එළඹියේ ය"
                ]
            ],
            [
                [
                    "උපසංකමිත්වා",
                    "එළඹ"
                ],
                [
                    "භගවන්තං",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "අභිවාදෙත්වා",
                    "වැඳ"
                ],
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "අට්ඨාසි",
                    "සිටියේ ය"
                ]
            ],
            [
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "ඨිතා ඛො සා දෙවතා",
                    "සිටි ඒ දෙවිතෙම"
                ],
                [
                    "භගවන්තං",
                    "භාග්‍යවතුන් වහන්සේස්ට"
                ],
                [
                    "ගාථාය",
                    "ගාථායෙන්"
                ],
                [
                    "අජ්ඣහාසි",
                    "(මෙසේ) කීයේ ය."
                ]
            ],
            [
                [
                    "බහුදෙවා",
                    "බොහෝ දෙවියෝ ද"
                ],
                [
                    "මනුස්සා ච",
                    "මනුෂ්‍යයෝද"
                ],
                [
                    "මංගලානි",
                    "මංගල්‍යයන්"
                ],
                [
                    "අචින්තයුං",
                    "සිතූහ"
                ]
            ],
            [
                [
                    "ආකංඛමානා",
                    "කැමැති වන්නා වූ"
                ],
                [
                    "සොත්ථානං",
                    "මෙලොව පරලොව සැප"
                ],
                [
                    "බ්‍රූහි",
                    "වදාළ මැනැවි"
                ],
                [
                    "මඞ්‌ගලමුත්‌තමං",
                    "වැඩ සලසන උතුම් මඟුල්."
                ]
            ],
            [
                [
                    "අසෙවනා ච",
                    "සේවනය නො කිරීම ද"
                ],
                [
                    "බාලානං",
                    "බාලයන් ගේ නොහොත් අසත් පුරුෂයන් ගේ"
                ],
                [
                    "පණ්ඩිතානං ච සෙවනා",
                    "පණ්ඩිතයන් නොහොත් සත්පුරුෂයන් සේවනය කිරීම ද"
                ]
            ],
            [
                [
                    "පූජා ච පූජනීයානං",
                    "පිදිය යුත්තන් පිදීම ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "පතිරූප දෙස වාසො ච",
                    "සුදුසු පෙදෙස්හි විසීම ද"
                ],
                [
                    "පුබ්බේ ච කතපුඤ්ඤතා",
                    "පෙරකළ පින් ඇති බව ද"
                ]
            ],
            [
                [
                    "අත්තසම්මා පණිධි ච",
                    "සිය අත් බව මනා දහම්හි පිහිටුවීම ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "බාහුසච්චඤ් ච",
                    "බොහෝ ඇසූපිරූ තැන් ඇති බව ද"
                ],
                [
                    "සිප්පඤ් ච",
                    "ශිල්ප දැනීම ද"
                ],
                [
                    "විනයො ච සුසික්ඛිතො",
                    "මනාව හික්මුණු විනය ඇති බව ද"
                ]
            ],
            [
                [
                    "සුභාසිතා ච යා වාචා",
                    "යම් වචනයක් මොනවට කියන ලද ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "මාතා පිතු උපට්ඨානං",
                    "මවුට උපස්ථාන කිරීමද, පියාට උපස්ථාන කිරීම ද"
                ],
                [
                    "පුත්තදාරස්ස සංගහො",
                    "අඹුදරුවන්ට සංග්‍රහ කිරීම ද"
                ]
            ],
            [
                [
                    "අනාකුලා ච කම්මන්තා",
                    "නිරවුල් කර්මාන්ත ඇති බව ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "දානං ච",
                    "දන්දීම ද"
                ],
                [
                    "ධම්ම චරියා ච",
                    "දශ කුශලයෙහි හැසිරීම ද"
                ],
                [
                    "ඤාතකානං",
                    "ඤාතීන්ට"
                ],
                [
                    "සංගහො ච",
                    "සංග්‍රහ කිරීම ද"
                ]
            ],
            [
                [
                    "අනවජ්ජානි කම්මානි",
                    "නිවැරැදි ක්‍රියා ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "ආරති විරති පාපා",
                    "පාපයෙහි නො ඇලීම ද, පවින් වැළකීම ද"
                ],
                [
                    "මජ්ජපානා ච සඤ්ඤමො",
                    "මත්පැනෙන් වැළකීම ද"
                ]
            ],
            [
                [
                    "අප්පමාදො ච",
                    "නොපමා බව"
                ],
                [
                    "ධම්මෙසු",
                    "කුශල ධර්මයෙහි (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මගුලෙකි."
                ]
            ],
            [
                [
                    "ගාරාවො ච",
                    "ගරු කටයුත්තන්ට ගරු කිරීම ද"
                ],
                [
                    "නිවාතො ච",
                    "නිහතමාන බව ද"
                ],
                [
                    "සන්තුට්ඨි ච",
                    "ලද දෙයින් සතුටුවන බව ද"
                ],
                [
                    "කතඤ්ඤුතා",
                    "කෙළෙහිගුණ දන්නා බව ද"
                ]
            ],
            [
                [
                    "කාලෙන ධම්ම සවණං",
                    "සුදුසු කල්හි බණ ඇසීම ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "ඛන්තී ච",
                    "ඉවසීම ද"
                ],
                [
                    "සොවචස්සතා",
                    "සුවච බවද (කීකරු බවද)"
                ],
                [
                    "සමණානඤ් ච දස්සනං",
                    "ශ්‍රමණයන් දැකීම ද"
                ]
            ],
            [
                [
                    "කාලෙන ධම්ම සාකච්ඡා",
                    "සුදුසු කල්හි ධර්ම සාකච්ඡාව ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "තපො ච",
                    "තපස ද"
                ],
                [
                    "බ්‍රහ්මචරියඤ් ච",
                    "බඹසර ද (යහපත් හැසිරීම ද)"
                ],
                [
                    "අරිය සච්චාන දස්සනං",
                    "චතුරාර්යය සත්‍යයන් දැකීම ද"
                ]
            ],
            [
                [
                    "නිබ්බාන සච්ජිකිරියා ච",
                    "නිවන් පසක් කිරීම ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "ඵුට්ඨස්ස",
                    "ස්පර්ශ කරන ලද"
                ],
                [
                    "ලොක ධම්මෙහි",
                    "අටලෝ දහමින්"
                ],
                [
                    "චිත්තං",
                    "සිත"
                ],
                [
                    "යස්ස",
                    "යමක්හු ගේ"
                ],
                [
                    "න කම්පති",
                    "නො සැලේ ද"
                ]
            ],
            [
                [
                    "අසොකං",
                    "ශෝක රහිත ද"
                ],
                [
                    "විරජං",
                    "රාගාදි රජස් රහිත ද"
                ],
                [
                    "බේමං",
                    "නිර්භය ද (යන)"
                ],
                [
                    "එතං",
                    "මෙය"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ],
            [
                [
                    "එතාදිසානි",
                    "(අසත් පුරුෂයන් සේවනය නො කිරීම ආදි) මෙබඳු මංගලයත්"
                ],
                [
                    "කත්වාන",
                    "කොට"
                ],
                [
                    "සබ්බත්ථමපරාජිතා",
                    "හැම තන්හි නොපැරැදුනෝව"
                ]
            ],
            [
                [
                    "සබ්බත්ථ",
                    "සියලු තැන"
                ],
                [
                    "සොත්ථිං ගච්ඡන්ති",
                    "සැපයට යෙත් ද"
                ],
                [
                    "තං",
                    "එය"
                ],
                [
                    "තෙසං",
                    "ඔවුනට"
                ],
                [
                    "මංගලං උත්තමං",
                    "උතුම් මඟුලෙකි."
                ]
            ]
        ]
    },
    "09-rathana": {
        "labels": [
            [
                0.233795,
                1.870362
            ],
            [
                3.390031,
                16.950157
            ],
            [
                17.339815,
                30.783043
            ],
            [
                31.211668,
                45.08352
            ],
            [
                45.590076,
                58.604679
            ],
            [
                59.111236,
                72.3986
            ],
            [
                72.86619,
                85.452169
            ],
            [
                85.919759,
                93.128447
            ],
            [
                93.557071,
                106.961333
            ],
            [
                107.428924,
                120.365595
            ],
            [
                120.755254,
                127.963941
            ],
            [
                128.743258,
                141.952691
            ],
            [
                142.264418,
                155.123157
            ],
            [
                155.512816,
                162.682537
            ],
            [
                163.03323,
                176.281629
            ],
            [
                176.710253,
                190.426242
            ],
            [
                190.971764,
                204.298094
            ],
            [
                204.921548,
                218.715469
            ],
            [
                219.144094,
                232.743185
            ],
            [
                233.210775,
                246.615037
            ],
            [
                247.472286,
                261.42207
            ],
            [
                261.811729,
                275.371854
            ],
            [
                275.761513,
                289.165775
            ],
            [
                289.789229,
                302.92073
            ],
            [
                303.349354,
                316.363957
            ],
            [
                316.792582,
                329.885117
            ],
            [
                330.547536,
                343.055583
            ],
            [
                343.484208,
                355.953288
            ],
            [
                356.381913,
                369.396516
            ],
            [
                369.786175,
                382.87871
            ],
            [
                383.813891,
                397.958504
            ],
            [
                398.192299,
                411.090005
            ],
            [
                411.557595,
                424.611164
            ],
            [
                425.273584,
                438.677846
            ],
            [
                439.028539,
                451.731415
            ],
            [
                452.237971,
                465.447403
            ],
            [
                465.95396,
                478.890631
            ],
            [
                479.397187,
                492.60662
            ],
            [
                493.152142,
                507.296756
            ],
            [
                507.72538,
                521.519301
            ],
            [
                522.025857,
                535.118392
            ],
            [
                536.248402,
                549.574732
            ],
            [
                550.003357,
                563.602448
            ],
            [
                564.186936,
                577.513266
            ],
            [
                577.941891,
                591.190289
            ],
            [
                591.813743,
                604.98421
            ],
            [
                605.490766,
                619.089857
            ]
        ],
        "text": [
            [
                [
                    "රතන සුත්තං",
                    "රතන සූත්‍රය"
                ]
            ],
            [
                [
                    "යානී ඉධ භූතානි",
                    "යම් මෙතැන්හි අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "සමාගතානි",
                    "රැස්වූ"
                ],
                [
                    "භුම්මානි වා",
                    "පොළොවෙහි වූ හෝ"
                ],
                [
                    "යානි ව",
                    "යම් අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "අන්තලික්ඛෙ",
                    "අහසෙහි වූ ද"
                ]
            ],
            [
                [
                    "සබ්බෙව භූතා",
                    "ඒ සියලු අමනුෂ්‍යයෝ ම"
                ],
                [
                    "සුමනා භවන්තු",
                    "සතුටු සිතැත්තෝ වෙත්වා"
                ],
                [
                    "අථොපි",
                    "තවද"
                ],
                [
                    "සක්කච්ච",
                    "සකසා"
                ],
                [
                    "සුණන්තු",
                    "අසත්වා"
                ],
                [
                    "හාසිතං",
                    "මගේ වචනය"
                ]
            ],
            [
                [
                    "තස්මාහි",
                    "එබැවින්"
                ],
                [
                    "භූතා",
                    "භූතයිනි"
                ],
                [
                    "නිසාමෙථ",
                    "(මගේ වචනය) අසවු"
                ],
                [
                    "සබ්බෙ",
                    "සියලු තොපි"
                ],
                [
                    "මෙත්තං කරොථ",
                    "මෛත්‍රිය කරවු"
                ],
                [
                    "මානුසියා පජාය",
                    "මිනිස් ප්‍රජාවට"
                ]
            ],
            [
                [
                    "දිවා ච රත්තො ච",
                    "දහවල් ද රෑ ද"
                ],
                [
                    "හරන්ති",
                    "එළවත් ද"
                ],
                [
                    "යෙ",
                    "යම් කෙනෙක්"
                ],
                [
                    "බලිං",
                    "පුද පඬුරු"
                ],
                [
                    "තස්මාහි",
                    "එහෙයින්"
                ],
                [
                    "තෙ",
                    "ඔවුන්"
                ],
                [
                    "රක්ඛථ",
                    "රකිවු"
                ],
                [
                    "අප්පමත්තා",
                    "නොපමාවම"
                ]
            ],
            [
                [
                    "යං කිඤ්චි විත්තං",
                    "යම් ධනයෙක් වේ ද"
                ],
                [
                    "ඉධ වා",
                    "මේ මිනිස් ලොව හෝ"
                ],
                [
                    "හුරං වා",
                    "නාලෝ ආදී අන් ලොවෙක හෝ"
                ],
                [
                    "සග්ගෙසු වා",
                    "ස්වර්ගයෙහි හෝ"
                ],
                [
                    "යං පණීතං රතනං",
                    "යම්කිසි උතුම් රත්නයක් වේ ද (ඔවුන් අතුරෙහි)"
                ]
            ],
            [
                [
                    "න නො සමං අත්ථි",
                    "සදෘශයෙක් (සමානයෙක්) නොම ඇත්තේ ය"
                ],
                [
                    "තථාගතෙන",
                    "තථාගතයන් හා"
                ],
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "බුද්ධෙ",
                    "බුදුරදුන් කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ]
            ],
            [
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "ඛයං",
                    "(කෙලෙසුන් දුරුකරන හෙයින්) ක්ෂය නම් වූ"
                ],
                [
                    "විරාගං",
                    "(රාගයෙන් වෙන්වීමට නිමිති වූ) විරාග නම් වූ"
                ],
                [
                    "අමතං",
                    "(මරණයක් නැති හෙයින්) අමත නම් වූ"
                ],
                [
                    "පණීතං",
                    "උතුම් වූ (මහත් වූ)"
                ],
                [
                    "යදජ්ඣගා",
                    "යම් නිවනක් අවබෝධ කළේ ද?"
                ],
                [
                    "සක්‍යමුනී",
                    "ශාක්‍යමුනි තෙම"
                ],
                [
                    "සමාහිතො",
                    "එකඟ වූ සිත් ඇති"
                ]
            ],
            [
                [
                    "න තෙන ධම්‌මෙන සමං අත්ථි",
                    "ඒ ධර්මය හා සම වූ නොමැත"
                ],
                [
                    "කිඤ්චි",
                    "කිසිවක්"
                ],
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "ධම්මෙ",
                    "ධර්මයෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ]
            ],
            [
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යං",
                    "යම් ආර්යමාර්ගයක්"
                ],
                [
                    "බුද්ධ සෙට්ඨො",
                    "බුද්ධ ශ්‍රේෂ්ඨතෙමේ"
                ],
                [
                    "පරිචණ්ණයි",
                    "වර්ණනා කෙළේ ද"
                ],
                [
                    "සුචිං",
                    "පිරිසුදු වූ"
                ],
                [
                    "සමාධිං ආනන්තරිකං",
                    "ආනන්තරික සමාධිය යි"
                ],
                [
                    "ආහු",
                    "(බුද්ධාදී ආර්යයෝ) කියද්ද"
                ]
            ],
            [
                [
                    "සමාධිනා තෙන",
                    "ඒ සමාධිය හා"
                ],
                [
                    "සමො",
                    "සම වූ සමාධියෙක්"
                ],
                [
                    "න විජ්ජති",
                    "නැත"
                ],
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "ධම්මෙ",
                    "ධර්මයෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ]
            ],
            [
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යෙ පුග්ගලා",
                    "යම් ආර්ය පුද්ගලයෝ"
                ],
                [
                    "අට්ඨ",
                    "අටදෙනෙක් වෙත් ද"
                ],
                [
                    "සතං පසත්ථා",
                    "සත්පුරුෂයන් විසින් පසස්නා ලද"
                ],
                [
                    "චත්තාරි එතානි යුගානි",
                    "මොහු හැම දෙන සතර යුග"
                ],
                [
                    "හොන්‌ති",
                    "කෙනෙක් වෙති"
                ]
            ],
            [
                [
                    "තෙ",
                    "ඒ ආර්ය පුද්ගලයෝ"
                ],
                [
                    "දක්ඛිණෙය්‍යා",
                    "දක්ෂිණාවට සුදුස්සෝ වෙති"
                ],
                [
                    "සුගතස්ස",
                    "සුගත් බුදුරජුගේ"
                ],
                [
                    "සාවකා",
                    "ශ්‍රාවක වූ"
                ],
                [
                    "එතෙසු",
                    "මේ බුදු සව්වන් කෙරෙහි"
                ],
                [
                    "දින්නානි",
                    "දෙන ලද ද‍ානයෝ"
                ],
                [
                    "මහප්ඵලානී",
                    "මහත් පල ඇත්තෝ වෙත්"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යෙ",
                    "යම් කෙනෙක්"
                ],
                [
                    "සුප්පයුත්තා",
                    "මනාකොට යෙදුණාහු ද"
                ],
                [
                    "මනසා දළ්හෙන",
                    "සථිරවූ සිතින්"
                ],
                [
                    "නික්කාමිනො",
                    "සියලු කෙළෙසුන් කෙරෙන් මිදුනාහු ද"
                ],
                [
                    "ගොතම සාසනම්හි",
                    "ගෞතම නම් වූ තථාගත ශාසනයෙහි"
                ]
            ],
            [
                [
                    "තෙ",
                    "ඔවුහු"
                ],
                [
                    "පත්තිපත්තා",
                    "රහත් ඵලයට පැමිණියාහු නම් වෙත්"
                ],
                [
                    "අමතං",
                    "නිවණට"
                ],
                [
                    "විගය්හ",
                    "බැස"
                ],
                [
                    "ලද්ධා මුධා",
                    "නොමිලයේ ලත්"
                ],
                [
                    "නිබ්බුතිං",
                    "තිවන්සුව"
                ],
                [
                    "භුඤ්ජමානා",
                    "වළඳන්නාහු"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යථා",
                    "යම්සේ"
                ],
                [
                    "ඉන්දඛිලො පඨවිංසිතො",
                    "පොළොවෙහි යටට බැසගත් ඉන්ද්‍රඛීලය තෙම"
                ],
                [
                    "සියා",
                    "වන්නේය"
                ],
                [
                    "චතුබ්හි වාතෙහි",
                    "සිවු දිගින් හමන සුළගින්"
                ],
                [
                    "අසම්ප කම්පියො",
                    "සෙළවිය නොහැකි"
                ]
            ],
            [
                [
                    "තථුපමං",
                    "ඒ ඉන්ද්‍ර ඛීලය බඳු ය යි"
                ],
                [
                    "සප්පුරිසං",
                    "ඒ සත්පුරුෂයා"
                ],
                [
                    "වද‍ාමි",
                    "කියමි"
                ],
                [
                    "යො",
                    "යම් ආර්ය පුද්ගලයෙක්"
                ],
                [
                    "අරිය සච්චානි",
                    "චතුරාර්ය සත්‍යය"
                ],
                [
                    "අවෙච්ච පස්සති",
                    "නුවණින් අවබෝධ කෙළේ ද"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යෙ",
                    "යම් සෝවාන් පුඟුල් කෙනෙක්"
                ],
                [
                    "අරිය සච්චානි",
                    "චතුරාර්ය සත්‍යයත්"
                ],
                [
                    "විභාවයන්ති",
                    "තුමු අවබෝධ කෙරෙත් ද"
                ],
                [
                    "ගම්භීරපණනඤ්ඤෙන",
                    "ගැඹුරු නුවණැති බුදුරදුන් විසින්"
                ],
                [
                    "සුදෙසිතානි",
                    "මනාකොට දෙසන ලද"
                ]
            ],
            [
                [
                    "කිඤ්චාපි",
                    "කිසිසේත්"
                ],
                [
                    "තෙ",
                    "ඔවුහු"
                ],
                [
                    "හොන්ති භුසප්පමත්තා",
                    "බෙහෙවින් පමාවූවාහු නමුදු"
                ],
                [
                    "න",
                    "නොම"
                ],
                [
                    "තෙ",
                    "ඔවුහු"
                ],
                [
                    "භවං අට්ඨමං",
                    "අටවන භවයක්"
                ],
                [
                    "ආදියන්ති",
                    "ගනිති"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "සහාවස්‌ස දස්සන සම්පද‍ාය",
                    "දර්ශන සම්පත්තිය හා සමගම (සෝවාන් මග නුවණ පහළවීම සමග)"
                ],
                [
                    "තයස්‌සු ධම්මා",
                    "මේ සෝවාන් පුද්ගලයා ගේ කියන ලද සංයෝජන ධර්මයෝ තිදෙන"
                ],
                [
                    "ජහිතා භවන්ති",
                    "දුරුකරන ලද්ද‍ා‍‍‍‍‍‍හු වෙත් ද"
                ]
            ],
            [
                [
                    "සක්කාය දිට්ඨි",
                    "සක්කායදෘෂ්ටිය ද"
                ],
                [
                    "විචිකිච්ඡතං ච",
                    "විචිකිත්සාව ද (සැකය ද)"
                ],
                [
                    "සිලබ්බතං වාපි",
                    "ශීලව්‍රතාදියක් හෝ"
                ],
                [
                    "යදත්‍ථි කිඤ්චි",
                    "ඇද්ද යම්කිසි"
                ]
            ],
            [
                [
                    "චතුහි අපායෙහි ච",
                    "සිවු අපායෙන් ද"
                ],
                [
                    "විප්පමුත්තො",
                    "මිදුනේ වේ"
                ],
                [
                    "ඡචාභිඨානානි",
                    "සවැදෑරුම් බරපතල පාපයන් (ආනන්තර්ය කර්ම පසත් මිථ්‍යාදෘෂ්ටියත්)"
                ],
                [
                    "අහබ්බෝ",
                    "නුසුදුසු ය"
                ],
                [
                    "කාතුං",
                    "කරන්නට"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "කිඤ්චාපි",
                    "කිසියම්"
                ],
                [
                    "සො",
                    "ඒ සෝවාන් පුද්ගල තෙමේ"
                ],
                [
                    "කම්මං කරොති පාපකං",
                    "පාප කර්මයක් කෙරේ ද"
                ],
                [
                    "කායෙන",
                    "කයින් හෝ"
                ],
                [
                    "වාචා",
                    "වචනයෙන් හෝ"
                ],
                [
                    "උද",
                    "නොහොත්"
                ],
                [
                    "චෙතසා වා",
                    "සිතින් හෝ"
                ]
            ],
            [
                [
                    "අභබ්බො",
                    "අභව්‍ය ය"
                ],
                [
                    "සො",
                    "හෙතෙම"
                ],
                [
                    "තස්ස",
                    "ඒ පාපකර්මයා ගේ"
                ],
                [
                    "පටිච්ඡාදාය",
                    "සැඟවීමට"
                ],
                [
                    "අභබ්බතා",
                    "වරද සැඟවීමෙහි අභව්‍ය බව"
                ],
                [
                    "දිට්ඨපාදස්ස",
                    "දක්නා ලද නිවන් පද ඇති සෝවාන් පුද්ගලයා ගේ"
                ],
                [
                    "වුත්තා",
                    "බුදුරදුන් වද‍ාරන ලදී"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "වනප්පගුම්බෙ",
                    "වනලැහැබතෙම"
                ],
                [
                    "යථා ඵුස්සිතග්ගෙ",
                    "සුපිපි අක් ඇත්තේ යම්සේ ද"
                ],
                [
                    "ගිම්හාන මාසෙ පඨමස්‌මිං",
                    "පළමු ශ්‍රීෂ්ම මාසයෙහි"
                ],
                [
                    "ගිම්හෙ",
                    "ශ්‍රීෂ්ම සෘතුවෙහි"
                ]
            ],
            [
                [
                    "තථා උපමං",
                    "එබඳු වූ"
                ],
                [
                    "ධම්‌මවරං",
                    "උතුම් වූ ධර්මය"
                ],
                [
                    "අදෙසයි",
                    "(බුදුරජාණන්වහන්සේ) දෙසූ සේක."
                ],
                [
                    "නිබ්බාණගාමී",
                    "නිවනට පමුණුවන"
                ],
                [
                    "පරමං හිතාය",
                    "නිවන් පිණිස"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "බුද්ධෙ",
                    "බුදුරදුන් කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "වරො",
                    "උතුම් වූ"
                ],
                [
                    "වරඤ්ඤු",
                    "නිවන්දන්නා වූ"
                ],
                [
                    "වරද‍ො",
                    "උතුම් නිවන් දෙන්නා වූ"
                ],
                [
                    "වරාහරො",
                    "උතුම් නිවන් මග ගෙනහැර පාන්නා වූ"
                ],
                [
                    "අනුන්තරො",
                    "නිරුත්තර වූ බුදුරජතෙම"
                ],
                [
                    "ධම්මවරං",
                    "උතුම් දහමක්"
                ],
                [
                    "අදෙසයි",
                    "දෙසී ද"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "බුද්ධෙ",
                    "බුදුරදුන් කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "(ප්‍රණීත) උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "ඛීණං",
                    "ක්ෂණවූයේ ද"
                ],
                [
                    "පුරාණං",
                    "පුරාතන කර්ම (යම් රහත් කෙනකුගේ)"
                ],
                [
                    "නවං නත්ථි සම්භවං",
                    "අලුත් භවයක් නැත්තේ ද"
                ],
                [
                    "විරත්ත චිත්තා",
                    "නොඇලුණු සිත් ඇති"
                ],
                [
                    "ආයතිකෙහවස්මිං",
                    "මතුභවයක් කෙරෙහි"
                ]
            ],
            [
                [
                    "තෙ",
                    "ඒ රහත්හු"
                ],
                [
                    "බීණ බීජා",
                    "ක්ෂීණ වූ ප්‍රතිසන්ධී විඥ‍ාන සංඛ්‍යාත බීජ ඇති"
                ],
                [
                    "අවිරූළ්හීච්ඡන්ද‍ා",
                    "පුනරුත්පත්තියෙහි ආශාවක් නැති"
                ],
                [
                    "නිබ්බන්ති",
                    "(නිවෙත්) පිරිනිවෙත්"
                ],
                [
                    "ධීරා",
                    "ධෛර්යසම්පන්න වූ"
                ],
                [
                    "යථා අයං පදීපො",
                    "මේ පහන මෙන්"
                ]
            ],
            [
                [
                    "ඉදම්පි",
                    "මේ කරුණින් ද"
                ],
                [
                    "සංඝෙ",
                    "සංඝයා කෙරෙහි"
                ],
                [
                    "රතනං",
                    "රත්න භාවය වේ"
                ],
                [
                    "පණීතං",
                    "උතුම්."
                ],
                [
                    "එතෙන සච්චේන",
                    "මේ සත්‍ය බලයෙන්"
                ],
                [
                    "සුවත්ථි හොතු",
                    "සෙත් වේවා."
                ]
            ],
            [
                [
                    "යානී ඉධ භූතානි",
                    "යම් මෙතැන්හි අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "සමාගතානි",
                    "රැස්වූ"
                ],
                [
                    "භුම්මානි වා",
                    "පොළොවෙහි වූ හෝ"
                ],
                [
                    "යානි ව",
                    "යම් අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "අන්තලික්ඛෙ",
                    "අහසෙහි වූ ද"
                ]
            ],
            [
                [
                    "තථාගතං",
                    "තථාගත නම් වූ"
                ],
                [
                    "දෙවමනුස්ස පූජිතං",
                    "දෙව්මිනිසුන් විසින් පුදනලද"
                ],
                [
                    "බුද්ධං",
                    "බුදුරදුන්"
                ],
                [
                    "නමස්සාම",
                    "(අපි හැම දෙනා ම) නමදිමු"
                ],
                [
                    "සුවත්ථි හොතු",
                    "(සත්හට) සෙත් වේවා."
                ]
            ],
            [
                [
                    "යානී ඉධ භූතානි",
                    "යම් මෙතැන්හි අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "සමාගතානි",
                    "රැස්වූ"
                ],
                [
                    "භුම්මානි වා",
                    "පොළොවෙහි වූ හෝ"
                ],
                [
                    "යානි ව",
                    "යම් අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "අන්තලික්ඛෙ",
                    "අහසෙහි වූ ද"
                ]
            ],
            [
                [
                    "තථාගතං",
                    "තථාගත නම් වූ"
                ],
                [
                    "දෙවමනුස්ස පූජිතං",
                    "දෙව්මිනිසුන් විසින් පුදනලද"
                ],
                [
                    "ධම්මං",
                    "ධර්මය"
                ],
                [
                    "නමස්සාම",
                    "(අපි හැම දෙනා ම) නමදිමු"
                ],
                [
                    "සුවත්ථි හොතු",
                    "(සත්හට) සෙත් වේවා."
                ]
            ],
            [
                [
                    "යානී ඉධ භූතානි",
                    "යම් මෙතැන්හි අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "සමාගතානි",
                    "රැස්වූ"
                ],
                [
                    "භුම්මානි වා",
                    "පොළොවෙහි වූ හෝ"
                ],
                [
                    "යානි ව",
                    "යම් අමනුෂ්‍ය කෙනෙක් ඇද්ද"
                ],
                [
                    "අන්තලික්ඛෙ",
                    "අහසෙහි වූ ද"
                ]
            ],
            [
                [
                    "තථාගතං",
                    "තථාගත නම් වූ"
                ],
                [
                    "දෙවමනුස්ස පූජිතං",
                    "දෙව්මිනිසුන් විසින් පුදනලද"
                ],
                [
                    "සංඝං",
                    "සංඝයා"
                ],
                [
                    "නමස්සාම",
                    "(අපි හැම දෙනා ම) නමදිමු"
                ],
                [
                    "සුවත්ථි හොතු",
                    "(සත්හට) සෙත් වේවා."
                ]
            ]
        ]
    },
    "10-karaniya": {
        "labels": [
            [
                0,
                2.5,
                0
            ],
            [
                3.113279,
                13.740708,
                2
            ],
            [
                14.221152,
                25.040758,
                4
            ],
            [
                25.694163,
                36.340809,
                6
            ],
            [
                36.93656,
                48.255828,
                8
            ],
            [
                48.890015,
                60.074759,
                10
            ],
            [
                60.612857,
                72.508658,
                12
            ],
            [
                73.162063,
                85.326913,
                14
            ],
            [
                85.865011,
                96.953666,
                16
            ],
            [
                97.510981,
                108.868685,
                18
            ],
            [
                109.406783,
                121.398673,
                20
            ],
            [
                121.955989,
                133.313693,
                22
            ],
            [
                133.736484,
                145.190276,
                24
            ],
            [
                145.786027,
                157.182167,
                26
            ],
            [
                157.681829,
                168.80892,
                28
            ],
            [
                169.270146,
                180.070535,
                30
            ],
            [
                180.570197,
                191.697288,
                32
            ],
            [
                192.754265,
                204.861462,
                34
            ],
            [
                205.39956,
                216.565086,
                36
            ],
            [
                217.122401,
                226.981119,
                38
            ],
            [
                227.519217,
                240.625738,
                40
            ]
        ],
        "text": [
            [
                [
                    "කරණීය මෙත්ත සුත්තං",
                    "කරණීය මෙත්ත සූත්‍රය."
                ]
            ],
            [
                [
                    "කරණීයං",
                    "යමක් කටයුතු ද"
                ],
                [
                    "අත්ථකුසලෙන",
                    "අභිවෘද්ධියෙහි දක්ෂයා විසින්"
                ],
                [
                    "යං  තං",
                    "එය කටයුතු යි"
                ],
                [
                    "සන්තං පදං",
                    "ශාන්ත පදය යි කියනු ලබන නිවනට"
                ],
                [
                    "අභිසමෙච්ච",
                    "පැමිණ වසන්නහු විසින්"
                ]
            ],
            [
                [
                    "සක්කො",
                    "දක්ෂයෙක් ද"
                ],
                [
                    "උජු ච",
                    "ඍජු ද"
                ],
                [
                    "සූ උජු ච",
                    "මනාකොට සෘජු ද"
                ],
                [
                    "සුවචො අස්ස",
                    "කීකරු වන්නේ ය (හෙතෙම)"
                ],
                [
                    "මුදු",
                    "මෘදු වන්නේ ය"
                ],
                [
                    "අනතිමානි",
                    "නිහතමානී වන්නේ ය."
                ]
            ],
            [
                [
                    "සන්තුස්සකො ච",
                    "ලද දෙයින් සතුටු වන්නේ ය"
                ],
                [
                    "සුභරො ච",
                    "පහසුවෙන් පෝෂණය කළ හැක්කේ ය"
                ],
                [
                    "අප්ප කිච්චො ච",
                    "ස්වල්ප කටයුතු ඇත්තෙක් වන්නේ ය"
                ],
                [
                    "සල්ලහුක වුත්ති",
                    "සැහැල්ලු පැවතුම් ඇත්තෙක් වන්නේ ය"
                ]
            ],
            [
                [
                    "සන්තින්ද්‍රියො ච",
                    "සන්සුන් ඉඳුරන් ඇත්තෙක් වන්නේ ය"
                ],
                [
                    "නිපකො ච",
                    "නුවණ ඇත්තෙක් වන්නේ ය"
                ],
                [
                    "අප්ප ගබ්භො",
                    "ප්‍රගල්භය (හැඩි දැඩි අසංවර ගති) නැති වන්නේ ය"
                ],
                [
                    "කුලෙසූ අනනුගිද්ධෝ",
                    "කුලයන් කෙරෙහි නො ඇලුනෙක් වන්නේ ය."
                ]
            ],
            [
                [
                    "නච ඛුද්දං සමාචරෙ",
                    "ස්වල්ප වූ වරදකුදු නො කරන්නේ ය"
                ],
                [
                    "කිඤ්චි යෙන",
                    "යම් බඳු ක්‍රියාවකින්"
                ],
                [
                    "විඤ්ඤුපරෙ",
                    "නුවණැති අන් කෙනෙක්"
                ],
                [
                    "උපවදෙය්‍යුං",
                    "නින්ද‍ා කෙරෙත් ද"
                ]
            ],
            [
                [
                    "සුඛිනො වා",
                    "සැප ඇත්තෝ වෙත්වා"
                ],
                [
                    "ඛෙමිනො හොන්තු",
                    "භය තැත්තෝ වෙත්වා"
                ],
                [
                    "සබ්බෙ සත්තා",
                    "සියලු සත්වයෝ"
                ],
                [
                    "භවන්තු සුඛිතත්තා",
                    "සුඛිත සිත් ඇත්තෝ වෙත්වා"
                ]
            ],
            [
                [
                    "යෙ කෙචි",
                    "යම්කිසි"
                ],
                [
                    "පාණභූතා අත්ථි",
                    "සත්ව කෙනෙක් වෙත් ද"
                ],
                [
                    "තසා වා",
                    "(කෙලෙස් සහිත බැවින්) භයින් ත්‍රස්ත වූ හෝ"
                ],
                [
                    "ථාවරා වා",
                    "නිර්භය හෙයින් ස්ථාවර වූ"
                ],
                [
                    "අනවසෙසා",
                    "සියලු (ඉතිරිනොවූ)"
                ]
            ],
            [
                [
                    "දීඝා වා",
                    "දීර්ඝ ජාති ඇත්තාහු ද"
                ],
                [
                    "යෙ",
                    "යම් සත්ව කෙනෙක්"
                ],
                [
                    "මහන්තා වා",
                    "මහත් සිරුරු ඇත්තාහු ද"
                ],
                [
                    "මජ්ඣිමා",
                    "මධ්‍යම ප්‍රමාණ සිරුරු ඇත්තෝ ද"
                ],
                [
                    "රස්සකා",
                    "මිටි සිරුරු ඇත්තෝ ද"
                ],
                [
                    "අණුක",
                    "ඉතා සියුම් සිරුරු ඇත්තෝ ද"
                ],
                [
                    "ඵූලා",
                    "ස්ථූල සිරුරු ඇත්තේ ද"
                ]
            ],
            [
                [
                    "දිට්ඨා වා",
                    "ඇසට පෙනෙන්නා වූ හෝ"
                ],
                [
                    "යෙව අද්දිට්ඨා",
                    "නොපෙනෙන්නා වූ යම් සත්ව කෙනෙක් වෙත් ද"
                ],
                [
                    "යෙච දූරෙ වසන්ති",
                    "යම් සත්ව කෙනෙක් දුර වෙසෙත් ද"
                ],
                [
                    "අවිදූරෙ",
                    "නුදුරෙහි වෙසෙත් ද"
                ]
            ],
            [
                [
                    "භූතා වා",
                    "ඉපදීම අවසන් කළ සත්වයෝ වෙත් ද"
                ],
                [
                    "සම්භවෙසී වා",
                    "ඉපදීම සොයන සත්වයෝ ද (යන)"
                ],
                [
                    "සබ්බෙ සත්තා",
                    "සියලු සත්වයෝ"
                ],
                [
                    "භවන්තු",
                    "වෙත්වා"
                ],
                [
                    "සුඛිතත්තා",
                    "සුඛිත සිත් ඇත්තෝ"
                ]
            ],
            [
                [
                    "න",
                    "නොම"
                ],
                [
                    "පරො",
                    "අනිකෙක්"
                ],
                [
                    "පරං",
                    "අනිකකු"
                ],
                [
                    "නිකුබ්බේථ",
                    "රවටන්නේ ය"
                ],
                [
                    "න අතිමඤ්ඤෙථ",
                    "අවමන් නො කරන්නේ ය ‍"
                ],
                [
                    "කත්ථචි",
                    "කිසි තැනෙක්හි"
                ],
                [
                    "නං කඤ්‌චි",
                    "ඒ කිසිවක් හට."
                ]
            ],
            [
                [
                    "ඛ්‍යාරොසනා",
                    "කාය වාක් විකාරයෙන් වූ කෝපයෙන් ද"
                ],
                [
                    "පටිඝසඤඤ‍ා",
                    "(මනෝ විකාරයෙන් වූ) පටිඝ සංඥ‍ායෙන් ද"
                ],
                [
                    "න",
                    "නොම"
                ],
                [
                    "අඤ්ඤං අඤ්ඤස්ස",
                    "එකෙක් අනෙකකුට"
                ],
                [
                    "දුක්ඛං",
                    "දුකක්"
                ],
                [
                    "ඉච්ඡෙය්‍ය",
                    "කැමති වන්නේ ය."
                ]
            ],
            [
                [
                    "මාතා",
                    "මවක්"
                ],
                [
                    "යථා",
                    "යම්සේ"
                ],
                [
                    "නියං පුත්තං",
                    "තමාගෙන් ඇති වූ"
                ],
                [
                    "ආයුසා",
                    "දිවි පිදීමෙන් හෝ"
                ],
                [
                    "එක පුත්තං",
                    "එකම පුතු"
                ],
                [
                    "අනුරක්ඛෙ",
                    "රකී ද?"
                ]
            ],
            [
                [
                    "එවම්පි",
                    "මෙසේ ද"
                ],
                [
                    "සබ්බ භුතෙසු",
                    "හැම සතුන් කෙරෙහි"
                ],
                [
                    "මානසං",
                    "මෛත්‍රී සිත"
                ],
                [
                    "භාවයෙ",
                    "වඩන්නේ ය"
                ],
                [
                    "අපරිමාණං",
                    "අප්‍රමාණ වූ"
                ]
            ],
            [
                [
                    "මෙත්තං ච",
                    "මෛත්‍රී සහගත ව"
                ],
                [
                    "සබ්බ ලොකස්මිං",
                    "සියලු සත්වයන් කෙරෙහි"
                ],
                [
                    "මානසං භාවයෙ",
                    "සිත වඩන්නේ ය"
                ],
                [
                    "අපරිමාණං",
                    "අප්‍රමාණ වූ"
                ]
            ],
            [
                [
                    "උද්ධං ච",
                    "උඩ ද"
                ],
                [
                    "අධො ච",
                    "යට ද"
                ],
                [
                    "තිරියඤ් ච",
                    "සරස (හරස්ව) ද"
                ],
                [
                    "අසම්බාධං",
                    "සම්බාධ නැතිව"
                ],
                [
                    "අවෙරං",
                    "වෛර නැතිව"
                ],
                [
                    "අසපත්තං",
                    "සතුරන් නැති"
                ]
            ],
            [
                [
                    "තිට්ඨං",
                    "සිටින්නේ හෝ"
                ],
                [
                    "චරං",
                    "ඇවිදින්නේ හෝ"
                ],
                [
                    "නිසින්නො වා",
                    "උන්නේ හෝ"
                ],
                [
                    "සයානො වා",
                    "නිදන්නේ හෝ"
                ],
                [
                    "යාවතස්ස විගතමිධො",
                    "යම්තාක් කල් නොනිද‍ා ද (ඒතාක්)"
                ]
            ],
            [
                [
                    "එතං සතිං",
                    "මේ මෛත්‍රී සහගත සිහිය"
                ],
                [
                    "අධිට්ඨෙය්‍ය",
                    "ඉටන්නේ ය"
                ],
                [
                    "බ්‍රහ්ම එතං විහාරං",
                    "මෙය බ්‍රහ්ම විහාරය (ශ්‍රේෂ්ඨ වාසය කිරීම) යි"
                ],
                [
                    "ඉධ",
                    "මේ ශාසනයෙහි"
                ],
                [
                    "ආහු",
                    "(බුද්ධාදී උතුමෝ) කීහ."
                ]
            ],
            [
                [
                    "දිට්ඨිඤ් ච",
                    "මීත්‍යාදෘෂ්ටියට"
                ],
                [
                    "අනුපගම්ම",
                    "නො පැමිණ"
                ],
                [
                    "සීලවා",
                    "සිල්වත් වූයේ"
                ],
                [
                    "දස්සනෙන සම්පන්නෝ",
                    "දර්ශනයෙන් යුක්ත වූයේ"
                ]
            ],
            [
                [
                    "කාමෙසූ",
                    "වස්තුකාමයන්හි"
                ],
                [
                    "විනෙය්‍ය ගෙධං",
                    "ගිජු බව දුරු කොට"
                ],
                [
                    "නහි ජාතු",
                    "ඒකාන්තයෙන් නො එන්නේ යි"
                ],
                [
                    "ගබ්භසෙය්‍යං",
                    "මවු කුස පිළිසිඳ ගැනීමට"
                ],
                [
                    "පුනරෙති ති",
                    "නැවත"
                ]
            ]
        ]
    },
    "11-khandha-parittam": {
        "labels": [
            [
                0,
                2.428625
            ],
            [
                2.428625,
                23.908465
            ],
            [
                23.908465,
                42.312046
            ],
            [
                42.312046,
                67.515778
            ],
            [
                67.515778,
                81.493865
            ],
            [
                81.493865,
                95.63386
            ],
            [
                95.63386,
                112.094541
            ],
            [
                112.094541,
                140.212623
            ],
            [
                140.212623,
                175.022916
            ],
            [
                175.022916,
                194.451917
            ],
            [
                194.451917,
                224.728776
            ],
            [
                224.728776,
                252.361133
            ],
            [
                252.361133,
                266.663037
            ],
            [
                266.663037,
                289.76196
            ],
            [
                289.76196,
                310.000502
            ],
            [
                310.000502,
                331.102556
            ],
            [
                331.102556,
                353.337968
            ],
            [
                353.337968,
                365.157277
            ],
            [
                365.157277,
                407.685201
            ]
        ],
        "text": [
            [
                [
                    "ඛන්ධ පරිත්තං",
                    "කඳ පිරිත"
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී."
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක්හි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවතෙහි"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "ආරාමෙහි"
                ]
            ],
            [
                [
                    "තෙන ඛො පන සමයෙන",
                    "එසමයෙහි"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත් නුවර"
                ],
                [
                    "අඤ්ඤතරො භික්ඛු",
                    "එක්තරා භික්ෂූ නමෙක්"
                ],
                [
                    "අහිනා දට්ඨො",
                    "සර්පයකු විසින් දෂ්ට කරන ලදුව"
                ],
                [
                    "කාලකතො හොති",
                    "කලුරිය කෙළේය."
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "එකල්හි"
                ],
                [
                    "සම්බහුලා භික්ඛු",
                    "බොහෝ භික්ෂූන් වහන්සේලා"
                ],
                [
                    "යෙන භගවා",
                    "භාග්‍යවතුන් වහන්සේ යම් තැනක ද"
                ],
                [
                    "තෙන",
                    "එතන්හි"
                ],
                [
                    "උපසංකමිංසු",
                    "එළඹුනාහු ය"
                ],
                [
                    "උපසංකමිත්වා",
                    "එළඹ"
                ],
                [
                    "භගවන්තං",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "අභිවාදෙත්වා",
                    "වැඳ"
                ],
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "නිසීදිංසු",
                    "හුන්නාහු ය"
                ]
            ],
            [
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "නිසින්නො ඛො",
                    "හුන්නා වූ"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ භික්ෂූහු"
                ],
                [
                    "භගවන්තං",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "එතදවොචුං",
                    "මේ පුවත ද‍ැන්වූහ."
                ]
            ],
            [
                [
                    "ඉධ",
                    "මෙම"
                ],
                [
                    "භන්තෙ",
                    "ස්වාමීන් වහන්ස"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත්නුවර සමීපයෙහි"
                ],
                [
                    "අඤ්ඤතරො භික්ඛු",
                    "එක්තරා භික්ෂු නමෙක්"
                ],
                [
                    "අහිනා දට්ඨො",
                    "සර්පයකු විසින් දෂ්ට කරන ලද්දේ"
                ],
                [
                    "කාල කතො' ති",
                    "කළුරිය කෙළේ ය."
                ]
            ],
            [
                [
                    "නහි",
                    "නොම"
                ],
                [
                    "නූන",
                    "ඒකාන්තයෙන්"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "චත්තාරි අහිරාජ කුලානි",
                    "සතර අභිරාජකුලය"
                ],
                [
                    "මෙත්තෙන චිත්තෙන",
                    "මෙත් සිතින්"
                ],
                [
                    "ඵරි",
                    "පැතිර වී ය"
                ]
            ],
            [
                [
                    "සචෙහි",
                    "ඉදින් වනාහි"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "චත්තාරි අහිරාජ කුලානි",
                    "සතර අහිරාජකුලයන්"
                ],
                [
                    "මෙත්තෙන චිත්තෙන",
                    "මෙත් සිතින්"
                ],
                [
                    "එරෙය්‍ය",
                    "පැතිරවී නම්"
                ],
                [
                    "නහි",
                    "නොම"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "අභිනා දට්ඨො",
                    "සර්පයා විසින් දෂ්ට කරන ලද්දේ"
                ],
                [
                    "කාලංකරෙය්‍ය",
                    "කලුරිය කරන්නේ ය."
                ]
            ],
            [
                [
                    "කතමානි",
                    "කවරහුද යත්?"
                ],
                [
                    "චත්තාරි අහිරාජකුලානි",
                    "සතර අභිරාජකුලයෝ."
                ],
                [
                    "විරූපක්ඛං අහිරාජකුලං",
                    "විරූපාක්ෂ නම් සර්ප රාජකුලය"
                ],
                [
                    "එරාපථං අහිරාජකුලං",
                    "ඒරාපථ නම් සර්ප රාජකුලය"
                ],
                [
                    "ඡඛ්‍යාපුත්තං අහිරාජකුලං",
                    "ඡඛ්‍යාපුත්ත නම් සර්ප රාජකුලය"
                ],
                [
                    "කණ්හා ගොතමකං අහිරාජකුලං",
                    "කණ්හා ගොතමක නම් සර්ප රාජකුලය (යන මේ සතරයි.)"
                ]
            ],
            [
                [
                    "නහි",
                    "නොම"
                ],
                [
                    "නූන",
                    "ඒකාන්තයෙන්"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "ඉමානි චත්තාරි අහිරාජ කුලානි",
                    "මේ සතර අභිරාජකුලය"
                ],
                [
                    "මෙත්තෙන චිත්තෙන",
                    "මෙත් සිතින්"
                ],
                [
                    "ඵරි",
                    "පැතිර වී ය."
                ]
            ],
            [
                [
                    "සචෙහි",
                    "ඉදින් වනාහි"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "ඉමානි චත්තාරි අහිරාජ කුලානි",
                    "මේ සතර අහිරාජකුලයන්"
                ],
                [
                    "මෙත්තෙන චිත්තෙන",
                    "මෙත් සිතින්"
                ],
                [
                    "එරෙය්‍ය",
                    "පැතිරවී නම්"
                ],
                [
                    "නහි",
                    "නොම"
                ],
                [
                    "සො",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භික්ඛු",
                    "භික්ෂු තෙම"
                ],
                [
                    "අභිනා දට්ඨො",
                    "සර්පයා විසින් දෂ්ට කරන ලද්දේ"
                ],
                [
                    "කාලංකරෙය්‍ය",
                    "කලුරිය කරන්නේ ය."
                ]
            ],
            [
                [
                    "අනුජානාමි",
                    "(අවසර දෙමි) අනුදනිමි"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "ඉමානි චත්තාරි අහිරාජකුලානි",
                    "මේ සතර සර්ප රාජකුලයන්"
                ],
                [
                    "මෙත්තේන චිත්තෙන",
                    "මෙත් සිතින්"
                ],
                [
                    "එරිතුං",
                    "පතුරු වන්නට (කුමක් හෙයින්ද යත්?)"
                ],
                [
                    "අත්ත ගුත්තියා",
                    "තමාගේ සංවරණය පිණිස"
                ],
                [
                    "අත්තරක්ඛාය",
                    "තමහට ආරක්ෂාව පිණිස"
                ],
                [
                    "අත්තපරිත්තායාති",
                    "තමාහට පිරිත් පිණිස පවත්නා හෙයිනි."
                ]
            ],
            [
                [
                    "ඉදං අවොච",
                    "මෙසේ වද‍ාළ සේක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ."
                ],
                [
                    "ඉදං වත්වා",
                    "මෙසේ වද‍ාරා"
                ],
                [
                    "සුගතො",
                    "සුගත නම් වූ"
                ],
                [
                    "අථාපරං",
                    "නැවත ද මත්තෙහි"
                ],
                [
                    "එතදවොච",
                    "මෙය වද‍ාළ සේක"
                ],
                [
                    "සත්ථා",
                    "ශාස්තෘෘන් වහන්සේ"
                ]
            ],
            [
                [
                    "විරූපක්ඛෙහි",
                    "විරූපාක්ෂ නම් සර්ප කුලයන් සමග ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රීය"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රිය"
                ],
                [
                    "ඵරාපථෙහි",
                    "ඒරාපථ නම් සර්ප රාජකුලයන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "ඡඛ්‍යාපුත්තෙහි",
                    "ඡඛ්‍යාපුත්ත නම් නාග කුලයන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ."
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රිය"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රීය"
                ],
                [
                    "කණ්භගොතමකෙහි ව",
                    "කණ්භාගොතමක නම් සර්ප කුලයන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ]
            ],
            [
                [
                    "අපාදකෙහි",
                    "පා නැති දීර්ඝ ජාතීන් සමග ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රීය"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රිය"
                ],
                [
                    "දීපාදකෙහි",
                    "(දෙපා ඇති මිනිස් ආදී) දීපාදකයන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "චතුප්පදෙහි",
                    "සිවුපා සතුන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ."
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රිය"
                ],
                [
                    "මෙත්තං",
                    "මෛත්‍රීය"
                ],
                [
                    "බහුප්පදෙහි",
                    "(පත්තෑ ආදී) බොහෝ පා ඇත්තවුන් සමඟ ය"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ]
            ],
            [
                [
                    "මා",
                    "නහමක් (නොම)"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "අපාදකො",
                    "අපාදක සත්වයෙක්"
                ],
                [
                    "හිංසි",
                    "පෙළාවා"
                ],
                [
                    "මා",
                    "නහමක් (නොම)"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "හිංසි",
                    "පෙළාවා"
                ],
                [
                    "දිපාදකො",
                    "දීපාදක සත්වයෙක්"
                ],
                [
                    "මා",
                    "නහමක් (නොම)"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "චතුස්පද‍ො",
                    "සිවුපා සත්වයෙක්"
                ],
                [
                    "හිංසි",
                    "පෙළාවා"
                ],
                [
                    "මා",
                    "නහමක් (නොම)"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "හිංසි",
                    "පෙළාවා"
                ],
                [
                    "බහුප්පද‍ො",
                    "බොහෝ පා ඇති සත්වයෙක්"
                ]
            ],
            [
                [
                    "සබෙ සත්තා",
                    "සියලු සත්හු ද"
                ],
                [
                    "සබ්බ පාණා",
                    "සියලු ප්‍රාණීහුද"
                ],
                [
                    "සබ්බෙ භුතා ච කෙවලා",
                    "හුදෙක් සියලු භූතයෝ ද"
                ],
                [
                    "සබ්බෙ",
                    "හැමදෙන"
                ],
                [
                    "භද්‍රානි",
                    "යහපතක්ම"
                ],
                [
                    "පස්සන්තු",
                    "දකිත්වා."
                ],
                [
                    "මා",
                    "නහමක් (නොම)"
                ],
                [
                    "කඤ්චි",
                    "කිසිවකුත් කරා"
                ],
                [
                    "පාපං",
                    "දුකෙක්"
                ],
                [
                    "ගමා",
                    "පැමිණේවා!"
                ]
            ],
            [
                [
                    "අප්පමාණො බුද්ධො",
                    "බුද්ධ ගුණය අපමණය"
                ],
                [
                    "අප්පමාණො ධම්මො",
                    "දහම් ගුණය අපමණය"
                ],
                [
                    "අප්පමාණො සංඝො",
                    "සංඝ ගුණය අපමණය"
                ]
            ],
            [
                [
                    "පමාණවන්තානි",
                    "ප්‍රමාණ කළ හැක"
                ],
                [
                    "සිරිංසපානි",
                    "සිරිංසපයෝ හෙවත් දීර්ඝ ජාතීහු (එනම්)"
                ],
                [
                    "අභි",
                    "සර්පයෝ ය"
                ],
                [
                    "විච්ඡිකා",
                    "ගෝනුස්සෝ ය"
                ],
                [
                    "සතපදී",
                    "සතපදීහු ය (පත්තෑ ආදීහු)"
                ],
                [
                    "උණ්ණානාභි",
                    "මකුළුවෝ ය"
                ],
                [
                    "සරබු",
                    "සිකනල්ලු ය"
                ],
                [
                    "මූසිකා",
                    "මූසිකය හ (යන මේ වශයෙනි)"
                ],
                [
                    "කතා මෙ රක්ඛා",
                    "මා විසින් ආරක්ෂා කරන ලද්ද‍ාහ"
                ],
                [
                    "කතා මෙ පරිත්තා",
                    "මා විසින් පිරිත් කරන ලද්ද‍ාහ"
                ],
                [
                    "පටික්කමන්තු",
                    "පහවෙත්වා"
                ],
                [
                    "භූතානි",
                    "භූතයෝ"
                ],
                [
                    "සො අහං",
                    "ඒ මම"
                ],
                [
                    "නමො",
                    "නමස්කාර කරමි"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "නමො",
                    "නමස්කාර කරමි"
                ],
                [
                    "සත්තන්නං සම්මා සම්බුද්ධානං",
                    "සත් සම්බුදුවරයන්ට වහන්සේ ලාට"
                ]
            ]
        ]
    },
    "12-mettanisamsa": {
        "labels": [
            [
                0.686303,
                3.088365
            ],
            [
                3.088365,
                23.986303
            ],
            [
                23.986303,
                47.801031
            ],
            [
                47.66377,
                91.278351
            ],
            [
                91.278351,
                115.745066
            ],
            [
                115.745066,
                155.859499
            ],
            [
                155.859499,
                195.596465
            ],
            [
                195.596465,
                210.798085
            ]
        ],
        "text": [
            [
                [
                    "මෙත්තානිසංස සුත්තං",
                    "මෙත්තානිසංස සූත්‍රය"
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී."
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත් නුවරැ"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "ආරාමයෙහි"
                ]
            ],
            [
                [
                    "තත්‍ර ඛො",
                    "එකල්හි වනාහි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවත්හු"
                ],
                [
                    "භික්ඛු",
                    "භික්‍ෂූන්"
                ],
                [
                    "ආමන්තෙසි",
                    "ඇමතූහ"
                ],
                [
                    "භික්ඛවො'ති",
                    "මහණෙනි කියා"
                ],
                [
                    "භදන්තෙ ඉති",
                    "වහන්සැ'යි"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ භික්ෂූහු"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "පච්චස්සොසුං",
                    "පිළිවදන් දුන්හ."
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "එතං අවොච",
                    "මෙය වද‍ාළ සේක."
                ]
            ],
            [
                [
                    "මෙත්තාය",
                    "මෛත්‍රී"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "චෙතොවිමුත්තියා",
                    "චේතෝ විමුක්තිය ගේ"
                ],
                [
                    "ආසෙවිතාය",
                    "ආදරයෙන් සෙවුනා ලද"
                ],
                [
                    "භාවිතාය",
                    "භාවිතා කරන ලද"
                ],
                [
                    "බහුලීකතාය",
                    "බහුල වශයෙන් වඩනා ලද"
                ],
                [
                    "යානීකතාය",
                    "යානාවක් මෙන් කරන ලද"
                ],
                [
                    "වත්ථුකතාය",
                    "වස්තුවක් මෙන් කරන ලද"
                ],
                [
                    "අනුට්ඨිතාය",
                    "එළඹ සිටියා වූ"
                ],
                [
                    "පරිචිතාය",
                    "පුරුදු කරන ලද"
                ],
                [
                    "සුසමාරද්ධාය",
                    "මොනවට පටන් ගන්නා ලද"
                ],
                [
                    "එකාදසානිසංසා",
                    "එකොළොස් අනුසස්හු"
                ],
                [
                    "පාටි කංඛා'ති",
                    "කැමැති විය යුත්තාහ."
                ],
                [
                    "කතමෙ එකාදස?",
                    "කවර එකොළොසෙක් ද යත්.-"
                ]
            ],
            [
                [
                    "1. සුඛංසුපති",
                    "සැපසේ නිදි යි"
                ],
                [
                    "2. සුඛං පටිබුජ්ඣති",
                    "සැපසේ පුබුදි යි"
                ],
                [
                    "3. පාපකං සුපිනං න පස්සති",
                    "නපුරු සීන නොදකි යි"
                ],
                [
                    "4. මනුස්සානං පියො හොති",
                    "මිනිසුන්ට ප්‍රිය වෙයි"
                ],
                [
                    "5. අමනුස්සානං පියො හොති",
                    "නොමිනිසුන්ට ද ප්‍රිය වෙ යි"
                ]
            ],
            [
                [
                    "6. දෙවතා රක්ඛන්ති",
                    "දෙවියෝ රකිති"
                ],
                [
                    "7. නාස්ස",
                    "නොම ඔහුගේ ගේ සිරුරෙහි"
                ],
                [
                    "අග්ගි වා",
                    "ගිනි හෝ"
                ],
                [
                    "විසං වා",
                    "විස හෝ"
                ],
                [
                    "සත්ථං වා",
                    "සැත් හෝ"
                ],
                [
                    "ඛමති",
                    "වදි යි"
                ],
                [
                    "8. තුවටං",
                    "වහා"
                ],
                [
                    "චිත්තං",
                    "සිත"
                ],
                [
                    "සමාධියති",
                    "සමාහිත වෙයි"
                ],
                [
                    "9. මුඛවණ්ණො විප්පසීදති",
                    "මුහුණ පැහැපත් වෙයි"
                ],
                [
                    "10. අසම්මූල්හො",
                    "නො මුළාව"
                ],
                [
                    "කාළංකරොති",
                    "කලුරිය කෙරෙයි"
                ],
                [
                    "11. උත්තරීං අප්පටි විජ්ඣන්තො",
                    "මතුයෙහි රහත් වීමට නො හැකි වී නම්"
                ],
                [
                    "බ්‍රහ්මලොකුපගොහොති",
                    "බඹ ලොව උපදී."
                ]
            ],
            [
                [
                    "මෙත්තාය",
                    "මෛත්‍රී"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "චෙතොවිමුත්තියා",
                    "චේතෝ විමුක්තිය ගේ"
                ],
                [
                    "ආසෙවිතාය",
                    "ආදරයෙන් සෙවුනා ලද"
                ],
                [
                    "භාවිතාය",
                    "භාවිතා කරන ලද"
                ],
                [
                    "බහුලීකතාය",
                    "බහුල වශයෙන් වඩනා ලද"
                ],
                [
                    "යානීකතාය",
                    "යානාවක් මෙන් කරන ලද"
                ],
                [
                    "වත්ථුකතාය",
                    "වස්තුවක් මෙන් කරන ලද"
                ],
                [
                    "අනුට්ඨිතාය",
                    "එළඹ සිටියා වූ"
                ],
                [
                    "පරිචිතාය",
                    "පුරුදු කරන ලද"
                ],
                [
                    "සුසමාරද්ධාය",
                    "මොනවට පටන් ගන්නා ලද"
                ],
                [
                    "ඉමෙ එකාදසානිසංසා",
                    "මේ එකොළොස් අනුසස්හු"
                ],
                [
                    "පාටිකංඛා'ති",
                    "කැමැති විය යුත්තාහ."
                ]
            ],
            [
                [
                    "ඉදං අවොච",
                    "මෙම සූත්‍රය වද‍ාළ සේක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "අත්ත මනා",
                    "සතුටු සිත් ඇති"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ භික්ෂූහු"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවත්හු ගේ"
                ],
                [
                    "භාසිතං",
                    "භාෂිතයට (දේශනාවට)"
                ],
                [
                    "අභිනන්දුංති",
                    "සතුටු වූහ."
                ]
            ]
        ]
    },
    "13-mittanisamsa": {
        "labels": [
            [
                0.167284,
                2.776911
            ],
            [
                2.776911,
                23.386278
            ],
            [
                23.386278,
                43.560707
            ],
            [
                43.560707,
                64.772295
            ],
            [
                64.772295,
                85.314749
            ],
            [
                85.314749,
                105.288437
            ],
            [
                105.288437,
                125.295582
            ],
            [
                125.295582,
                144.432851
            ],
            [
                144.432851,
                165.309872
            ],
            [
                165.309872,
                184.614425
            ],
            [
                184.614425,
                205.190335
            ]
        ],
        "text": [
            [
                [
                    "මිත්තානිසංසං සුත්තං",
                    "මිත්තානිසංසය සූත්‍රය"
                ]
            ],
            [
                [
                    "පහූතභක්ඛො",
                    "බොහෝ කනු, බොනු ලැබීම"
                ],
                [
                    "භවති",
                    "වෙයි, සිදුවෙයි"
                ],
                [
                    "විප්පවුත්ථො",
                    "බැහැර තැනක ගියේ"
                ],
                [
                    "සකාඝරා",
                    "ස්වකීය ගෙයින්"
                ],
                [
                    "බහු",
                    "බොහෝ දෙනෙක්"
                ],
                [
                    "නං",
                    "ඒ මිතුරා ඇසුරු කොට"
                ],
                [
                    "උපජීවන්ති",
                    "ජීවත්වෙති."
                ],
                [
                    "යො",
                    "යම්පුද්ගලයෙක් තෙම"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන්ට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො කෙරේ ද (හෙතෙම)"
                ]
            ],
            [
                [
                    "යංයං ජනපදං යාතී",
                    "යම් යම් ජනපදයකට ගියේ ද"
                ],
                [
                    "නිගමෙ",
                    "නියම් ගමකට"
                ],
                [
                    "රාජධානියො",
                    "රාජධානියකට ගියේ ද"
                ],
                [
                    "සබ්බත්ථ",
                    "ඒ හැම තන්හි ම"
                ],
                [
                    "පූජිතොහොති",
                    "පුදනු ලැබෙයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො කෙරේ ද (හෙතෙම)"
                ]
            ],
            [
                [
                    "න",
                    "නොම"
                ],
                [
                    "අස්ස",
                    "ඔහුට"
                ],
                [
                    "චොරා",
                    "සොරු"
                ],
                [
                    "පස්හන්ති",
                    "ළං වෙත්"
                ],
                [
                    "න අතිමඤ්ඤෙති",
                    "අවමන් නො කෙරෙයි"
                ],
                [
                    "ඛත්තියො",
                    "රජතෙම"
                ],
                [
                    "සබ්බෙ අමිත්තෙ",
                    "හැම සතුරන්"
                ],
                [
                    "තරති",
                    "දුරු කෙරෙයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නොවේ ද (හෙතෙම)"
                ]
            ],
            [
                [
                    "අක්කුද්ධො",
                    "නොද‍ැහැවියේ (කෝප නොවී)"
                ],
                [
                    "සඝරං",
                    "සියගෙට"
                ],
                [
                    "එති",
                    "එයි"
                ],
                [
                    "සභාය",
                    "සභාවෙහි"
                ],
                [
                    "පටිනන්දිතො",
                    "සතුටු වූයේ"
                ],
                [
                    "ඤ‍ාතීනං",
                    "ඤ‍ාතීන් හට"
                ],
                [
                    "උත්තමො හොති",
                    "උතුම් වෙයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො වේද (හෙතෙම)"
                ]
            ],
            [
                [
                    "සක්කත්වා",
                    "අනුන්ට සත්කාර කොට"
                ],
                [
                    "සක්කතො හොති",
                    "සත්කාර ලබන්නෙක් වෙයි"
                ],
                [
                    "ගරු හොති",
                    "තෙමේ ද ගරු කටයුතු වෙයි"
                ],
                [
                    "සගාරවො",
                    "අනුන් කෙරෙහි ගෞරව සහිත වූයේ"
                ],
                [
                    "වණ්ණ කිත්ති භතො හොති",
                    "වර්ණකීර්ති දෙක උසුලන්නේ ය"
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තාන",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො වේද (හෙතෙම)"
                ]
            ],
            [
                [
                    "පූජකො",
                    "මිත්‍රයන් පුදන තැනැත්තේ"
                ],
                [
                    "ලභතෙ පූජං",
                    "තෙමේ ද පුද ලබයි"
                ],
                [
                    "වන්දකො",
                    "බුද්ධාදි කලණ මිතුරන් වැන්දේ"
                ],
                [
                    "පටිවන්දනං",
                    "තෙමේ ද පෙරළා වැඳුම් ලබයි"
                ],
                [
                    "යසො",
                    "යසසට ද"
                ],
                [
                    "කිත්තිං ච",
                    "කීර්තියට ද"
                ],
                [
                    "පප්පොති",
                    "පැමිණෙයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නොවේද (හෙතෙම)"
                ]
            ],
            [
                [
                    "අග්ගි යථා",
                    "දිලිසෙන ගිනි සෙයින්"
                ],
                [
                    "පජ්ජලති",
                    "ඉසුරෙන් දිලිසෙයි"
                ],
                [
                    "දෙවතා ව",
                    "දෙවියකු මෙන්"
                ],
                [
                    "විරොචති",
                    "බබලයි"
                ],
                [
                    "සිරියා",
                    "ශ්‍රීය විසින්"
                ],
                [
                    "අජහිතො",
                    "හොති අත් නොහරන ලද්දේ වෙයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහි නොවේ ද (හෙතෙම)"
                ]
            ],
            [
                [
                    "ගාවො",
                    "ගෙරිහූ"
                ],
                [
                    "තස්ස",
                    "ඕහට"
                ],
                [
                    "පජායන්ති",
                    "පලදෙති"
                ],
                [
                    "ඛෙත්තෙ",
                    "ක්ෂේත්‍රයෙහි"
                ],
                [
                    "වුත්තං",
                    "වපුළතාක්"
                ],
                [
                    "විරූහති",
                    "පැල හටගනී"
                ],
                [
                    "පුත්තානං ඵලමස්නාති",
                    "දරු සැප වළඳයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහි නොවේ ද (හෙතෙම)"
                ]
            ],
            [
                [
                    "දරිතො",
                    "ද‍ැදුරෙන් (පර්වත විවරයෙන්) හෝ"
                ],
                [
                    "පබ්බතො වා",
                    "පර්වතයෙන් හෝ"
                ],
                [
                    "රුක්ඛාතො",
                    "රුකින් (ගසකින්) හෝ"
                ],
                [
                    "පතිතො",
                    "වැටුණා වූ"
                ],
                [
                    "නරො",
                    "සත්වතෙම"
                ],
                [
                    "වූතො",
                    "යමකින් ගිලිහුණා වූ"
                ],
                [
                    "පතිට්ඨං ලභති",
                    "පිහිට ලබයි."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො කෙරේද (හෙතෙම)"
                ]
            ],
            [
                [
                    "විරුළ්හමූල සන්තානාං",
                    "වැඩුණු මුල් හා නුග අරළු ඇති"
                ],
                [
                    "නිග්‍රොධං",
                    "නුගරුකක්"
                ],
                [
                    "ඉව මාලුතො",
                    "(සොලවා එලන්ට නො හැකි) සුළඟ සෙයින්"
                ],
                [
                    "අමිත්තා",
                    "සතුරෝ:"
                ],
                [
                    "නප්පසහන්ති",
                    "ඔහු මැඩපවත්වන්නට නො හැකි වෙත්."
                ],
                [
                    "යො",
                    "යමෙක්"
                ],
                [
                    "මිත්තානං",
                    "මිතුරන් හට"
                ],
                [
                    "න දූභති",
                    "ද්‍රෝහ නො වේද (හෙතෙම)"
                ]
            ]
        ]
    },
    "14-mora-parittam": {
        "labels": [
            [
                0.281506,
                2.627393
            ],
            [
                2.627393,
                33.405428
            ],
            [
                33.405428,
                48.278351
            ],
            [
                48.278351,
                72.206396
            ],
            [
                72.206396,
                102.280665
            ],
            [
                102.280665,
                116.872081
            ],
            [
                116.872081,
                143.474437
            ]
        ],
        "text": [
            [
                [
                    "මොරපරිත්තං",
                    "මෝර පිරිත"
                ]
            ],
            [
                [
                    "උදෙති",
                    "නැගෙයි"
                ],
                [
                    "අයං",
                    "මේ හිරු තෙම"
                ],
                [
                    "චක්ඛුමා",
                    "ඇස් ඇති"
                ],
                [
                    "එකරාජා",
                    "ඒකරාජ වූ"
                ],
                [
                    "හරිස්සවණ්ණො",
                    "රන්වන් වූ"
                ],
                [
                    "පඨවිප්පභාසො",
                    "පොළොව බබුළුවන්නා වූ"
                ],
                [
                    "තං",
                    "එහෙයින්"
                ],
                [
                    "තං",
                    "තා"
                ],
                [
                    "නමස්සාමි",
                    "වඳිමි"
                ],
                [
                    "හරිස්සවණ්ණං",
                    "රන්වන් වූ"
                ],
                [
                    "පඨවිප්ප භාසං",
                    "පොළොව බබුළුවන"
                ],
                [
                    "තයා",
                    "තා විසින්"
                ],
                [
                    "අජ්ජ",
                    "අද"
                ],
                [
                    "ගුත්තා",
                    "රක්නා ලද"
                ],
                [
                    "විහරෙමු",
                    "අපි (සුවසේ) වසමු"
                ],
                [
                    "දිවසං",
                    "මේ දවස"
                ]
            ],
            [
                [
                    "යෙ බ්‍රහ්මණා",
                    "යම් ක්ෂීණාශ්‍රව බ්‍රාහ්මණ කෙනෙක්"
                ],
                [
                    "වෙදගු",
                    "සම්‍යක්සම්බෝධියට පැමිණියෝ ද"
                ],
                [
                    "සබ්බ ධම්මෙ",
                    "සියළු ඤෙය ධර්මයන් ද‍ැන"
                ],
                [
                    "තෙ",
                    "ඔවුන්ට"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "නමො",
                    "නමස්කාරය වේවා"
                ],
                [
                    "තෙ ච",
                    "ඒ භාග්‍යවත්හුදු"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "පාලයන්තු",
                    "රකිත්වා, පාලනය කරත්වා."
                ]
            ],
            [
                [
                    "නමො අත්ථු",
                    "නමස්කාරය වේවා"
                ],
                [
                    "බුද්ධානං",
                    "පෙර බුදුවරුනට"
                ],
                [
                    "නමො අත්ථු",
                    "නමස්කාර වේවා"
                ],
                [
                    "බොධියා",
                    "(සතර මග සතර ඵලයයි කියන ලද) බොධියට"
                ],
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "විමුත්තානං",
                    "කෙලෙසුන් කෙරෙන් මිදුනා වූ ඒ බුදුවරයන්ට"
                ],
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "විමුක්තියා",
                    "(තදංගවිමුක්ති ආදී) පඤ්ච විමුක්තියට"
                ],
                [
                    "ඉමං",
                    "මේ (පිරිත)"
                ],
                [
                    "සො",
                    "ඒ තෙම (මොනරා)"
                ],
                [
                    "පරිත්තං කත්වා",
                    "පිරිත (ආරක්ෂා) කොටගෙන"
                ],
                [
                    "මොරො",
                    "මයුරා (මොනරා)"
                ],
                [
                    "චරති",
                    "හැසිරෙයි."
                ],
                [
                    "එසනා",
                    "අහර සෙවීමෙහි"
                ]
            ],
            [
                [
                    "අපෙති",
                    "පහවෙයි"
                ],
                [
                    "අයං",
                    "මේ හිරු තෙම"
                ],
                [
                    "චක්ඛුමා",
                    "ඇස් ඇති"
                ],
                [
                    "එකරාජා",
                    "ඒකරාජ වූ"
                ],
                [
                    "හරිස්සවණ්ණො",
                    "රන්වන් වූ"
                ],
                [
                    "පඨවිප්පභාසො",
                    "පොළොව බබුළුවන්නා වූ"
                ],
                [
                    "තං",
                    "එහෙයින්"
                ],
                [
                    "තං",
                    "තා"
                ],
                [
                    "නමස්සා මි",
                    "වඳිමි"
                ],
                [
                    "හරිස්සවණ්ණං",
                    "රන්වන් වූ"
                ],
                [
                    "පඨවිප්ප භාසං",
                    "පොළොව බබුළුවන"
                ],
                [
                    "තයා",
                    "තා විසින්"
                ],
                [
                    "අජ්ජ",
                    "අද"
                ],
                [
                    "ගුත්තා",
                    "රක්නා ලද"
                ],
                [
                    "විහරෙමු",
                    "අපි (සුවසේ) වසමු"
                ],
                [
                    "රත්තිං",
                    "රැයෙහි"
                ]
            ],
            [
                [
                    "යෙ බ්‍රහ්මණා",
                    "යම් ක්ෂීණාශ්‍රව බ්‍රාහ්මණ කෙනෙක්"
                ],
                [
                    "වෙදගු",
                    "සම්‍යක්සම්බෝධියට පැමිණියෝ ද"
                ],
                [
                    "සබ්බ ධම්මෙ",
                    "සියළු ඤෙය ධර්මයන් ද‍ැන"
                ],
                [
                    "තෙ",
                    "ඔවුන්ට"
                ],
                [
                    "මෙ",
                    "මාගේ"
                ],
                [
                    "නමො",
                    "නමස්කාරය වේවා"
                ],
                [
                    "තෙ ච",
                    "ඒ භාග්‍යවත්හුදු"
                ],
                [
                    "මං",
                    "මා"
                ],
                [
                    "පාලයන්තු",
                    "රක්ෂා කෙරෙත්වා, පාලනය කරත්වා."
                ]
            ],
            [
                [
                    "නමො අත්ථු",
                    "නමස්කාරය වේවා"
                ],
                [
                    "බුද්ධානං",
                    "පෙර බුදුවරුනට"
                ],
                [
                    "නමො අත්ථු",
                    "නමස්කාර වේවා"
                ],
                [
                    "බොධියා",
                    "(සතර මග සතර ඵලයයි කියන ලද) බොධියට"
                ],
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "විමුත්තානං",
                    "කෙලෙසුන් කෙරෙන් මිදුනා වූ ඒ බුදුවරයන්ට"
                ],
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "විමුක්තියා",
                    "(තදංගවිමුක්ති ආදී) පඤ්ච විමුක්තියට"
                ],
                [
                    "ඉමං",
                    "මේ (පිරිත)"
                ],
                [
                    "සො",
                    "ඒ තෙම (මොනරා)"
                ],
                [
                    "පරිත්තං කත්වා",
                    "පිරිත (ආරක්ෂා) කොටගෙන"
                ],
                [
                    "මොරො",
                    "මයුරා (මොනරා)"
                ],
                [
                    "වාසං අකප්පයි",
                    "වාසය කෙළේ යි."
                ]
            ]
        ]
    },
    "15-canda-parittam": {
        "labels": [
            [
                0.465508,
                2.493793
            ],
            [
                2.493793,
                23.042651
            ],
            [
                23.042651,
                38.437669
            ],
            [
                38.437669,
                58.587519
            ],
            [
                58.587519,
                81.763173
            ],
            [
                81.763173,
                95.362659
            ],
            [
                95.362659,
                117.308041
            ],
            [
                117.308041,
                148.164578
            ],
            [
                148.164578,
                162.030069
            ],
            [
                162.030069,
                182.645428
            ],
            [
                182.645428,
                204.258304
            ]
        ],
        "text": [
            [
                [
                    "චන්දපරිත්තං",
                    "චන්ද පිරිත"
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී"
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත්නුවර සමීපයෙහි"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු මහ සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "ආරාමයෙහි"
                ]
            ],
            [
                [
                    "තෙත ඛො පන සමයෙන",
                    "එ සමයෙහි වනාහි"
                ],
                [
                    "චන්දිමා දෙවපුත්තො",
                    "සඳ දෙව්පුත් තෙමේ"
                ],
                [
                    "රාහුනා අසුරින්දෙන",
                    "රාහු අසුරේන්ද්‍රයා විසින්"
                ],
                [
                    "ගහිතො හොති",
                    "ගන්නා ලද්දේ වෙයි"
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "ඉක්බිති"
                ],
                [
                    "චන්දිමා දෙවපුත්තො",
                    "සඳ දෙව්පුත් තෙමේ"
                ],
                [
                    "භගවන්තං",
                    "බුදුරදුත්"
                ],
                [
                    "අනුස්සරමානො",
                    "සිහි කරමින්"
                ],
                [
                    "තායං වේලායං",
                    "එ වේලෙහි"
                ],
                [
                    "ඉමං ගාථං",
                    "මේ ගාථාව"
                ],
                [
                    "අභාසි",
                    "කීය."
                ]
            ],
            [
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "තෙ",
                    "නුඹ වහන්සේට"
                ],
                [
                    "බුද්ධවීර අත්ථු",
                    "බුද්ධවීරයන් වහන්ස"
                ],
                [
                    "විප්පමුත්තො අසි",
                    "කෙලෙසුන් කෙරෙන් විශේෂයෙන් මිදුණු"
                ],
                [
                    "සබ්බධි",
                    "සියලු කල්හි."
                ],
                [
                    "සම්බාධ පටිපන්නෝ අස්මි",
                    "(මම) සම්බාධයකට පැමිණියෙමි"
                ],
                [
                    "තස්ස මෙ",
                    "ඒ මට"
                ],
                [
                    "සරණං භව",
                    "පිළිසරණ වුව මැනව."
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "එකල්හි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "චන්දිමං දෙවපුත්තං",
                    "සඳ දෙව් පුතුන්"
                ],
                [
                    "ආරබ්හ",
                    "අරභයා"
                ],
                [
                    "රාහුං අසුරින්දං",
                    "රාහු අසුරිඳු හට"
                ],
                [
                    "ගාථාය",
                    "ගාථාවකින්"
                ],
                [
                    "අජ්ඣභාසි",
                    "මෙසේ වද‍ාළ සේක."
                ]
            ],
            [
                [
                    "තථාගතං",
                    "තථාගතයන් වහන්සේ"
                ],
                [
                    "අරහන්තං",
                    "අරහත් වූ"
                ],
                [
                    "චන්දිමා",
                    "සඳදෙව් පුත් තෙමේ"
                ],
                [
                    "සරණගතො",
                    "සරණ ගියේ ය"
                ],
                [
                    "රාහු",
                    "රාහු අසුරේන්ද්‍රය"
                ],
                [
                    "චන්දං පමුඤ්චස්සු",
                    "සඳු අතහැරව"
                ],
                [
                    "බුද්ධා",
                    "බුදුවරයෝ"
                ],
                [
                    "ලොකානුකම්පකා",
                    "ලොවට අනුකම්පා කරන්නෝ ය. (එහෙයින්)"
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "ඉක්බිති"
                ],
                [
                    "රාහු අසුරින්දෝ",
                    "රාහු අසුරේන්ද්‍ර තෙම"
                ],
                [
                    "චන්දිමං දෙවපුත්තං",
                    "සඳු දෙව්පුතු"
                ],
                [
                    "මුඤ්චිත්වා",
                    "හැර"
                ],
                [
                    "තරමාණ රූපො",
                    "වෙළෙවි වූයේ"
                ],
                [
                    "යෙන",
                    "යම් තැනක් හි වීද"
                ],
                [
                    "වෙපචිත්ති අසුරේන්ද‍ො",
                    "වේපචිත්ති අසුරේන්ද්‍රයා"
                ],
                [
                    "තෙන",
                    "එතැන්හි"
                ],
                [
                    "උපසංකමි",
                    "එළඹියේ ය"
                ],
                [
                    "උපසංකමිත්වා",
                    "එළඹ"
                ],
                [
                    "සංවිග්ගො",
                    "සංවේග ඇත්තේ"
                ],
                [
                    "ලොමහට්ඨජාතො",
                    "ලොමුද‍ැහැගත් සිරුරු ඇත්තේ"
                ],
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "අට්ඨාසි",
                    "සිටියේ ය"
                ]
            ],
            [
                [
                    "එකමන්තං ඨිතං ඛො රාහුං අසුරින්දං",
                    "එකත් පස්ව සිටියා වූ රාහු අසුරිඳු හට"
                ],
                [
                    "වෙපචිත්ති අසුරින්ද‍ො",
                    "වේපචිත්ති නම් අසුරේන්ද්‍ර තෙම"
                ],
                [
                    "ගාථාය",
                    "ගාථාවකින්"
                ],
                [
                    "අජ්ඣභාසි",
                    "මෙසේ කීයේ ය"
                ]
            ],
            [
                [
                    "කින්නු",
                    "කුමක් හෙයින්"
                ],
                [
                    "සන්තරමානොව",
                    "වෙලෙව් වූවකු මෙන්"
                ],
                [
                    "රාහු",
                    "රාහු අසුරේන්ද්‍රය"
                ],
                [
                    "චන්දං",
                    "සඳු"
                ],
                [
                    "පමුඤචසි",
                    "අත්හැරියෙහි ද?"
                ],
                [
                    "සංවිග්ගරූපො ආගම්ම",
                    "කලකිරුණු, සංවේගයට පත් සිත් ඇත්තෙක් වැ අවුත්"
                ],
                [
                    "කින්නු",
                    "කුමක් හෙයින්"
                ],
                [
                    "හීතොව",
                    "බියවූවකු මෙන්"
                ],
                [
                    "තිට්ඨාසී'ති",
                    "සිටිනෙහි ද?"
                ]
            ],
            [
                [
                    "සත්තධා",
                    "සත්කඩක් ව"
                ],
                [
                    "මෙ",
                    "මගේ"
                ],
                [
                    "ඵලෙ",
                    "පැළෙයි"
                ],
                [
                    "මුද්ධා",
                    "හිස"
                ],
                [
                    "ජීවන්තො",
                    "ජීවත්වන්නේ ද"
                ],
                [
                    "න සුඛං ලභෙ",
                    "සැපයක් නො ලබයි."
                ],
                [
                    "බුද්ධගාථාහි",
                    "බුදුන් විසින් (සඳු හරුව යි) ගාථා දෙකකින්"
                ],
                [
                    "ගීතොම්හි",
                    "ගයන ලද්දක් ඇසුවෙමි"
                ],
                [
                    "නො චෙ මුඤ්චෙය්‍ය චන්දිමං",
                    "ඉදින් සඳු නොඅතහැරියේ නම්."
                ]
            ]
        ]
    },
    "16-suriya-parittam": {
        "labels": [
            [
                0,
                2.056175
            ],
            [
                2.552493,
                21.696192
            ],
            [
                21.696192,
                35.486745
            ],
            [
                35.486745,
                53.247843
            ],
            [
                53.247843,
                73.738691
            ],
            [
                73.738691,
                86.891121
            ],
            [
                86.891121,
                105.325794
            ],
            [
                106.389333,
                134.963076
            ],
            [
                134.963076,
                164.67126
            ],
            [
                164.67126,
                177.965495
            ],
            [
                177.965495,
                196.648327
            ],
            [
                197.392805,
                217.600042
            ]
        ],
        "text": [
            [
                [
                    "සුරියපරිත්තං",
                    "සූරිය පිරිත"
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී"
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත්නුවර සමීපයෙහි"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු මහ සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "ආරාමයෙහි"
                ]
            ],
            [
                [
                    "තෙත ඛො පන සමයෙන",
                    "එ සමයෙහි වනාහි"
                ],
                [
                    "සුරියො දෙවපුත්තො",
                    "හිරු දෙව්පුත් තෙමේ"
                ],
                [
                    "රාහුනා අසුරින්දෙන",
                    "රාහු අසුරේන්ද්‍රයා විසින්"
                ],
                [
                    "ගහිතො හොති",
                    "ගන්නා ලද්දේ වෙයි"
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "ඉක්බිති"
                ],
                [
                    "සුරියො දෙව පුත්තො",
                    "හිරු දෙව්පුත් තෙමේ"
                ],
                [
                    "භගවන්තං",
                    "බුදුරදුත්"
                ],
                [
                    "අනුස්සරමානො",
                    "සිහි කරමින්"
                ],
                [
                    "තායං වේලායං",
                    "එ වේලෙහි"
                ],
                [
                    "ඉමං ගාථං",
                    "මේ ගාථාව"
                ],
                [
                    "අභාසි",
                    "කීය."
                ]
            ],
            [
                [
                    "නමො",
                    "නමස්කාර වේවා"
                ],
                [
                    "තෙ",
                    "නුඹ වහන්සේට"
                ],
                [
                    "බුද්ධවීර අත්ථු",
                    "බුද්ධවීරයන් වහන්ස"
                ],
                [
                    "විප්පමුත්තො අසි",
                    "කෙලෙසුන් කෙරෙන් විශේෂයෙන් මිදුණු"
                ],
                [
                    "සබ්බධි",
                    "සියලු කල්හි."
                ],
                [
                    "සම්බාධ පටිපන්නෝ අස්මි",
                    "(මම) සම්බාධයකට පැමිණියෙමි"
                ],
                [
                    "තස්ස මෙ",
                    "ඒ මට"
                ],
                [
                    "සරණං භව",
                    "පිළිසරණ වුව මැනව."
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "එකල්හි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සුරියං දෙවපුත්තං",
                    "හිරු දෙව් පුතුන්"
                ],
                [
                    "ආරබ්හ",
                    "අරභයා"
                ],
                [
                    "රාහුං අසුරින්දං",
                    "රාහු අසුරිඳු හට"
                ],
                [
                    "ගාථාය",
                    "ගාථාවකින්"
                ],
                [
                    "අජ්ඣභාසි",
                    "මෙසේ වද‍ාළ සේක."
                ]
            ],
            [
                [
                    "තථාගතං",
                    "තථාගතයන් වහන්සේ"
                ],
                [
                    "අරහන්තං",
                    "අරහත් වූ"
                ],
                [
                    "චන්දිමා",
                    "සඳදෙව් පුත් තෙමේ"
                ],
                [
                    "සරණගතො",
                    "සරණ ගියේ ය"
                ],
                [
                    "රාහු",
                    "රාහු අසුරේන්ද්‍රය"
                ],
                [
                    "සුරියං පමුඤ්චස්සු",
                    "හිරු අතහැරව"
                ],
                [
                    "බුද්ධා",
                    "බුදුවරයෝ"
                ],
                [
                    "ලොකානුකම්පකා",
                    "ලොවට අනුකම්පා කරන්නෝ ය. (එහෙයින්)"
                ]
            ],
            [
                [
                    "යො",
                    "යම් සූර්යයෙක්"
                ],
                [
                    "අන්ධකාරෙ තමසි",
                    "ගන අඳුරු දුරහැර"
                ],
                [
                    "පහංකරො",
                    "පහන් කෙරේ ද"
                ],
                [
                    "වෙරොචනො මණ්ඩලී",
                    "බබලන මඬුලු ඇත්තේ ද"
                ],
                [
                    "උග්ගතෙජො",
                    "මහතෙද ඇත්තේ ද"
                ],
                [
                    "මා",
                    "නොම"
                ],
                [
                    "රාහු",
                    "එම්බල රාහු"
                ],
                [
                    "ගිල",
                    "ගිලව"
                ],
                [
                    "චරං",
                    "හැසිරෙන හිරු"
                ],
                [
                    "අන්තලික්ඛෙ",
                    "අහසෙහි"
                ],
                [
                    "පජං මම",
                    "මගේ පූත්‍ර වූ"
                ],
                [
                    "රාහු",
                    "එබල රාහු"
                ],
                [
                    "පමුඤ්ච",
                    "මුදවයි"
                ],
                [
                    "සූරියං ඉති",
                    "හිරුව.' යි වද‍ාළ සේක"
                ]
            ],
            [
                [
                    "අථ ඛො",
                    "ඉක්බිති"
                ],
                [
                    "රාහු අසුරින්දෝ",
                    "රාහු අසුරේන්ද්‍ර තෙම"
                ],
                [
                    "සූරියං දෙවපුත්තං",
                    "හිරු දෙව්පුතු"
                ],
                [
                    "මුඤ්චිත්වා",
                    "හැර"
                ],
                [
                    "තරමාණ රූපො",
                    "වෙළෙවි වූයේ"
                ],
                [
                    "යෙන",
                    "යම් තැනක් හි වීද"
                ],
                [
                    "වෙපචිත්ති අසුරේන්ද‍ො",
                    "වේපචිත්ති අසුරේන්ද්‍රයා"
                ],
                [
                    "තෙන",
                    "එතැන්හි"
                ],
                [
                    "උපසංකමි",
                    "එළඹියේ ය"
                ],
                [
                    "උපසංකමිත්වා",
                    "එළඹ"
                ],
                [
                    "සංවිග්ගො",
                    "සංවේග ඇත්තේ"
                ],
                [
                    "ලොමහට්ඨජාතො",
                    "ලොමුද‍ැහැගත් සිරුරු ඇත්තේ"
                ],
                [
                    "එකමන්තං",
                    "එකත් පසෙක"
                ],
                [
                    "අට්ඨාසි",
                    "සිටියේ ය"
                ]
            ],
            [
                [
                    "එකමන්තං ඨිතං ඛො රාහුං අසුරින්දං",
                    "එකත් පස්ව සිටියා වූ රාහු අසුරිඳු හට"
                ],
                [
                    "වෙපචිත්ති අසුරින්ද‍ො",
                    "වේපචිත්ති නම් අසුරේන්ද්‍ර තෙම"
                ],
                [
                    "ගාථාය",
                    "ගාථාවකින්"
                ],
                [
                    "අජ්ඣභාසි",
                    "මෙසේ කීයේ ය"
                ]
            ],
            [
                [
                    "කින්නු",
                    "කුමක් හෙයින්"
                ],
                [
                    "සන්තරමානොව",
                    "වෙලෙව් වූවකු මෙන්"
                ],
                [
                    "රාහු",
                    "රාහු අසුරේන්ද්‍රය"
                ],
                [
                    "සූරියං",
                    "හිරු"
                ],
                [
                    "පමුඤචසි",
                    "අත්හැරියෙහි ද?"
                ],
                [
                    "සංවිග්ගරූපො ආගම්ම",
                    "කලකිරුණු, සංවේගයට පත් සිත් ඇත්තෙක් වැ අවුත්"
                ],
                [
                    "කින්නු",
                    "කුමක් හෙයින්"
                ],
                [
                    "හීතොව",
                    "බියවූවකු මෙන්"
                ],
                [
                    "තිට්ඨාසී'ති",
                    "සිටිනෙහි ද?"
                ]
            ],
            [
                [
                    "සත්තධා",
                    "සත්කඩක් ව"
                ],
                [
                    "මෙ",
                    "මගේ"
                ],
                [
                    "ඵලෙ",
                    "පැළෙයි"
                ],
                [
                    "මුද්ධා",
                    "හිස"
                ],
                [
                    "ජීවන්තො",
                    "ජීවත්වන්නේ ද"
                ],
                [
                    "න සුඛං ලභෙ",
                    "සැපයක් නො ලබයි."
                ],
                [
                    "බුද්ධගාථාහි",
                    "බුදුන් විසින් (සඳු හරුව යි) ගාථා දෙකකින්"
                ],
                [
                    "ගීතොම්හි",
                    "ගයන ලද්දක් ඇසුවෙමි"
                ],
                [
                    "නො චෙ මුඤ්චෙය්‍ය සූරියං",
                    "ඉදින් හිරු නොඅතහැරියේ නම්."
                ]
            ]
        ]
    },
    "17-dhajagga-parittam": {
        "labels": [
            [
                0,
                3.25323
            ],
            [
                3.25323,
                22.06774
            ],
            [
                22.06774,
                43.267953
            ],
            [
                43.267953,
                68.046718
            ],
            [
                68.046718,
                92.933924
            ],
            [
                92.933924,
                112.670183
            ],
            [
                112.670183,
                130.074961
            ],
            [
                130.074961,
                154.14886
            ],
            [
                154.14886,
                174.589985
            ],
            [
                174.589985,
                197.525254
            ],
            [
                197.525254,
                217.966379
            ],
            [
                217.966379,
                242.202939
            ],
            [
                242.202939,
                301.249055
            ],
            [
                301.249055,
                320.280448
            ],
            [
                320.280448,
                358.614336
            ],
            [
                359.210762,
                387.459638
            ],
            [
                387.459638,
                405.894606
            ],
            [
                406.599472,
                416.847145
            ],
            [
                416.847145,
                437.667814
            ],
            [
                437.667814,
                456.482325
            ],
            [
                456.482325,
                467.543305
            ],
            [
                467.543305,
                498.394765
            ],
            [
                499.262293,
                532.011471
            ],
            [
                532.011471,
                553.91655
            ],
            [
                553.91655,
                578.15311
            ],
            [
                578.912197,
                591.003366
            ],
            [
                591.003366,
                610.793846
            ],
            [
                610.793846,
                630.692767
            ],
            [
                630.692767,
                650.591687
            ],
            [
                650.591687,
                672.659428
            ]
        ],
        "text": [
            [
                [
                    "ධජග්ග පරිත්තං",
                    "ධජග්ග පිරිත"
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "මෙ",
                    "මා විසින්"
                ],
                [
                    "සුතං",
                    "අසන ලදී"
                ],
                [
                    "එකං සමයං",
                    "එක් සමයෙක"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "සාවත්ථියං",
                    "සැවැත්නුවර සමීපයෙහි"
                ],
                [
                    "විහරති",
                    "වැඩ වසන සේක"
                ],
                [
                    "ජෙතවනෙ",
                    "ජේතවන නම් වූ"
                ],
                [
                    "අනාථ පිණ්ඩිකස්ස",
                    "අනේපිඬු මහ සිටුහු ගේ"
                ],
                [
                    "ආරාමෙ",
                    "ආරාමයෙහි"
                ]
            ],
            [
                [
                    "තත්‍ර ඛො",
                    "එකල්හි වනාහි"
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "භික්ඛු",
                    "භික්‍ෂූන්"
                ],
                [
                    "ආමන්තෙසි",
                    "ඇමතූහ"
                ],
                [
                    "භික්ඛවො'ති",
                    "මහණෙනි කියා"
                ],
                [
                    "භදන්තෙ ඉති",
                    "වහන්සැ'යි"
                ],
                [
                    "තෙ භික්ඛු",
                    "ඒ භික්ෂූහු"
                ],
                [
                    "භගවතො",
                    "භාග්‍යවතුන් වහන්සේට"
                ],
                [
                    "පච්චස්සොසුං",
                    "පිළිවදන් දුන්හ."
                ],
                [
                    "භගවා",
                    "භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "එතං අවොච",
                    "මෙය වද‍ාළ සේක."
                ]
            ],
            [
                [
                    "භූතපුබ්බං",
                    "පෙර වූ දෙයක් කියමි"
                ],
                [
                    "භික්ඛවේ",
                    "මහණෙනි"
                ],
                [
                    "දෙවාසුරසංගාමො",
                    "දෙවියන් හා අසුරයන් අතර සංග්‍රාමයක්"
                ],
                [
                    "සමූපබ්බුළ්හො අහොසි",
                    "එළඹුනේ විය"
                ],
                [
                    "අථ ඛො",
                    "ඉක්බිති"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "සක්කො දෙවානමින්ද‍ො",
                    "සක්දෙව් රජතෙම"
                ],
                [
                    "දෙවෙ තාවතිංසෙ",
                    "තව්තිසා වැසි දෙවියන්"
                ],
                [
                    "ආමන්තෙසි",
                    "ඇමතුවේය."
                ]
            ],
            [
                [
                    "සචෙ",
                    "ඉදින්"
                ],
                [
                    "මාරිසා",
                    "නිදුකාණෙනි"
                ],
                [
                    "දෙවානං",
                    "දෙවියන්ට"
                ],
                [
                    "සංගාමගතානං",
                    "යුද්ධයට ගිය"
                ],
                [
                    "උප්පජ්ජෙය්‍ය",
                    "උපන්නේ නම්"
                ],
                [
                    "භයං වා",
                    "බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැතිගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැන්මෙක් හෝ"
                ],
                [
                    "මම එව තස්මිං සමයෙ",
                    "එ සමයෙහි මගේ ම"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකෙය්‍යාථ",
                    "බලව්."
                ]
            ],
            [
                [
                    "මමංහි වො",
                    "තොපට මගේ වනාහි"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකයතං",
                    "බලන්නා වූ"
                ],
                [
                    "යං භවිස්සති",
                    "යම් වේ ද"
                ],
                [
                    "භයං වා",
                    "බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැතිගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැන්මෙක් හෝ"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරු වෙයි."
                ]
            ],
            [
                [
                    "නො චෙ මෙ ධජග්ගං උල්ලොකෙය්‍යාථ",
                    "ඉදින් මාගේ ධ්වජාග්‍රය නොබලා නම්"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "පජාපතිස්ස දේවරාජස්ස",
                    "ප්‍රජාපති දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකෙය්‍යාථ",
                    "බලව්."
                ]
            ],
            [
                [
                    "පජාපතිස්සහි වො දෙවරාජස්ස",
                    "තොපට ප්‍රජාපති නම් දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකයතං",
                    "බලන්නා වූ"
                ],
                [
                    "යං භවිස්සති",
                    "යම් වේ ද"
                ],
                [
                    "භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැන්මෙක් හෝ"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවෙයි."
                ]
            ],
            [
                [
                    "නො චෙ පජාපතිස්ස දෙවරාජස්ස ධජග්ගං උල්ලොකෙය්‍යාථ",
                    "ඉදින්  ප්‍රජාපතී දෙව් රජහු ගේ ධ්වජාග්‍රය නොබලා නම්"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "වරුණස්ස දේවරාජස්ස",
                    "වරුණ දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකෙය්‍යාථ",
                    "බලව්."
                ]
            ],
            [
                [
                    "වරුණස්සහි වො දෙවරාජස්ස",
                    "තොපට වරුණ නම් දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකයතං",
                    "බලන්නා වූ"
                ],
                [
                    "යං භවිස්සති",
                    "යම් වේ ද"
                ],
                [
                    "භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැන්මෙක් හෝ"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවෙයි."
                ]
            ],
            [
                [
                    "නො චෙ වරුණස්ස දෙවරාජස්ස ධජග්ගං උල්ලොකෙය්‍යාථ",
                    "ඉදින්  වරුණ දෙව් රජහු ගේ ධ්වජාග්‍රය නොබලා නම්"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "ඊසානස්ස දේවරාජස්ස",
                    "ඊසාන දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකෙය්‍යාථ",
                    "බලව්."
                ]
            ],
            [
                [
                    "ඊසානස්සහි වො දෙවරාජස්ස",
                    "තොපට ඊසාන නම් දෙව්රජහු ගේ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලොකයතං",
                    "බලන්නා වූ"
                ],
                [
                    "යං භවිස්සති",
                    "යම් වේ ද"
                ],
                [
                    "භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැන්මෙක් හෝ"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවෙයි."
                ]
            ],
            [
                [
                    "තං ඛො පන",
                    "ඒ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "සක්කස්ස වා දෙවානමින්දස්ස",
                    "සක්දෙව් රජුහු ගේ හෝ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලෙකයතං",
                    "බලන්නහුට"
                ],
                [
                    "පජාපතිස්සවා දෙවරාජස්ස",
                    "ප්‍රජාපති දෙව්රජු ගේ හෝ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලෙකයතං",
                    "බලන්නහුට"
                ],
                [
                    "වරුණස්ස වා දෙවරාජස්ස",
                    "වරුණ නම් දෙව්රජහු ගේ හෝ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලෙකයතං",
                    "බලන්නහුට"
                ],
                [
                    "ඊසානස්ස වා දෙවරාජස්ස",
                    "ඊසාන නම් දෙව්රජහු ගේ හෝ"
                ],
                [
                    "ධජග්ගං",
                    "ධ්වජාග්‍රය"
                ],
                [
                    "උල්ලෙකයතං",
                    "බලන්නහුට"
                ],
                [
                    "යං භවිස්සති භයං වා",
                    "යම් වේ ද බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැනීමක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැනීමක් හෝ"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයෙථාපි",
                    "දුරු වන්නේ හෝ ද වේ"
                ],
                [
                    "නො පි පහියෙථ",
                    "දුරු නො වන්නේ හෝ ද වෙයි"
                ],
                [
                    "තංකිස්සහෙතු?",
                    "එයට හේතු කවරේ ද යත්?"
                ]
            ],
            [
                [
                    "සක්කොහි භික්ඛවෙ දෙවානමින්දෝ",
                    "මහණෙනි සක්දෙව් රජතෙම වනාහි"
                ],
                [
                    "අවිතරාගො",
                    "දුරු නො කළ රාග ඇත්තේ ය"
                ],
                [
                    "අවිතද‍ොසො",
                    "දුරු නොකළ ද්වේෂ ඇත්තේ ය"
                ],
                [
                    "අවිතමොහො",
                    "දුරු නො කළ මෝහ ඇත්තේ ය"
                ],
                [
                    "භීරු",
                    "බියවන සුලු ය"
                ],
                [
                    "ඡම්භි",
                    "තැති ගන්නා සුලුය"
                ],
                [
                    "උත්‍රාසි",
                    "අතිශයින් ම බියවන සුලුය"
                ],
                [
                    "පලායි ඉති",
                    "පලා යන සුලුය."
                ]
            ],
            [
                [
                    "අහඤ්ව ඛො",
                    "මම ද"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "තුම්හාකං",
                    "නුඹලාට"
                ],
                [
                    "එවං වද‍ාමි",
                    "මෙසේ කියමි"
                ],
                [
                    "සවෙ",
                    "ඉදින්"
                ],
                [
                    "තුම්හාකං",
                    "නුඹලාට"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "අරඤ්ඤගතානං වා",
                    "වනයට ගියා වූ හෝ"
                ],
                [
                    "රුක්ඛමූලගතානං වා",
                    "රුක්මුලට ගියා වූ හෝ"
                ],
                [
                    "සුඤ්ඤ‍ාගාරගතානං වා",
                    "ගෙවලින් හිස් තැනකට ගියා වූ හෝ"
                ],
                [
                    "උප්පජ්ජෙය්‍ය",
                    "උපදනේ වී නම්"
                ],
                [
                    "භයං වා",
                    "බියෙක් හෝ"
                ],
                [
                    "ඡම්හිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැමෙක් හෝ"
                ],
                [
                    "මං එව",
                    "මාම"
                ],
                [
                    "තස්මිං සමයෙ",
                    "ඒ සමයෙහි"
                ],
                [
                    "අනුස්සරෙය්‍යාථ",
                    "සිහි කරව් (කෙසේ ද?)"
                ]
            ],
            [
                [
                    "ඉතිපි",
                    "මේ කරුණෙනුදු"
                ],
                [
                    "සො භගවා",
                    "ඒ භාග්‍යවතුන් වහන්සේ"
                ],
                [
                    "අරහං",
                    "අර්හත් ය"
                ],
                [
                    "සම්මා සම්බුද්ධෝ",
                    "සම්‍යක් සම්බුද්ධ ය"
                ],
                [
                    "විජ්ජා චරණ සම්පන්නො",
                    "විද්‍යාචරණ ධර්මයන් ගෙන් යුක්ත ය"
                ],
                [
                    "සුගතො",
                    "සුගත ය"
                ],
                [
                    "ලොකවිදු",
                    "ලෝකවිදු ය"
                ],
                [
                    "අනුන්තරො",
                    "අනුත්තර ය"
                ],
                [
                    "පුරිස දම්ම සාරථි",
                    "පුරිස දම්මසාරථි ය"
                ],
                [
                    "සත්ථා දේවමනුස්සානං",
                    "දෙව් මිනිසුනට අනුශාසක ය"
                ],
                [
                    "බුද්ධො",
                    "බුද්ධ ය"
                ],
                [
                    "භගවා ඉති",
                    "භාග්‍යවත් ය (කියායි)."
                ]
            ],
            [
                [
                    "මමංහි වො භික්ඛවෙ අනුස්සරතං",
                    "මහණෙනි මා සිහි කරන්නා වූ තොපට"
                ],
                [
                    "යං භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැමෙක් හෝ"
                ],
                [
                    "භවිස්සති",
                    "වේ ද?"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවේ"
                ]
            ],
            [
                [
                    "නො චෙ මං අනුස්සරෙය්‍යාථ",
                    "ඉදින් මා සිහි නො කරව් නම්"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "ධම්මං",
                    "ධර්මය"
                ],
                [
                    "අනුස්සරෙය්‍යාථ",
                    "සිහි කරව්."
                ]
            ],
            [
                [
                    "ස්වාක්ඛාතො",
                    "මොනවට දෙසන ලද"
                ],
                [
                    "භගවතා",
                    "බුදුරදුන් විසින්"
                ],
                [
                    "ධම්මො",
                    "ධර්මය තෙම"
                ],
                [
                    "සන්දිට්ඨිකො",
                    "සාන්දෘෂ්ටික ය"
                ],
                [
                    "අකාලිකො",
                    "කල් නො යවා විපාක දෙන්නේ ය"
                ],
                [
                    "එහිපස්සිකො",
                    "එව බලව යන විදියට සුදුසු ය"
                ],
                [
                    "ඔපනයිකො",
                    "එළඹීමට සුදුසු ය"
                ],
                [
                    "පච්චත්තං",
                    "තම තමන් කෙරෙහි ලා"
                ],
                [
                    "වෙදිතබ්බො",
                    "දතයුත්තේ ය"
                ],
                [
                    "විඤ්ඤූහි'ඉති",
                    "නුවණැත්තන් විසින් (යනුයි)."
                ]
            ],
            [
                [
                    "ධම්මංහි වො භික්ඛවෙ අනුස්සරතං",
                    "මහණෙනි ධර්මය සිහි කරන්නා වූ තොපට"
                ],
                [
                    "යං භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැමෙක් හෝ"
                ],
                [
                    "භවිස්සති",
                    "වේ ද?"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවේ."
                ]
            ],
            [
                [
                    "නො චෙ ධම්මං අනුස්සරෙය්‍යාථ",
                    "ඉදින් ධර්මය සිහි නො කරව් නම්"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "සංඝං",
                    "සඟුන්"
                ],
                [
                    "අනුස්සරෙය්‍යාථ",
                    "සිහි කරව් (කෙසේ ද?)"
                ]
            ],
            [
                [
                    "සුපටිපන්නො භගවතො සාවක සංඝො",
                    "භාග්‍යවතුන් වහන්සේ ගේ ශ්‍රාවක සංඝ තෙමේ මනාව පිළිපන්නේ ය"
                ],
                [
                    "උජුපටිපන්නො භගවතො සාවක සංඝො",
                    "භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝ තෙමේ ඍජු වූ පිළිවෙතින් යුක්ත ය"
                ],
                [
                    "ඤ‍ායපටිපන්නො භගවතො සාවක සංඝො",
                    "භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝ තෙමේ නිවන් සඳහා පිළිපන්නේ ය"
                ],
                [
                    "සාමීචිපටිපන්නො භගවතො සාවක සංඝො",
                    "භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝ තෙමේ ත්‍රිශික්ෂාවෙහි ගරු කිරීමට සුදුසු පිළිවෙත්හි පිළිපන්නේ ය."
                ]
            ],
            [
                [
                    "යදිදං",
                    "යම් මේ"
                ],
                [
                    "චත්තාරි පුරුෂ යුගානි",
                    "පුරුෂ යුගල වශයෙන් සතර කොටසක් වෙත් ද"
                ],
                [
                    "අට්ඨපුරිස පුග්ගලා",
                    "පුරුෂ පුද්ගල වශයෙන් අට දෙනෙක් වෙත් ද"
                ],
                [
                    "එස භගවතො සාවක සංඝො",
                    "භාග්‍යවතුන් වහන්සේ ගේ මේ ශ්‍රාවක සංඝ තෙමේ"
                ],
                [
                    "ආහුනෙය්‍යො",
                    "දුරිනිදු ගෙන හැර දිය යුතු ප්‍රත්‍යයට සුදුසු ය"
                ],
                [
                    "පාහුනෙය්‍යො",
                    "අමුතු ප්‍රත්‍යයන් පිළි ගැනීමට සුදුසු ය"
                ],
                [
                    "දක්ඛිණෙ‍ය්‍යො",
                    "දක්ෂිණාවට සුදුසු ය"
                ],
                [
                    "අඤ්ජලිකරණීයො",
                    "ද‍ොහොත් මුදුන් දී වැඳීමට සුදුසු ය"
                ],
                [
                    "අනුත්තරං",
                    "උතුම් වූ"
                ],
                [
                    "පුඤ්ඤක්ඛෙත්තං",
                    "පින් කෙතකැයි"
                ],
                [
                    "ලොකස්ස ඉති",
                    "සියලු ලෝකයාට කියායි."
                ]
            ],
            [
                [
                    "සංඝංහි වො භික්ඛවෙ අනුස්සරතං",
                    "මහණෙනි සංඝයා සිහි කරන්නා වූ තොපට"
                ],
                [
                    "යං භයං වා",
                    "යම් බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැන්මෙක් හෝ"
                ],
                [
                    "ලොමහංසො වා",
                    "ලොමුද‍ැහැගැමෙක් හෝ"
                ],
                [
                    "භවිස්සති",
                    "වේ ද?"
                ],
                [
                    "සො",
                    "හේ"
                ],
                [
                    "පහීයිස්සති",
                    "දුරුවේ"
                ],
                [
                    "තංකිස්ස හෙතු?",
                    "එයට කාරණා කිම යත්?"
                ]
            ],
            [
                [
                    "තථාගතො",
                    "තථාගත තෙම"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "අරහං",
                    "අරහත් වූ"
                ],
                [
                    "සම්මා සම්බුද්ධෝ",
                    "සම්‍යක් සම්බුද්ධ වූ"
                ],
                [
                    "වීතරාගො",
                    "නසන ලද රාග ඇත්තේ ය"
                ],
                [
                    "වීතද‍ොසො",
                    "නසන ලද ද්වේෂ ඇත්තේ ය"
                ],
                [
                    "වීතමොහො",
                    "නසන ලද මෝහ ඇත්තේ ය"
                ],
                [
                    "අභීරු",
                    "බිය නොවන සුලුය"
                ],
                [
                    "අච්ඡම්හි",
                    "තැති නො ගන්නා සුලුය"
                ],
                [
                    "අනුත්‍රාසි",
                    "ත්‍රාස නො වන සුලුය"
                ],
                [
                    "අපලා යි ඉති",
                    "බියෙන් පලා නො යන්නේ ය."
                ]
            ],
            [
                [
                    "ඉදං අවොච",
                    "මේ ධජග්ග පරිත්තය වද‍ාළේ ය"
                ],
                [
                    "භගවා",
                    "භාග්‍යවත් තෙම"
                ],
                [
                    "ඉදං වත්වා",
                    "මේ වද‍ාරා"
                ],
                [
                    "සුගතො",
                    "සුගත වූ"
                ],
                [
                    "අථ",
                    "නැවත"
                ],
                [
                    "අපරං",
                    "අන්‍ය වූ"
                ],
                [
                    "එතං අවොච",
                    "මේ කාරණය වද‍ාළ සේක"
                ],
                [
                    "සත්ථා",
                    "ශාස්තෘෘන්වහන්සේ."
                ]
            ],
            [
                [
                    "අරඤ්ඤෙ",
                    "ආරණ්‍යයෙහි හෝ"
                ],
                [
                    "රුක්ඛමූලෙ වා",
                    "රුක් මුල්හි හෝ"
                ],
                [
                    "සුඤ්ඤ‍ාගාරෙ වා",
                    "ජන ශුන්‍ය ස්ථානයක හෝ"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "අනුස්සරෙථ",
                    "සිහි කරව්"
                ],
                [
                    "සම්බුද්ධං",
                    "සම්බුදුන්"
                ],
                [
                    "භයං",
                    "බියෙක්"
                ],
                [
                    "තුම්හාකං",
                    "තොපට"
                ],
                [
                    "නො සියා",
                    "නො වන්නේ යි."
                ]
            ],
            [
                [
                    "නො චෙ බුද්ධං සරෙය්‍යාථ",
                    "බුදුරදුන් ඉදින් සිහි නො කරව් නම්"
                ],
                [
                    "ලොකජෙට්ඨං",
                    "ලොවට ජ්‍යෙෂ්ඨ වූ"
                ],
                [
                    "නරාසහං",
                    "නරෝත්තම වූ"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "ධමමං",
                    "ධර්මය"
                ],
                [
                    "සරෙය්‍යාථ",
                    "සිහි කරව්"
                ],
                [
                    "නිය්‍යාණිකං",
                    "නෛර්යානික වූ"
                ],
                [
                    "සුදෙසිතං",
                    "මනාකොට දෙසන ලද."
                ]
            ],
            [
                [
                    "නො චෙ ධම්මං සරෙය්‍යාථ",
                    "සද්ධර්මය ඉදින් සිහි නො කරව් නම්"
                ],
                [
                    "නිය්‍යාණිකං",
                    "නෛර්යානික වූ"
                ],
                [
                    "සුදෙසිතං",
                    "මොනවට දෙසන ලද"
                ],
                [
                    "අථ",
                    "ඉක්බිති"
                ],
                [
                    "සංඝං",
                    "සංඝයා"
                ],
                [
                    "සරෙය්‍යාථ",
                    "සිහි කරව්"
                ],
                [
                    "පුඤ්ඤඛෙත්තං",
                    "පින් කෙතක් වූ"
                ],
                [
                    "අනුත්තරං",
                    "අනුත්තර වූ."
                ]
            ],
            [
                [
                    "එවං",
                    "මෙසේ"
                ],
                [
                    "බුද්ධං",
                    "බුදුන් ද"
                ],
                [
                    "සරන්තානං",
                    "සිහි කරන්නවුනට"
                ],
                [
                    "ධම්මං",
                    "ධර්මය ද"
                ],
                [
                    "සංඝං ච",
                    "සංඝයා ද"
                ],
                [
                    "භික්ඛවෙ",
                    "මහණෙනි"
                ],
                [
                    "භයං වා",
                    "බියෙක් හෝ"
                ],
                [
                    "ඡම්භිතත්තං වා",
                    "තැති ගැමෙක් හෝ"
                ],
                [
                    "ලොමහංසො",
                    "ලොමු ද‍ැහැගැන්මෙක්"
                ],
                [
                    "න හි එස්සති",
                    "නොවේ."
                ]
            ]
        ]
    }
}